Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/plugins/activities.po
Languages: es, fr_fr, ta, uk

source: Activities
es: Actividades
fr_fr: Activités
ta: நடவடிக்கைகள்
uk: Діяльність

source: This plugin was developped for `Association l'Aphyllanthe <https://www.aphyllanthe.fr/>`_. It provides:
es: Este complemento fue desarrollado por la `Asociación l'Aphyllanthe <https://www.aphyllanthe.fr/>`_. Ofrece:
fr_fr: Ce plugin a été développé pour `l'Association l'Aphyllanthe <https://www.aphyllanthe.fr/>`_. Il fournit :
ta: இந்த சொருகி `அசோசியேசன் l'aphyllanthe <https://www.aphyllanthe.fr/> _ _ க்காக உருவாக்கப்பட்டது. இது வழங்குகிறது:
uk: Цей плагін розроблено для `Association l'Aphyllanthe <https://www.aphyllanthe.fr/>`_. Він забезпечує:

source: activities management,
es: gestión de actividades,
fr_fr: gestion d'activités,
ta: செயல்பாடுகள் மேலாண்மை,
uk: управління діяльністю,

source: subscriptions management.
es: gestión de suscripciones.
fr_fr: gestion de souscriptions.
ta: சந்தா மேலாண்மை.
uk: управління підписками.

source: This plugin requires Galette `1.1.4` or later.
es: Este complemento requiere Galette `1.1.4` o posterior.
ta: இந்த சொருகி கேலட் `1.1.4` அல்லது அதற்குப் பிறகு தேவைப்படுகிறது.
uk: Для цього плагіна потрібен Galette `1.1.4` або новішої версії.

source: Installation
es: Instalación
ta: நிறுவல்
uk: Встановлення

source: First of all, download the plugin:
es: Antes que todo, descargue el complemento:
fr_fr: Tout d'abord, téléchargez le plugin :
ta: முதலில், சொருகி பதிவிறக்கவும்:
uk: Перш за все, завантажте плагін:

source: Get latest Activities plugin!
es: ¡Obtén el último complemento de actividades!
fr_fr: Obtenir le dernier plugin Activities !
ta: அண்மைக் கால செயல்பாடுகள் சொருகி கிடைக்கும்!
uk: Отримайте останній плагін Activities!

source: Get Activities plugin nightly build!
es: ¡Obtén la compilación nightly del complemento actividades!
fr_fr: Obtenir la nightly du plugin Activities !
ta: செயல்பாடுகளைப் பெறுங்கள் சொருகி இரவு நேரத்தை உருவாக்குதல்!
uk: Отримайте нічну збірку плагіна Activities!

source: Extract the downloaded archive in Galette ``plugins`` directory. For example, under linux (replacing `{url}` and `{version}` with correct values):
es: Extraer el archivo descargado en el directorio de Galette ``plugins``. Por ejemplo, bajo linux (reemplazar `{url}` y `{version}`con valores correctos):
fr_fr: Extrayez l'archive téléchargée dans le dossier ``plugins`` de Galette. Par exemple, sous linux (en remplaçant `{url}` et `{version}` par les valeurs adéquates) :
ta: பதிவிறக்கம் செய்யப்பட்ட காப்பகத்தை கேலட் `` செருகுநிரல்கள்`` கோப்பகத்தில் பிரித்தெடுக்கவும். எடுத்துக்காட்டாக, லினக்சின் கீழ் (`{url}` மற்றும் {{version} `ஆகியவற்றை சரியான மதிப்புகளுடன் மாற்றுகிறது):
uk: Розпакуйте завантажений архів у каталог Galette ``plugins``. Наприклад, під Linux (замінивши `{url}` і `{version}` на правильні значення):

source: Database initialisation
es: Inicio de la base de datos
fr_fr: Initialisation de la base de données
ta: தரவுத்தள துவக்கம்
uk: Ініціалізація бази даних

source: In order to work, this plugin requires several tables in the database. See :ref:`Galette plugins management interface <plugins_managment>`.
es: Para funcionar, este plugin requiere varias tablas en la base de datos. Ver :ref:`Interfaz de gestión de plugins Galette <plugins_managment>`.
fr_fr: Pour fonctionner, ce plugin requiert des tables dans la base de données. Référez-vous :ref:`à l'interface de gestion des plugins de Galette <plugins_managment>`.
ta: வேலை செய்ய, இந்த சொருகி தரவுத்தளத்தில் பல அட்டவணைகள் தேவை. காண்க :ref:`கேலட் செருகுநிரல்கள் மேலாண்மை இடைமுகம் <plugins_managment>`.
uk: Для роботи цього плагіна потрібно кілька таблиць у базі даних. Перегляньте :ref:`Інтерфейс керування плагінами Galette <plugins_managment>`.

source: And this is finished; Activities plugin is installed :)
es: Y se acabó; el complemento de actividades está instalado :)
fr_fr: Et c'est fini; le plugin Activités est installé :)
ta: இது முடிந்தது; செயல்பாடுகள் சொருகி நிறுவப்பட்டுள்ளது :)
uk: І це закінчено; Плагін Activities встановлено :)
