Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/plugins/auto.po
Languages: de, es, it, uk

source: Auto
es: Automático

source: This plugin provides vehicles management for automobile clubs, you can manage:
de: Dieses Plugin bietet Fahrzeugmanagement für Automobilclubs, hier können Sie diese verwalten:
es: Este plugin proporciona la gestión de vehículos para los clubes de automóviles, puede gestionar:
it: Questo componente aggiuntivo fornisce la gestione del parco auto per gli automobile club. Puoi gestire:
uk: Це розширення забезпечує управління транспортними засобами для автомобільних клубів, ви можете управляти:

source: vehicles (owner, several information, photo, etc),
de: Fahrzeuge (Eigentümer, Zusatzinformationen, Foto usw.),
es: vehículos (propietario, informaciones varias, foto, etc),
it: veicoli (proprietario, altre informazioni, foto, etc),
uk: транспортні засоби (власник, кілька відомостей, світлина тощо),

source: vehicle history modification (owner, color, ...),
de: Fahrzeughistorie Änderungen (Besitzer, Farbe, ...),
es: modificación del historial del vehículo (propietario, color, ...),
it: storia delle modifiche del veicolo (proprietari, colore, ...),
uk: модифікація історії автомобіля (власник, колір, ...),

source: brands,
de: Marken,
es: marcas,
it: marche,
uk: бренди,

source: models,
de: Modelle,
es: modelos
it: modelli,
uk: моделі,

source: transmission types,
de: Getriebe Typen,
es: tipos de transmisión,
it: tipo di trasmissione,
uk: види передачі,

source: body types,
es: tipos de cuerpo,
it: tipo di carrozzeria,
uk: види кузова,

source: colors,
de: Farben,
es: colores,
it: colori,
uk: кольори,

source: finitions,
es: acabados,
it: finiture,
uk: оздоблення,

source: states.
de: Zustände.
es: condiciones.
it: condizioni.
uk: функції.

source: This plugin has been initially developed in collaboration with Anatole from `Club 404 <https://www.leclub404.com/>`_, and François from `club Fiat 500 <http://www.club500.fr/>`_. A big thanks to them for their precious help during plugin development :)
de: Dieses Plugin wurde in Zusammenarbeit mit Anatole von `Club 404 <https://www.leclub404.com/>`_ und François von `club Fiat 500 <http://www.club500.fr/>`_ entwickelt. Ein großer Dank gilt ihnen für ihre wertvolle Hilfe bei der Plugin-Entwicklung :)
es: Este plugin ha sido desarrollado inicialmente en colaboración con Anatole de `Club 404 <https://www.leclub404.com/>`_, y François de `club Fiat 500 <http://www.club500.fr/>`_. Muchas gracias por su valiosa ayuda durante el desarrollo del plugin :)
it: Questo componente aggiuntivo è stato inizialmente sviluppato in collaborazione con Anatole del `Club 404 <https://www.leclub404.com/>`_, e François del `club Fiat 500 <http://www.club500.fr/>`_. Un grande grazie per il loro prezioso aiuto durante lo sviluppo :)
uk: Це розширення було спочатку розроблене у співпраці з Anatole з `Club 404 <https://www.leclub404.com/>`_, та François з `club Fiat 500 <http://www.club500.fr/>`_. Красно дякуємо їм за дорогоцінну допомогу під час розвитку розширення :)

source: Installation
es: Instalación
it: Installazione
uk: Встановлення

source: First of all, download the plugin:
de: Laden Sie zunächst das Plugin herunter:
es: Lo primero de todo, descarga el complemento:
it: Prima di tutto, scaricare il plugin:
uk: Перш за все, завантажте розширення:

source: Get latest Auto plugin!
de: Holen Sie sich das neueste Auto Plugin!
es: ¡Obtenga el último plugin de Auto!
it: Ottieni l'ultima versione del plugin Auto!
uk: Отримайте останню версію розширення «Auto»!

source: Get Auto plugin nightly build!
de: Holen Sie sich die tagesaktuelle Auto Plugin Version!
es: ¡Consigue la versión oscura de plugin Maps!
it: Ottieno il plugin Auto nightly build!
uk: Отримайте плагін Auto nightly build!

source: Extract the downloaded archive in Galette ``plugins`` directory. For example, under linux (replacing `{url}` and `{version}` with correct values):
de: Extrahieren Sie das heruntergeladene Archiv im Verzeichnis Galette ``plugins``. Zum Beispiel unter Linux (Ersetzen Sie `{url}` und `{version}` durch korrekte Werte):
es: Extrae el archivo descargado en la carpeta ``plugin`` de Galette . Por ejemplo, en linux (sustituyendo `{url}` y `{version}` con los valores correctos):
it: Estrai l'archivio scaricato nella cartella ``plugins`` di Galette. Per esempio, su Linux (sostituendo `{url}` e `{version}` con i rispettivi valori):
uk: Витягніть завантажений архів у каталог Galette ``plugins``. Наприклад, ось вказівки під Linux (замініть `{url}` та `{version}` правильними значеннями):

source: Database initialisation
de: Datenbank Initialisierung
es: Inicialización de base de datos
it: Inizializzazione del database
uk: Започаткування бази даних

source: In order to work, this plugin requires several tables in the database. See :ref:`Galette plugins management interface <plugins_managment>`.
de: Um zu funktionieren, benötigt dieses Plugin mehrere Tabellen in der Datenbank. Siehe :ref:`Galette Plugins Management-Schnittstelle <plugins_managment>`.
es: Para que funcione, este complemento necesita varias tablas en la base de datos. Consulta :ref:`la interfaz de gestión de complementos de Galette <plugins_managment>`.
it: Per poter funzionare, questo componente aggiuntivo richiede diverse nuove tabelle nel database. Vedi :ref:`Interfaccia di gestione dei componenti aggiuntivi di Galette <plugins_managment>`.
uk: Для роботи цього розширення потрібно кілька таблиць у базі даних. Див :ref:`Інтерфейс управління розширеннями Galette <plugins_managment>`.

source: And this is finished; Auto plugin is installed :)
de: Und es ist abgeschlossen; Auto Plugin ist installiert :)
es: Y esto está terminado; el plugin Auto está instalado :)
it: Abbiamo finito; il componente aggiuntivo Auto è stato installato :)
uk: Усе завершено. Розширення "Auto" встановлено :)

source: There is no particular setup required, you can just enter data in the database.
de: Es ist kein bestimmtes Setup erforderlich, Sie können einfach Daten in die Datenbank eingeben.
es: No se requiere ninguna configuración particular, basta con introducir los datos en la base de datos.
it: Non ci sono particolari impostazioni richieste, puoi direttamente inserire i dati nel database.
uk: Особливого налаштування не потрібно, ви можете просто ввести дані в базу даних.

source: Configure required fields
de: Benötigte Felder konfigurieren
es: Configurar los campos obligatorios
it: Configura i campi necessari
uk: Налаштуйте обов’язкові поля

source: When adding a new vehicle in database, there are several fields that are required, but that may not fit your needs. In such case, you can define your own required fields: just create a ``local_auto_required.inc.php`` file in your Galette ``config`` directory and declare an array of the fields you want to require. As example, if you just want to require name and model for a car, you will need:
de: Beim Hinzufügen eines neuen Fahrzeugs in der Datenbank gibt es mehrere Felder, die benötigt werden, die jedoch nicht Ihren Bedürfnissen entsprechen. In diesem Fall können Sie Ihre eigenen benötigten Felder definieren: Erstellen Sie einfach ein ``local_auto_required.inc.php``` in Ihrem Galette ``config``-Verzeichnis und deklarieren Sie ein Array der Felder, die Sie benötigen. Wenn Sie beispielsweise nur Name und Modell für ein Auto benötigen möchten, benötigen Sie:
es: Al añadir un nuevo vehículo en la base de datos, hay varios campos que son obligatorios, pero que pueden no ajustarse a sus necesidades. En este caso, puede definir sus propios campos requeridos: sólo tiene que crear un archivo ``local_auto_required.inc`` en su directorio ``config`` de Galette y declarar una matriz de los campos que desea requerir. Por ejemplo, si sólo quieres requerir el nombre y el modelo de un coche, necesitarás:
it: Quando aggiungi un nuovo veicolo nel database, ci sono diversi campi necessari, ma che potrebbero non interessarti. In questi casi, puoi definire i tuoi campi personalizzati: crea un file ``local_auto_required.inc.php`` nella cartella ``config`` di Galette e dichiara un vettore di campi di cui necessiti. Per esempio, se hai bisogno solo il nome e il modello di un'auto, avrai bisogno di:
uk: При додаванні нового автомобіля в базу даних є кілька полів, які необхідні, але які можуть не відповідати вашим потребам. В цьому випадку ви можете визначити свої власні обов'язкові поля: просто створіть ``local_auto_required.inc.php`` файл у вашім каталозі Galette ``config`` і оголосіть масив необхідних полів. Наприклад, якщо ви просто хочете вимагати назву і модель автомобіля, вам це знадобиться:
