Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/plugins/index.po
Languages: es, fr_fr, it, uk

source: :doc:`Plugins documentation <index>`
es: :doc:`Documentación de complementos <index>`
fr_fr: :doc:`Documentation des plugins <index>`
it: :doc:`Documentazione plugin <index>`
uk: :doc:`Документація розширень <index>`

source: Plugins
es: Complementos
uk: Розширення

source: Plugins system allows to extend Galette with specific features that would not be useful for most of the users. Incompatible plugins will automatically be disabled, in which case you should consider upgrading to a more recent version.
es: El sistema de complementos permite extender Galette con funciones especificas que no serían útiles para la mayoría de los usuarios. Los complementos incompatibles se desactivarán automáticamente, en cuyo caso deberías actualizar a una versión más reciente.
fr_fr: Le système de plugins permet d'étendre Galette avec des fonctionnalités spécifiques qui ne seraient pas utiles à la plupart des utilisateurs... Les plugins incompatibles seront automatiquement désactivés, auquel cas vous devriez envisager a mise à jour vers une version plus récente.
it: Il sistema di plugin consente di estendere Galette con funzionalità specifiche inutili per maggior parte degli utenti. I plugin incompatibili verranno automaticamente disabilitati, nel qual caso è necessario provvedere all'aggiornamento a una versione più recente.
uk: Система розширень дозволяє розширити Galette специфічними функціями, які не були б корисні більшості користувачів. Несумісні розширення будуть автоматично вимкнені, в цьому випадку слід подумати про оновлення до свіжішої версії.

source: Each plugin is a simple directory in ``{galette}/plugins/``, then refer to the plugin documentation to install it.
es: Cada plugin es una simple carpeta en ``{galette}/plugins/``, consulta la documentación de cada complemento para instalarlo.
fr_fr: Chaque plugin est un simple répertoire dans ``{galette}/plugins/``, référez-vous ensuite à la documentation du plugin pour l'installation.
it: Ogni plugin è una semplice cartella in ``{galette}/plugins/``, fare riferimento alla documentazione del plugin per installarlo.
uk: Кожне розширення - це простий каталог ``{galette}/plugins/``, що звертається до документації розширень, щоб встановити їх.

source: You can disable a plugin creating a ``_disabled`` file in its directory.
es: Puedes desactivar un plugin creando un archivo ``_disabled`` en su carpeta.
fr_fr: Vous pouvez désactiver un plugin en créant un fichier ``_disabled`` dans son dossier.
it: È possibile disabilitare un plugin creando il file ``_disabled`` nella sua cartella.
uk: Ви можете вимкнути розширення створенням файлу ``_disabled`` в цьому каталозі.

source: Official Plugins
es: Complementos oficiales
fr_fr: Plugins officiels
it: Plugin ufficiali
uk: Офіційні розширення

source: Official plugins are developed and maintained by the Galette team. Available official plugins are:
es: Los complementos oficiales se desarrollan y mantienen por el equipo de Galette. Los complementos oficiales disponibles son:
fr_fr: Les plugins officiels sont développés et maintenus par l'équipe de Galette. Les plugins officiels disponibles sont :
it: I plugin ufficiali sono sviluppati e mantenuti dal team Galette. I plugin ufficiali disponibili sono:
uk: Офіційні розширення розробляються і підтримуються командою Galette. Доступні офіційні розширення:

source: Third party plugins
es: Complementos de terceros
fr_fr: Plugins tiers
it: Plugin di terze parti
uk: Сторонні розширення

source: Third party plugins are developed and maintained by community members. Some of them may not be translated, or available on only one database engine.
es: Los plugins de terceros son desarrollados y mantenidos por miembros de la comunidad. Algunos de ellos pueden no estar traducidos, o disponibles en un solo motor de base de datos.
fr_fr: Les plugins tiers sont développés et maintenus par des membres de la communauté. Certain peuvent ne pas être traduits, ou disponibles pour votre moteur de base de données.
it: I plugin di terze parti sono sviluppati e mantenuti dai membri della comunità. Alcuni di loro potrebbero non essere tradotti, o disponibili su per un solo motore di database.
uk: Розширення сторонніх виробників розробляються й обслуговуються учасниками спільноти. Деякі з них можуть бути не перекладені або доступні тільки в одному рушії бази даних.

source: `oAuth2 <https://github.com/galette-community/plugin-oauth2>`_ (Galette act as an oAuth2 provider), developped by Manuel,
uk: `oAuth2 <https://github.com/galette-community/plugin-oauth2>`_ (Galette виступає в якості постачальника oAuth2), розроблено Manuel,

source: `Stripe <https://github.com/galette-community/plugin-stripe>`_ (handle `Stripe payments <https://stripe.com/>`_), developped by Mathieu,
uk: `Stripe <https://github.com/galette-community/plugin-stripe>`_ (обробка платежів у Stripe <https://stripe.com/>`_), розроблено Mathieu,

source: `Aéroclub <https://galette-community.github.io/plugin-aeroclub/>`_ (base management of a flying club), developed by Mélissa (**no longer maintained**),
uk: `Aéroclub <https://galette-community.github.io/plugin-aeroclub/>`_ (основне управління аероклубом), розроблено Mélissa (**більше не підтримується**),

source: `QRCodes <https://galette-community.github.io/plugin-qrcodes/>`_ (QRCodes generation), developed by Frédéric (**no longer maintained**),
uk: `QRCodes <https://galette-community.github.io/plugin-qrcodes/>`_ (утворення QR-кодів), розроблено Фредеріком (**більше не підтримується**),

source: `Grades <https://galette-community.github.io/plugin-grades/>`_ (evaluations management), developed by Frédéric (**no longer maintained**).
uk: `Grades <https://galette-community.github.io/plugin-grades/>`_ (керування оцінками), розроблено Фредеріком (**більше не підтримується**).

source: A `Github community <https://github.com/galette-community/>`_ has been created to :doc:`manage third party plugins <plugins-tiers>`, if you want to add your plugin.
es: Se ha creado una `comunidad de Github <https://github.com/galette-community/>`_ para :doc:`gestionar los complementos de terceros <plugins-tiers>`, si quieres añadir tu complemento.
fr_fr: Une `communauté Github <https://github.com/galette-community/>`_ a été créée pour :doc:`gérer les plugins tiers <plugins-tiers>`, si vous souhaitez y ajouter votre plugin.
it: È stata creata una `comunità Github <https://github.com/galette-community/>`_ per :doc:`gestire plugin di terze parti <plugins-tiers>`, se volere potete aggiungere il proprio plugin.
uk: `Спільноту Github <https://github.com/galette-community/>`_ було створено для :doc:`управління сторонніми розширеннями <plugins-tiers>`, якщо ви хочете додати розширення.

source: Plugins management interface
es: Interfaz de gestión de complementos
fr_fr: Interface de gestion des plugins
it: Interfaccia di gestione Plugin
uk: Інтерфейс управління розширеннями

source: A plugins management interface is provided, you will find it from the dashboard or in the configuration menu. After you have downloaded plugin(s) in Galette ``plugins`` directory, a list will be displayed:
es: Se suministra una interfaz de gestión de complementos, la encontrarás en el panel de control o en el menú de configuración. Tras haber descargado el/los complemento(s) en la carpeta ``plugins`` de Galette, se mostrará una lista:
fr_fr: Une interface de gestion des plugins est fournie, vous la trouverez dans le tableau de bord ou le menu configuration. Après avoir téléchargé le(s) plugin(s) dans le dossier ``plugin`` de Galette, une liste sera affichée :
it: Viene fornita un'interfaccia di gestione dei plugin, la troverete dal cruscotto o nel menu di configurazione. Dopo aver scaricato i plugin nella cartella ``plugins`` di Galette, verrà visualizzato un elenco:
uk: Надано інтерфейс управління розширеннями, його можна знайти на дошці даних або в меню конфігурації. Після того, як Ви завантажили розширення в каталозі Galette ``plugins`` буде відображено список:

source: Plugins management
es: Gestión de complementos
fr_fr: Gestion des plugins
it: Gestione dei plugin
uk: Управління розширеннями

source: If web server has read access to your plugins directory, then you can enable or disable any plugin from the related icon.
es: Si el servidor web tiene acceso a tu carpeta de complementos, entonces podrás activar o desactivar cualquier complemento desde el icono relacionado.
fr_fr: Si le serveur web possède le droit en écriture dans le dossier du plugin, vous pourrez activer ou désactiver chaque plugin depuis l'icône en question.
it: Se il server web ha accesso in lettura alla cartella dei plugin, allora è possibile abilitare o disabilitare qualsiasi plugin dall'icona relativa.
uk: Якщо вебсервер має доступ на читання вашого каталогу розширень, ви можете увімкнути або вимкнути будь-яке розширення за допомогою відповідного значка.

source: If plugin requires a database to work, you can play installation and update scripts from the interface.
es: Si el complemento necesita una base de datos para funcionar, puedes ejecutar el código de instalación y actualización desde la interfaz.
fr_fr: Si un plugin requiert une base de données, vous pourrez lancer les scripts d'installation et de mise à jour depuis l'interface.
it: Se il plugin richiede un database per lavorare, è possibile eseguire gli script di installazione e aggiornamento dall'interfaccia.
uk: Якщо для роботи розширення потрібна база даних, ви можете відтворити сценарії встановлення та оновлення з інтерфейсу.

source: `oAuth2 <https://galette-community.github.io/plugin-oauth2/>`_ (Galette act as an oAuth2 provider),
it: `oAuth2 <https://galette-community.github.io/plugin-oauth2/>`_ (Galette come fornitore di oAuth2),

source: `Stripe <https://github.com/galette-community/plugin-stripe>`_ (handle `Stripe payments <https://stripe.com/>`_),
it: `Stripe <https://github.com/galette-community/plugin-stripe>`_ (gestione `pagamenti Stripe <https://stripe.com/>`_),

source: `HelloAsso <https://galette-community.github.io/plugin-helloasso/>`_ (handle `HelloAsso payments <https://www.helloasso.com/>`_),
it: `HelloAsso <https://galette-community.github.io/plugin-helloasso/>`_ (gestione `pagamenti HelloAsso <https://www.helloasso.com/>`_),

source: Database ACLs will then be checked. Unlike Galette, no information will be asked to you, since all is already available from your current instance.
es: Se comprobarán las ACLs de la base de datos. A diferencia de Galette, no te pedirán información alguna, ya que todo está disponible desde tu instancia actual.
fr_fr: Les droits de la base seront vérifiés. À l'inverse de l'installation de Galette, aucune information ne vous sera demandée, puisqu'elles sont déjà présentes depuis l'instance courante.
it: Il database ACL verrà poi controllato. A differenza di Galette, non vi saranno richieste informazioni, poiché tutto è già disponibile dall'istanza corrente.
