Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/plugins/maps.po
Languages: es, it, uk

source: Maps
es: Mapas
it: Mappe

source: This plugin provides:
es: Este complemento proporciona:
it: Questo componente aggiuntivo fornisce:
uk: Це розширення надає:

source: possibility to store geogaphical coordinates for members (latitude and longitude),
es: posibilidad de almacenar las coordenadas geográficas de los miembros (latitud y longitud),
it: possibilità di memorizzare coordinate geografiche per i membri (latitudine e longitudine),
uk: можливість зберігати географічні координати для членів (широта та довгота),

source: a public map displaying up to date members that have choosen to be publically visible.
es: un mapa público que muestra a los miembros actualizados que han elegido ser visibles públicamente.
it: una mappa pubblica aggiornata che mostra i membri che hanno scelto di essere pubblicamente visibili.
uk: прилюдна мапа, на якій показані актуальні члени, яких обрали як прилюдно видимих.

source: Installation
es: Instalación
it: Installazione
uk: Встановлення

source: First of all, download the plugin:
es: Lo primero de todo, descarga el complemento:
it: Prima di tutto, scaricare il plugin:
uk: Перш за все, завантажте розширення:

source: Get latest Maps plugin!
es: ¡Obtenga el último plugin de Mapas!
it: Ottieni l'ultima versione del plugin Maps!
uk: Отримайте останню версію розширення «Maps»!

source: Get Maps plugin nightly build!
es: ¡Consigue la versión oscura del plugin Maps!
it: Ottieni il plugin Maps versione nightly build!
uk: Отримайте нічну збірку плагіна Карт!

source: Extract the downloaded archive in Galette ``plugins`` directory. For example, under linux (replacing `{url}` and `{version}` with correct values):
es: Extrae el archivo descargado en la carpeta ``plugin`` de Galette . Por ejemplo, en linux (sustituyendo `{url}` y `{version}` con los valores correctos):
it: Estrai l'archivio scaricato nella cartella ``plugins`` di Galette. Per esempio, su Linux (sostituendo `{url}` e `{version}` con i rispettivi valori):
uk: Витягніть завантажений архів у каталог Galette ``plugins``. Наприклад, ось вказівки під Linux (замініть `{url}` та `{version}` правильними значеннями):

source: Database initialisation
es: Inicialización de base de datos
it: Inizializzazione del database
uk: Започаткування бази даних

source: In order to work, this plugin requires several tables in the database. See :ref:`Galette plugins management interface <plugins_managment>`.
es: Para que funcione, este complemento necesita varias tablas en la base de datos. Consulta :ref:`la interfaz de gestión de complementos de Galette <plugins_managment>`.
it: Per poter funzionare, questo componente aggiuntivo richiede diverse nuove tabelle nel database. Vedi :ref:`Interfaccia di gestione dei componenti aggiuntivi di Galette <plugins_managment>`.
uk: Для роботи цього розширення потрібно кілька таблиць у базі даних. Див :ref:`Інтерфейс управління розширеннями Galette <plugins_managment>`.

source: And this is finished; Maps plugin is installed :)
es: Y esto está terminado; el plugin de Mapas está instalado :)
it: E questo è finito; il plugin Maps è stato installato :)
uk: Усе завершено. Розширення "Maps" установлено :)

source: Plugin usage
es: Uso del complemento
it: Utilizzo del componente aggiuntivo
uk: Використання розширення

source: When the plugin is installed, a group `Maps` is added to Galette menu when a member is logged in, which contains `My location` entry. This page allow member to store its location.
es: Cuando se instala el plugin, se añade un grupo `Mapas` al menú de Galette cuando un miembro está conectado, que contiene la entrada `Mi ubicación`. Esta página permite a los miembros almacenar su ubicación.
it: A plugin installato, si aggiunge il gruppo `Maps` al menu di Galette ogniqualvolta che un membro si connette, contenente la voce `La mia posizione`. Questa pagina consente all'utente di memorizzare la sua posizione.
uk: Коли розширення встановлено, група `Maps` додається до меню Galette, коли член увійшов у систему, яка містить поле `Моє розташування`. Ця сторінка дозволяє членові зберігати своє місцеперебування.

source: A `Geolocalize` button is also added when displaying a member, that allows administrators to set member coordinates.
es: También se ha añadido un botón de `Geolocalización` al mostrar un miembro, que permite a los administradores establecer las coordenadas del miembro.
it: Viene inoltre aggiunto un pulsante `Geolocalizza` durante la visualizzazione di un membro, che consente agli amministratori di impostare le coordinate dei membri.
uk: Кнопка `Geolocalize` також додається при відображенні члена, що дозволяє адміністраторам встановлювати координати членів.

source: Also, a `Map` entry is added in public pages list, that displays geolocalized members that are up to date. Administrators and staff members will see all members, while simple members and visitors will only see up to date public ones.
es: Además, se ha añadido una entrada `Mapa` en la lista de páginas públicas, que muestra los miembros geolocalizados que están al día. Los administradores y los miembros del personal verán todos los miembros, mientras que los miembros simples y los visitantes sólo verán los miembros públicos actualizados.
it: Inoltre, nell'elenco delle pagine pubbliche viene aggiunta una voce "Mappa" che mostra i membri geolocalizzati aggiornati. Gli amministratori e i membri dello staff vedranno tutti i membri, mentre i membri semplici e i visitatori vedranno solo quelli pubblici aggiornati.
uk: Також до списку прилюдних сторінок додано запис `Мапа`, який відображає геолокалізованих актуальних членів. Адміністратори та співробітники бачитимуть усіх членів, тоді як прості члени та відвідувачі бачитимуть лише оновлених прилюдних.

source: First of all, members will enter their location coordinates. Several options are provided:
es: En primer lugar, los miembros introducirán las coordenadas de su ubicación. Se ofrecen varias opciones:
it: Prima di tutto, i membri entreranno nelle loro coordinate di posizione. Sono disponibili diverse opzioni:
uk: Перш за все, члени вводять координати свого місцеперебування. Надано кілька варіантів:

source: if town has been set in member information, a list of possible places will be proposed (via `Nominatim online service <https://nominatim.openstreetmap.org>`_),
es: si se ha fijado la ciudad en la información de los miembros, se propondrá una lista de posibles lugares (a través del servicio online `Nominatim <https://nominatim.openstreetmap.org>`_),
it: se la città è stata inserita nelle informazioni dei membri, verrà proposto un elenco dei posti possibili (tramite il `servizio online Nominatim <https://nominatim.openstreetmap.org>`_),
uk: Якщо місто було вказано у даних члена, то буде запропонований список можливих місць (через `Онлайн-сервіс Nominatim <https://nominatim.openstreetmap.org>`_),

source: additionnaly, a search zone (provided from `OpenStreetMap <https://nominatim.openstreetmap.org/>`_),
es: además, una zona de búsqueda (proporcionada por `OpenStreetMap <https://nominatim.openstreetmap.org/>`_),
it: inoltre, una zona di ricerca (fornita da `OpenStreetMap <https://nominatim.openstreetmap.org/>`_),
uk: крім того, зона пошуку (надана з `OpenStreetMap <https://nominatim.openstreetmap.org/>`_),

source: and also a geolocalize button using browser capacities.
es: y también un botón de geolocalización mediante las capacidades del navegador.
it: e anche un pulsante geolocalizza utilizzando le capacità del browser.
uk: а також кнопка геолокалізації за допомогою можливостей браузера.

source: The search zone can be used when saving members location, and when displaying the maps.
es: La zona de búsqueda se puede utilizar cuando se guarda la ubicación de los miembros, y cuando se muestran los mapas.
it: La zona di ricerca può essere utilizzata durante il salvataggio della posizione dei membri e durante la visualizzazione delle mappe.
uk: Зона пошуку може бути використана під час збереження місцеперебування членів та під час відображення мап.

source: A member can define its location (with the precision he wants) on the map selecting one of the propositions:
es: Un miembro puede definir su ubicación (con la precisión que desee) en el mapa seleccionando una de las proposiciones:
it: Un membro può definire la sua posizione (con la precisione che vuole) sulla mappa selezionando una delle proposizioni:
uk: Член може визначити своє місце розташування (з бажаною точністю) на мапі, вибравши одну з пропозицій:

source: Using the geolocalization button will define its position from the browser:
es: Utilizando el botón de geolocalización se definirá su posición desde el navegador:
it: Utilizzando il pulsante di geolocalizzazione verrà definita la sua posizione dal browser:
uk: За допомогою кнопки геолокалізації буде визначено його розташування з браузера:

source: Then, member location is displayed on map, and can be removed:
es: A continuación, la ubicación de los miembros se muestra en el mapa, y puede ser eliminada:
it: Poi, la posizione del membro viene visualizzata sulla mappa e può essere rimossa:
uk: Потім місцеперебування члена відображається на мапі та може бути видалено:
