Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/plugins/objectslend.po
Languages: es, uk

source: Objects lend
es: Préstamo de objetos
uk: Об'єкти позичаються

source: This plugin provides:
es: Este complemento proporciona:
uk: Це розширення надає:

source: objects management (description, size, length, price, ...)
es: gestión de objetos (descripción, tamaño, longitud, precio, ...)
uk: управління об'єктами (опис, розмір, довжина, ціна, ...)

source: groups objects by categories,
es: agrupa objetos por categorías,
uk: порядкує об'єкти за категоріями,

source: manage object state, and their presence in stock or not,
es: gestiona el estado del objeto, y su presencia en stock o no,
uk: управління станом об'єкта та їх наявністю чи відсутністю на складі,

source: manage lending and/or renting objects,
es: gestiona el préstamo y/o alquiler de objetos,
uk: управління об’єктами позики та/або оренди,

source: contribution generation,
es: generación de contribución,
uk: утворення внесків,

source: Installation
es: Instalación
uk: Встановлення

source: First of all, download the plugin:
es: Lo primero de todo, descarga el complemento:
uk: Перш за все, завантажте розширення:

source: Get latest ObjectsLend plugin!
es: ¡Obtén la última versión del complemento ObjectsLend!
uk: Отримайте останню версію розширення «ObjectsLend»!

source: Get ObjectsLend plugin nightly build!
es: ¡Obtén la versión Nightly del complemento ObjectsLend!
uk: Отримайте нічну збірку плагіна ObjectsLend!

source: Extract the downloaded archive in Galette ``plugins`` directory. For example, under linux (replacing `{url}` and `{version}` with correct values):
es: Extrae el archivo descargado en la carpeta ``plugin`` de Galette . Por ejemplo, en linux (sustituyendo `{url}` y `{version}` con los valores correctos):
uk: Витягніть завантажений архів у каталог Galette ``plugins``. Наприклад, ось вказівки під Linux (замініть `{url}` та `{version}` правильними значеннями):

source: Database initialisation
es: Inicialización de base de datos
uk: Започаткування бази даних

source: In order to work, this plugin requires several tables in the database. See :ref:`Galette plugins management interface <plugins_managment>`.
es: Para que funcione, este complemento necesita varias tablas en la base de datos. Consulta :ref:`la interfaz de gestión de complementos de Galette <plugins_managment>`.
uk: Для роботи цього розширення потрібно кілька таблиць у базі даних. Див :ref:`Інтерфейс управління розширеннями Galette <plugins_managment>`.

source: And this is finished; ObjectsLend plugin is installed :)
es: Y esto está terminado; se ha instalado el complemento ObjectsLend :)
uk: Усе завершено. Розширення "ObjectsLend" установлено :)

source: Plugin usage
es: Uso del complemento
uk: Використання розширення

source: Once plugin has been installed, a `Object lend` group is added to Galette menu.
es: Una vez que el complemento ha sido instalado, se añadirá un grupo `Préstamo de objeto` al menú de Galette.
uk: Після встановлення розширення до меню Galette буде додано групу `Object lend`.

source: Defaults status are provided at installation, but they can not fit your needs, you can of course define your own.
es: Con la instalación se proporcionan los estados por defecto, pero puede que no encajen con tus necesidades, así que por supuesto puedes definir los tuyos propios.
uk: Типові значення надаються під час встановлення, але вони можуть не відповідати вашим потребам, ви, звичайно ж, можете визначити власні.

source: Define status, create categories and objects; users can lend objects with a reason, then give them back with location.
es: Define estados, crea categorías y objetos; los usuarios pueden prestar objetos con un motivo, y después recuperarlos con una ubicación.
uk: Визначати статус, створювати категорії та об’єкти; користувачі можуть позичати об’єкти з причиною, а потім повертати їх із місцем розташування.

source: A lend history is provided for administrators and staff members from object page.
es: Desde la página del objeto se muestra un historial de préstamos para los administradores y el personal interno.
uk: Історія позичання надається для адміністраторів і співробітників зі сторінки об'єкта.

source: Preferences
es: Ajustes
uk: Параметрів

source: Several preferences allows to change plugin behavior.
es: Varios ajustes permiten cambiar el funcionamiento del complemento.
uk: Декілька параметрів дозволяють змінювати поведінку розширень.

source: From this screen, you can define if members can lend objects or not, if it should create a new contribution (and its type and description), if image should be displayed in objects list, and thumbnails size.
es: Desde esta pantalla, puedes definir si los miembros pueden prestar objetos o no, si se debe crear una nueva contribución (y su tipo y descripción), si se debe mostrar una imagen en el listado de objetos, y el tamaño de la miniatura.
uk: На цьому екрані ви можете визначити, чи можуть учасники позичати об'єкти чи ні, якщо вони повинні створити новий внесок (і його тип і опис), якщо зображення повинно відображатися у списку об'єктів, і розмір мініатюр.

source: It is possible to activate the fullsize photo display.
es: Es posible activar la pantalla de la foto a tamaño completo.
uk: Є можливість задіяти повнорозмірний дисплей світлин.

source: Photos sent with previous plugin version were always resized, only the thumbnail was stored. If you want to get fullsize display, you will have to send photos again.
es: Las fotos enviadas con las versiones anteriores del complemento siempre eran redimensionadas, solo se guardaba la miniatura. Si quieres obtener la pantalla a tamaño completo, tendrás que enviar las fotos otra vez.
uk: Світлини, надіслані з попередньою версією розширення, завжди змінювали розмір, зберігалася тільки мініатюра. Якщо ви хочете отримати повнорозмірний дисплей, вам доведеться надіслати світлини знову.
