Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/plugins/paypal.po
Languages: es, it, ta, uk

source: This plugin provides:
es: Este complemento proporciona:
it: Questo componente aggiuntivo fornisce:
uk: Це розширення надає:

source: possibility to associate an amount to a contribution type,
es: posibilidad de asociar un importe a un tipo de contribución,
it: possibilità di associare un ammontare ad un tipo di contribuzione,
ta: ஒரு தொகையை ஒரு பங்களிப்பு வகையுடன் இணைப்பதற்கான சாத்தியம்,
uk: можливість пов'язати суму з типом внеску,

source: create a Paypal payment form,
es: crear un formulario de pago en Paypal,
it: creare un modulo di pagamento Paypal,
ta: பேபால் கட்டண படிவத்தை உருவாக்கவும்,
uk: створити форму оплати Paypal,

source: an history,
es: un historial,
it: una cronologia,
ta: ஒரு வரலாறு,
uk: історія,

source: automatic transaction storage once validated.
es: almacenamiento automático de las transacciones una vez validadas.
it: salvataggio delle transazioni automatico una volta convalidato.
ta: தானியங்கி பரிவர்த்தனை சேமிப்பு ஒரு முறை சரிபார்க்கப்பட்டது.
uk: автоматичне зберігання переказів після перевірки.

source: Paypal plugin preferences
es: Preferencias del plugin de Paypal
it: Preferenze plugin Paypal
ta: பேபால் சொருகி விருப்பத்தேர்வுகள்
uk: Налаштування розширення «Paypal»

source: Paypal payment form
es: Formulario de pago de Paypal
it: Modulo di pagamento Paypal
ta: பேபால் கட்டண படிவம்
uk: Взір оплати Paypal

source: Paypal payment form (public)
es: Formulario de pago de Paypal (público)
it: Modulo di pagamento Paypal (pubblico)
ta: பேபால் கட்டண படிவம் (பொது)
uk: Платіжна форма Paypal (публічна)

source: Due to the way Paypal payments are handled, especially the payment confirmation, your instance must be publically accessible.
es: Debido a la forma en que se gestionan los pagos de Paypal, especialmente la confirmación del pago, su instancia debe ser de acceso público.
it: Per il modo in cui i pagamenti Paypal sono gestiti, specialmente la conferma di pagamento, la tua istanza deve essere accessibile pubblicamente.
ta: பேபால் கொடுப்பனவுகள் கையாளப்படும் விதம் காரணமாக, குறிப்பாக கட்டண உறுதிப்படுத்தல், உங்கள் நிகழ்வு பகிரங்கமாக அணுகக்கூடியதாக இருக்க வேண்டும்.
uk: Через спосіб обробки платежів Paypal, особливо підтвердження платежу, ваш зразок повинен бути прилюдним.

source: Installation
es: Instalación
it: Installazione
uk: Встановлення

source: First of all, download the plugin:
es: Lo primero de todo, descarga el complemento:
it: Prima di tutto, scaricare il plugin:
uk: Перш за все, завантажте розширення:

source: Get latest Paypal plugin!
es: ¡Obtener el último plugin de Paypal!
it: Ottieni l'ultimo plugin Paypal!
ta: அண்மைக் கால பேபால் சொருகி கிடைக்கும்!
uk: Отримайте останню версію розширення «Paypal»!

source: Get Paypal plugin nightly build!
es: ¡Obten el complemento de Paypal desarrollado en modo oscuro!
it: Ottieni il plugin Paypal nightly build!
ta: பேபால் சொருகி இரவு கட்டமைப்பைப் பெறுங்கள்!
uk: Отримайте плагін Paypal щовечір!

source: Extract the downloaded archive in Galette ``plugins`` directory. For example, under linux (replacing `{url}` and `{version}` with correct values):
es: Extrae el archivo descargado en la carpeta ``plugin`` de Galette . Por ejemplo, en linux (sustituyendo `{url}` y `{version}` con los valores correctos):
it: Estrai l'archivio scaricato nella cartella ``plugins`` di Galette. Per esempio, su Linux (sostituendo `{url}` e `{version}` con i rispettivi valori):
uk: Витягніть завантажений архів у каталог Galette ``plugins``. Наприклад, ось вказівки під Linux (замініть `{url}` та `{version}` правильними значеннями):

source: Database initialisation
es: Inicialización de base de datos
it: Inizializzazione del database
uk: Започаткування бази даних

source: In order to work, this plugin requires several tables in the database. See :ref:`Galette plugins management interface <plugins_managment>`.
es: Para que funcione, este complemento necesita varias tablas en la base de datos. Consulta :ref:`la interfaz de gestión de complementos de Galette <plugins_managment>`.
it: Per poter funzionare, questo componente aggiuntivo richiede diverse nuove tabelle nel database. Vedi :ref:`Interfaccia di gestione dei componenti aggiuntivi di Galette <plugins_managment>`.
uk: Для роботи цього розширення потрібно кілька таблиць у базі даних. Див :ref:`Інтерфейс управління розширеннями Galette <plugins_managment>`.

source: And this is finished; Paypal plugin is installed :)
es: Terminado; el plugin PayPal está instalado :)
it: Completato; il componente aggiuntivo Paypal è installato :)
ta: இது முடிந்தது; பேபால் சொருகி நிறுவப்பட்டுள்ளது :)
uk: Усе завершено. Розширення "PayPal" установлено :)

source: Plugin configuration
es: Ajustes del plugin
it: Configurazione componente aggiuntivo
ta: சொருகி உள்ளமைவு
uk: Конфігурація розширення

source: Once plugin has been installed, a `Paypal` group is added to the menu, with some new entries:
es: Una vez instalado el plugin, se añade un grupo de `Paypal` al menú, con algunas entradas nuevas:
it: Una volta che il componente aggiuntivo è stato installato, verrà aggiunto un gruppo `Paypal` al menu, con alcune nuove voci:
ta: சொருகி நிறுவப்பட்டதும், சில புதிய உள்ளீடுகளுடன் `பேபால்` குழு பட்டியலில் சேர்க்கப்படுகிறது:
uk: Після встановлення розширення до меню додається група `Paypal` з деякими новими записами:

source: `Payment form`: the payment form itself, which is accessible as a public page,
es: `Formulario de pago`: el formulario de pago en sí, al que se puede acceder como página pública,
it: `Forma di pagamento`: la forma di pagamento, accessibile da una pagina pubblica,
ta: `கட்டண படிவம்`: கட்டண படிவமே, இது ஒரு பொது பக்கமாக அணுகக்கூடியது,
uk: `Форма оплати`: сама форма оплати, яка доступна як загальнодоступна сторінка,

source: `Preferences`: plugin preferences, accessible for administrators and staff members.
es: `Preferencias`: ajustes del plugin, accesibles para administradores y miembros del personal.
it: `Preferenze`: le preferenze relative ai componenti aggiuntivi, accessibile agli amministratori e membri dello staff.
ta: `விருப்பத்தேர்வுகள்`: சொருகி விருப்பத்தேர்வுகள், நிர்வாகிகள் மற்றும் ஊழியர்களுக்கு அணுகக்கூடியவை.
uk: `Налаштування`: налаштування розширення, доступні для адміністраторів та співробітників.

source: In order to work properly, you need to fill a very important value: your Paypal account code. You can either use the email address associated with your Paypal account (but you will need to chang it in Galette if it changes on Paypal) or your merchant identifier. To find your merchant identifiant, log in to Paypal and you will find it in your account preferences. Changing identifier is only allowed for administrators.
es: Para funcionar correctamente, es necesario rellenar un valor muy importante: el código de tu cuenta PayPal. Puede utilizar la dirección de correo electrónico asociada a su cuenta de Paypal (pero tendrá que cambiarla en Galette si cambia en Paypal) o su identificador de comerciante. Para encontrar su código de usuario, inicie sesión en PayPal y lo encontrará en las preferencias de su cuenta. Cambiar el identificador solo está permitido para administradores.
it: Per poter funzionare correttamente, devi inserire un dato molto importante: il tuo codice account Paypal. Puoi usare l'indirizzo email associato all'account Paypal (ma dovrai cambiarlo in Galette se lo cambi su Paypal) o il tuo identificatore commerciante. Per trovare il tuo identificatore, accedi a Paypal e lo troverai nelle preferenze dell'account. Solo gli amministratori possono cambiare l'identificatore.
ta: சரியாக வேலை செய்ய, நீங்கள் மிக முக்கியமான மதிப்பை நிரப்ப வேண்டும்: உங்கள் பேபால் கணக்குக் குறியீடு. உங்கள் பேபால் கணக்குடன் தொடர்புடைய மின்னஞ்சல் முகவரியை நீங்கள் பயன்படுத்தலாம் (ஆனால் பேபால் மாற்றினால் அதை கேலட்டில் மாற்ற வேண்டும்) அல்லது உங்கள் வணிகர் அடையாளங்காட்டி. உங்கள் வணிகர் அடையாளம் காண, பேபாலில் உள்நுழைக, அதை உங்கள் கணக்கு விருப்பங்களில் காண்பீர்கள். அடையாளங்காட்டியை மாற்றுவது நிர்வாகிகளுக்கு மட்டுமே அனுமதிக்கப்படுகிறது.
uk: Для правильної роботи вам необхідно заповнити дуже важливе значення: код вашого Paypal-рахунку. Ви можете використовувати або адресу електронної пошти, пов'язаний з вашим обліковим записом Paypal (але ви повинні будете змінити його в Galette, якщо він зміниться на Paypal) або ваш ідентифікатор торговця. Щоб знайти ідентифікатор продавця, увійдіть в систему Paypal, і Ви знайдете його в налаштуваннях вашого облікового запису. Зміна ідентифікатора дозволено тільки адміністраторам.

source: Preferences screen also permit to edit amount related to contributions types, and to hide some types.
es: La pantalla de los ajustes también permite editar el importe relacionado con los tipos de contribuciones, y ocultar algunos tipos.
it: Nelle preferenze è possibile modificare gli ammontare delle contribuzioni, e nasconderne alcuni tipologie.
ta: பங்களிப்பு வகைகள் தொடர்பான தொகையைத் திருத்தவும், சில வகைகளை மறைக்கவும் விருப்பத்தேர்வுகள் திரை அனுமதிக்கிறது.
uk: Екран налаштувань також дозволяє редагувати суму, пов’язану з видами внесків, і приховувати деякі види.

source: After that, any user can choose the contribution type, adjust the amount and pay from his Paypal account. If the user is a logged in member, and if the contribution type is a membership extension, its membership wil be recalculated when the payment will be confirmed.
es: Después de eso, cualquier usuario puede elegir el tipo de contribución, ajustar el monto y pagar desde su cuenta de Paypal. Si el usuario es un miembro registrado y el tipo de contribución es una extensión de la suscripción, su suscripción se recalculará cuando se confirme el pago.
it: Dopodiché, qualsiasi utente potrà scegliere il tipo di contributo, modificare l'ammontare e pagarlo con il suo conto Paypal. Se l'utente è autenticato, e il contributo è relativo alla prosecuzione del periodo associativo, la sua scadenza sarà ricalcolata una volta che il pagamento sarà confermato.
ta: அதன்பிறகு, எந்தவொரு பயனரும் பங்களிப்பு வகையைத் தேர்வுசெய்யலாம், தொகையை சரிசெய்து அவரது பேபால் கணக்கிலிருந்து செலுத்தலாம். பயனர் உறுப்பினராக உள்நுழைந்திருந்தால், மற்றும் பங்களிப்பு வகை உறுப்பினர் நீட்டிப்பாக இருந்தால், கட்டணம் உறுதிப்படுத்தப்படும் போது அதன் உறுப்பினர் மறுபரிசீலனை செய்யப்படும்.
uk: Після цього будь-який користувач може вибрати вид внеску, скорегувати суму і провести оплату зі свого PayPal рахунку. Якщо користувач зареєстрований, і якщо вид внеску є розширенням членства, його членство буде перераховано, коли платіж буде підтверджено.
