Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/plugins/plugins-tiers.po
Languages: ca, es, fr_fr, it, ta, uk

source: Third party plugins community
ca: Comunitat de connectors de tercers
es: Tercera parte de complementos de la comunidad
fr_fr: Communauté des plugins tiers
it: Comunità dei componenti aggiuntivi di terze parti
ta: மூன்றாம் தரப்பு செருகுநிரல்கள் சமூகம்
uk: Спільнота сторонніх розширень

source: A `Github organisation name galette-community <https://github.com/galette-community/>`_ has been created. Its goal is to centralize plugins that are not developed by Galette team, to provide them a source code repository, a ticket management system, a website, ... And possibly get punctual help from Galette team.
ca: Un 'Github organisation name galette-community <https://github.com/galette-community/>'_ ha sigut creat. El seu objectiu és centralitzar els connectors que no són desenvolupats per l'equip Galette, per proporcionar-los un repositori de codi font, un sistema de gestió d'entrades, una web... I possiblement rebre ajuda puntual de l'equip Galette.
es: Se ha creado una organización `Github nombre galette-community <https://github.com/galette-community/>`_. Su objetivo es centralizar los plugins que no son desarrollados por el equipo de Galette, para proporcionarles un repositorio de código fuente, un sistema de gestión de tickets, un sitio web, ... Y posiblemente obtener ayuda puntual del equipo de Galette.
fr_fr: Une `organisation Github nommée galette-community <https://github.com/galette-community/>`_ a été créée. Son but est de centraliser les plugins qui ne sont pas développés par l'équipe de Galette, pour leur fournir un dépôt de code source, un système de tickets, un site web, ... Et potentiellement d'obtenir une aide ponctuelle de l'équipe de Galette.
ta: ஒரு `அறிவிலிமையம் அமைப்புப் பெயர் கேலட்-கம்யூனிட்டி <https://github.com/galette-community/>`_ உருவாக்கப்பட்டது. கேலட் குழுவால் உருவாக்கப்படாத செருகுநிரல்களை மையப்படுத்துவதே இதன் குறிக்கோள், அவர்களுக்கு ஒரு மூலக் குறியீடு களஞ்சியம், டிக்கெட் மேலாண்மை அமைப்பு, ஒரு வலைத்தளம், ... மற்றும் கேலட் குழுவிலிருந்து சரியான உதவியைப் பெறுவது.
uk: `Назву організації Github e galette-спільноти <https://github.com/galette-community/>`_ створено. Її ціль - централізувати розширення, які не розроблені командою Galette, щоб забезпечити їх репозиторіями вихідного коду, системою управління квитками, вебсайтом, ... і, можливо, отримуванням вчасної допомоги від команди "Galette".

source: Prerequisites
ca: Prerequisits
es: Prerrequisitos
fr_fr: Pré-requis
it: Prerequisiti
ta: முன்நிபந்தனைகள்
uk: Вимоги

source: For a plugin to be accepted, it must fit some prerequisites:
ca: Perquè un connector s'accepti, ha de complir alguns prerequisits:
es: Para que sea aceptada un complemento, debe cumplir algunos prerequisitos:
fr_fr: Pour qu'un plugin soit accepté, il doit respecter quelques prérequis :
it: Per poter accettare un componente aggiuntivo, esso deve avere dei prerequisiti:
ta: ஒரு சொருகி ஏற்றுக்கொள்ளப்படுவதற்கு, இது சில முன்நிபந்தனைகளுக்கு பொருந்த வேண்டும்:
uk: Щоб розширення було прийняте, воно повинне відповідати деяким передумовам:

source: be a Galette plugin,
ca: ser un connector de Galette,
es: ser un complemento Galette,
fr_fr: être un plugin Galette,
it: essere un componente aggiuntivo di Galette,
ta: ஒரு கேலட் சொருகி,
uk: бути розширенням Galette,

source: be licensed under a license compatible with Galette (GPLv3 or compatible) and respect it,
ca: ser llicenciat sota una llicència compatible amb Galette (GPLv3 o compatible) i que ho respecti,
es: estar licenciado bajo una licencia compatible con Galette (GPLv3 o compatible) y respetarlo,
fr_fr: être distribué sous licence open source compatible avec Galette (GPLv3 ou compatible) et la respecter,
it: essere rilasciato con licenza compatibile con Galette (GPLv3 o compatibile) e rispettarla,
ta: கேலட் (சி.பி.எல்.வி 3 அல்லது இணக்கமான) உடன் இணக்கமான உரிமத்தின் கீழ் உரிமம் பெறவும், அதை மதிக்கவும்,
uk: ліцензуватись за ліцензією, сумісною з Galette (GPLv3 або сумісною) та поважати її,

source: be compatible with a "decent" Galette version.
ca: ser compatible amb una versió "decent" de Galette.
es: ser compatible con una versión «decente» de Galette.
fr_fr: être compatible avec une version « décente » de Galette.
it: essere compatibile con una versione "decente" di Galette.
ta: "ஒழுக்கமான" கேலட் பதிப்போடு இணக்கமாக இருங்கள்.
uk: бути сумісним із "пристойною" версією Galette.

source: Plugins should (this is a strong recommandation, not an obligation) be localized and respect Galette coding conventions.
ca: Els connectors hi haurien de (això és una gran recomanació, no una obligació) ser localized i respectar Galette coding conventions.
es: Los complementos serían (esto es una recomendación importante, no una obligatoria) localized y respetar Convenciones de código Galette.
fr_fr: Les plugins devraient (c'est une vive recommandation, pas une obligation) être localisés et respecter les conventions de codage de Galette.
ta: செருகுநிரல்கள் (இது ஒரு வலுவான பரிந்துரை, ஒரு கடமை அல்ல) உள்ளூர்மயமாக்கப்பட வேண்டும் மற்றும் கேலட் குறியீட்டு மரபுகளை மதிக்க வேண்டும்.
uk: Розширення повинні (це настійна порада, а не зобов'язання) бути локалізовані і поважати засади годування Galette.

source: Join community
ca: Unir-te a una comunitat
es: Unirse a la comunidad
fr_fr: Rejoindre la communauté
it: Unisciti alla comunità
ta: சமூகத்தில் சேரவும்
uk: Приєднатися до спільноти

source: Github organization system does not allow to request inclusion, you will have to contact Galette team from mailing lists, giving them your Github account name. An invitation will then be send to you.
ca: El sistema d'organització Github no permet sol·licitar una inclusió, hauràs de contactar l'equip Galette de la llista d'enviaments, donant-los el nom del teu compte de Github. Rebràs una invitació.
es: El sistema de organización de Github no permite solicitar la inclusión, tendrás que contactar con el equipo de Galette desde las listas de correo, dándoles tu nombre de cuenta de Github. Entonces se le enviará una invitación.
fr_fr: Le système d'organisations de Github ne permet pas de faire des demandes d'inclusion, vous devrez contacter l'équipe Galette sur une des listes de diffusion, en leur précisant votre identifiant Github. Une invitation vous sera alors envoyée.
it: Il sistema di Github non permette di richiedere inclusioni, quindi dovrai contattare un membro del team di Galette sulle mailing list, dandogli il tuo nome utente Github. Ti sarà inviato un invito.
ta: அறிவிலிமையம் நிறுவன அமைப்பு சேர்க்குமாறு கோர அனுமதிக்காது, நீங்கள் மின்னஞ்சல் பட்டியல்களிலிருந்து கேலட் குழுவைத் தொடர்பு கொள்ள வேண்டும், உங்கள் அறிவிலிமையம் கணக்கு பெயரைக் கொடுக்கும். ஒரு அழைப்பிதழ் உங்களுக்கு அனுப்பப்படும்.
uk: Організаційна система Github не дозволяє запитувати включення, вам доведеться зв’язатися з командою Galette зі списків розсилки, вказавши ім’я вашого облікового запису Github. Потім вам буде надіслано запрошення.

source: Add a plugin
ca: Afegir un connector
es: Añadir un complemento
fr_fr: Ajouter un plugin
it: Aggiungi un componente aggiuntivo
ta: ஒரு சொருகி சேர்க்கவும்
uk: Додати розширення

source: Once the invitation has been accepted, you will get right to create a repository for your plugin.
ca: Un cop la teva invitació sigui acceptada, tindràs el dret per a crear un repositori pel teu connector.
es: Una vez que la invitación ha sido aceptada, obtendrá derechos para crear un repo para su complemento.
fr_fr: Une fois que l'invitation aura été acceptée, vous aurez la possibilité de créer un dépôt pour votre plugin.
it: Una volta che l'invito è stato accettato, avrai la possibilità di creare un archivio per il tuo componente aggiuntivo.
ta: அழைப்பு ஏற்றுக்கொள்ளப்பட்டதும், உங்கள் சொருகி ஒரு களஞ்சியத்தை உருவாக்க உங்களுக்கு உரிமை கிடைக்கும்.
uk: Після того, як запрошення буде прийнято, ви отримаєте право створити репозиторій для вашого розширення.

source: If your plugin does not yet exist, just create it. If it already exist on github, you can transfer ownership to the organization from your existing repository settings.
ca: Si el teu connector encara no existeix, crea'n un. Si ja existeix a Github, pots transferir la propietat a l'organització des de la teva configuració de repositori existent.
es: Si su complemento no existe aún, tan solo créelo. Si ya existe en el github, puede transferir la propiedad a la organización desde sus parámetros del existente repositorio.
fr_fr: Si votre plugin n'existe pas encore, créez le simplement. S'il existe déjà sur Github, vous pouvez transférer la gestion à l'organisation depuis les préférences de votre dépôt actuel.
it: Se il tuo componente aggiuntivo non esiste ancora, crealo. Se invece esiste già, puoi trasferirne il possesso all'organizzazione nelle impostazioni del tuo archivio.
ta: உங்கள் சொருகி இன்னும் இல்லை என்றால், அதை உருவாக்கவும். இது ஏற்கனவே கிதுபில் இருந்தால், உங்கள் தற்போதைய களஞ்சிய அமைப்புகளிலிருந்து நிறுவனத்திற்கு உரிமையை மாற்றலாம்.
uk: Якщо ваше розширення ще не існує, просто створіть його. Якщо воно вже існує на github, ви можете передати право власності на організацію з наявних налаштувань репозиторію.

source: Website
ca: Lloc web
es: Sitio web
fr_fr: Site Web
it: Sito Web
ta: வலைத்தளம்
uk: Вебсайт

source: A website ala Github can be added to your project. Concretely, configuration and contents will be stored in a specific branch of the repository name ``gh-pages`` that will only be used for the website.
ca: Un lloc web ala Github pot ser afegit al teu projecte. Concretament, configuració i continguts seran emmagatzemats en una branca especifica del nom del repositori ''gh-pages'' que només seran utilitzats pel lloc web.
es: Un sitio web a la GitHub puede añadirse a su proyecto. Concretamente, la configuración y los contenidos serán almacenados dentro de una rama específica del nombre del repositorio ``gh_pages`` que solamente serán utilizadas para el sitio web.
fr_fr: Un site web « à la » Github peut être ajouté à votre projet. Concrètement, la configuration et les contenus seront stockés dans une branche spécifique de votre dépôt nommée ``gh-pages`` qui ne sera utilisée que pour le site web.
it: Puoi aggiungere al tuo progetto anche un sito web simil-Github. Operativamente, la configurazione e i contenuti saranno salvati in un ramo specifico dell'archivio, denominato ``gh-pages``che sarà usato solo per il sito web.
ta: உங்கள் திட்டத்தில் ஒரு வலைத்தளம் ஆலா அறிவிலிமையம் சேர்க்கலாம். இணக்கமாக, உள்ளமைவு மற்றும் உள்ளடக்கங்கள் `` சிஎச்-பக்கங்கள்`` களஞ்சிய பெயரின் ஒரு குறிப்பிட்ட கிளையில் சேமிக்கப்படும், அவை வலைத்தளத்திற்கு மட்டுமே பயன்படுத்தப்படும்.
uk: Вебсайт ALA Github може бути доданий до вашого проєкту. Конкретні конфігурація та вміст будуть зберігатися в певній гілці репозиторію ``gh-pages`` що буде використовуватися лише для вебсайту.

source: The goal is to have a certain consistency on all third party plugins website. Galette team may help you for the initial setup of the website; contents and updates are in charge of the author.
ca: L'objectiu és aconseguir una certa unicitat en el lloc web de tots els connectors de tercers. L'equip Galette et pot ajudar per la configuració inicial del lloc web; continguts i actualitzacions estan a càrrec de l'autor.
es: El objetivo es tener una cierta unicidad en todos los complementos de tercera parte en el sitio web. El equipo Galette puede ayudarle a la configuración inicial del sitio web; contenido y actualizaciones en cargo al autor.
fr_fr: Le but est d'avoir une certaine unicité des sites des plugins tiers. L'équipe de Galette peut vous aider pour la mise en place du site web, les contenus et mises à jour seront à la charge de l'auteur.
ta: அனைத்து மூன்றாம் தரப்பு செருகுநிரல்கள் வலைத்தளத்திலும் ஒரு குறிப்பிட்ட நிலைத்தன்மையைக் கொண்டிருப்பதே குறிக்கோள். வலைத்தளத்தின் ஆரம்ப அமைப்பிற்கு கேலட் குழு உங்களுக்கு உதவக்கூடும்; உள்ளடக்கங்கள் மற்றும் புதுப்பிப்புகள் ஆசிரியரின் பொறுப்பில் உள்ளன.
uk: Мета полягає в тому, щоб мати певну єдність на всіх сторонніх сайтах розширень. Команда Galette може допомогти вам в початковому налаштуванні сайту; утримання та відновлення знаходяться у веденні автора.

source: A `Gitub organisation name galette-community <https://github.com/galette-community/>`_ has been created. Its goal is to centralize plugins that are not developed by Galette team, to provide them a source code repository, a ticket management system, a website, ... And possibly get punctual help from Galette team.
it: E' stata creata una `Organizzazione su Github denominata galette-community <https://github.com/galette-community/>`_- Il suo obiettivo è centralizzare i componenti aggiuntivi non sviluppati dal team di Galette, così da fornire loro un archivio del codice sorgente, un sistema di gestione delle notifiche, un sito web, ... E possibilmente anche un po' di aiuto dal team di Galette.

source: Plugins should (this is a strong recommandation, not an obligation) be :ref:`localized <i18n>` and respect :ref:`Galette coding conventions <conventions>`.
it: I componenti aggiuntivi dovrebbero essere :ref:`tradotti <i18n>` (questa è una forte raccomandazione, ma non un obbligo), e rispettare :ref:`le convenzioni di programmazione di Galette <conventions>`.

source: The goal is to have a certain unicity on all third party plugins website. Galette team may help you for the initial setup of the website; contents and updates are in charge of the author.
it: Lo scopo è quello di avere una certa unicità tra i vari componenti aggiuntivi di terze parti. Il team di Galette può aiutarti nella messa a punto iniziale del sito web; tuttavia contenuti e aggiornamenti sono a carico dell'autore.
