Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/command-line.po
Languages: es, it, ta, uk

source: Command line
es: Línea de comandos
it: Riga di comando
ta: கட்டளை வரி
uk: Командний рядок

source: Galette now proposes a command line interface to manage some tasks. This is accessible through the ``bin/console`` script in Galette root directory:
es: Galette ahora propone una interfaz de línea de comandos para administrar algunas tareas. Se puede acceder a ella a través del script ``bin/console`` en el directorio raíz de Galette:
it: Galette propone ora un'interfaccia a riga di comando per gestire alcune attività. È accessibile tramite lo script ``bin/console`` nella cartella principale di Galette:
ta: சில பணிகளை நிர்வகிக்க கலெட் இப்போது ஒரு கட்டளை வரி இடைமுகத்தை முன்மொழிகிறது. கேலட் ரூட் கோப்பகத்தில் `` பின்/கன்சோல்` ச்கிரிப்ட் மூலம் இதை அணுக முடியும்:
uk: Тепер Galette пропонує інтерфейс командного рядка для керування деякими завданнями. Це доступно через сценарій ``bin/console`` у кореневому каталозі Galette:

source: You can obtain help for a specific command by using the ``help`` command:
es: Puedes obtener ayuda para un comando específico utilizando el comando ``help``:
it: È possibile ottenere assistenza per un comando specifico utilizzando il comando ``help``:
ta: `` உதவி`` கட்டளையைப் பயன்படுத்தி ஒரு குறிப்பிட்ட கட்டளைக்கு நீங்கள் உதவியைப் பெறலாம்:
uk: Ви можете отримати довідку для певної команди за допомогою команди ``help``:

source: Check
it: Controllo
ta: சரிபார்
uk: Перевірте

source: This only check for Galette prerequisites, and has no specific arguments.
es: Solo comprueba los requisitos previos de Galette y no tiene argumentos específicos.
it: Questo comando controlla solo i prerequisiti di Galette e non ha argomenti specifici.
ta: இது கேலட் முன்நிபந்தனைகளை மட்டுமே சரிபார்க்கிறது, மேலும் குறிப்பிட்ட வாதங்கள் இல்லை.
uk: Це лише перевірка передумов Galette і не має конкретних аргументів.

source: On some systems, PHP configuration may differ between cli and web; therefore it's recommended to check for requirements from the web script ``galette_compat.php``.
es: En algunos sistemas, la configuración de PHP puede diferir entre la CLI y la web; por lo tanto, se recomienda verificar los requisitos en el script web ``galette_compat.php``.
it: Su alcuni sistemi, la configurazione PHP potrebbe differire tra CLI e Web; pertanto si consiglia di verificare i requisiti nello script Web ``galette_compat.php``.
ta: சில அமைப்புகளில், CLI மற்றும் வலை இடையே பிஎச்பி உள்ளமைவு வேறுபடலாம்; எனவே வலை ச்கிரிப்டிலிருந்து `` callett_compat.php`` இலிருந்து தேவைகளை சரிபார்க்க பரிந்துரைக்கப்படுகிறது.
uk: У деяких системах конфігурація PHP може відрізнятися між cli та web; тому рекомендується перевірити вимоги за допомогою веб-скрипту ``galette_compat.php``.

source: Install
ta: நிறுவவும்
uk: встановити

source: This command obviousely installs Galette :)
es: Este comando obviamente instala Galette :)
it: Questo comando ovviamente installa Galette :)
ta: இந்த கட்டளை வெளிப்படையாக கேலட்டை நிறுவுகிறது :)
uk: Ця команда, очевидно, встановлює Galette :)

source: By default, the script will check for an existing configuration file, you can ignore that using the ``--ignore-config`` option.
es: De forma predeterminada, el script buscará un archivo de configuración existente; puede ignorarlo utilizando la opción ``--ignore-config``.
it: Per impostazione predefinita, lo script verificherà la presenza di un file di configurazione esistente; è possibile ignorarlo utilizzando l'opzione ``--ignore-config``.
ta: இயல்பாக, ச்கிரிப்ட் ஏற்கனவே உள்ள உள்ளமைவு கோப்பை சரிபார்க்கும், `` --ignore-config`` விருப்பத்தைப் பயன்படுத்துவதை நீங்கள் புறக்கணிக்கலாம்.
uk: За замовчуванням сценарій перевірить наявний файл конфігурації, ви можете проігнорувати це за допомогою параметра ``--ignore-config``.

source: Required options that have not been provided on script call will be asked interactively.
es: Las opciones requeridas que no se hayan proporcionado en la llamada de script se preguntarán de forma interactiva.
it: Le opzioni obbligatorie che non sono state fornite durante la chiamata dello script verranno richieste in modo interattivo.
ta: ச்கிரிப்ட் அழைப்பில் வழங்கப்படாத தேவையான விருப்பங்கள் ஊடாடும் வகையில் கேட்கப்படும்.
uk: Необхідні параметри, які не були надані під час виклику сценарію, будуть запитуватися в інтерактивному режимі.

source: Plugins commands
es: Comandos de los plugins
it: Comandi plugin
ta: செருகுநிரல்கள் கட்டளைகள்
uk: Команди плагінів

source: You can list existing plugins using the ``galette:plugins:list`` command:
es: Puede enumerar los plugins existentes utilizando el comando ``galette:plugins:list``:
it: È possibile elencare i plugin esistenti utilizzando il comando ``galette:plugins:list``:
ta: `` கேலட்: செருகுநிரல்கள்: பட்டியல்`` கட்டளை: ஏற்கனவே உள்ள செருகுநிரல்களை பட்டியலிடலாம்:
uk: Ви можете створити список наявних плагінів за допомогою команди ``galette:plugins:list``:

source: Available commands are:
es: Los comandos disponibles son:
it: I comandi disponibili sono:
ta: கிடைக்கக்கூடிய கட்டளைகள்:
uk: Доступні команди:

source: ``galette:plugin:disable``: disable a plugin
es: ``galette:plugin:disable``: desactivar un plugin
it: ``galette:plugin:disable``: disabilita un plugin
ta: `` கேலட்: சொருகி: முடக்கு``: ஒரு சொருகி முடக்கு
uk: ``galette:plugin:disable``: вимкнути плагін

source: ``galette:plugin:enable``: enable a plugin
es: ``galette:plugin:enable``: activar un plugin
it: ``galette:plugin:enable``: abilita un plugin
ta: `` கேலட்: சொருகி: இயக்கு``: ஒரு சொருகி இயக்கவும்
uk: ``galette:plugin:enable``: увімкнути плагін

source: ``galette:plugin:install-db``: install a plugin database
es: ``galette:plugin:install-db``: instala la base de datos de un plugin
it: ``galette:plugin:install-db``: installa un plugin database
ta: `` கேலட்: சொருகி: நிறுவு-டிபி``: ஒரு சொருகி தரவுத்தளத்தை நிறுவவும்
uk: ``galette:plugin:install-db``: встановити базу даних плагінів

source: Plugin database installation will remove any existing plugin tables!
es: ¡La instalación de la base de datos del plugin borrará todas las tablas existentes para este plugin!
it: L'installazione del database dei plugin rimuoverà tutte le tabelle dei plugin esistenti!
ta: சொருகி தரவுத்தள நிறுவல் ஏற்கனவே உள்ள எந்த சொருகி அட்டவணைகளையும் அகற்றும்!
uk: Встановлення бази даних плагінів видалить усі існуючі таблиці плагінів!

source: For every plugin related command, you can precise which plugin(s) you want to act on, use the ``--all`` flag or either rely on interactive mode:
es: Para cada comando relacionado con el complemento, puede especificar sobre qué complemento(s) desea actuar, usar el indicador ``--all`` o confiar en el modo interactivo:
it: Per ogni comando correlato al plugin, che si possa specificare su quale plugin si voglia agire, usare il flag ``--all`` o affidarsi alla modalità interattiva:
ta: சொருகி தொடர்பான ஒவ்வொரு கட்டளைக்கும், நீங்கள் எந்த சொருகி (களை) செயல்பட விரும்புகிறீர்கள் என்பதை துல்லியமாக செய்யலாம், `` --all`` கொடியைப் பயன்படுத்தவும் அல்லது ஊடாடும் பயன்முறையை நம்பவும்:
uk: Для кожної команди, пов’язаної з додатком, ви можете точно вказати, з яким додатком(ами) ви хочете діяти, використати прапорець ``--all`` або покладатися на інтерактивний режим:
