Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/index.po
Languages: es, ta

source: Galette's documentation
es: Documentación de Galette
ta: கேலட்டின் ஆவணங்கள்

source: `Galette <https://galette.eu>`_ is a `Free/Libre Open Source <https://en.wikipedia.org/wiki/Free_and_open-source_software>`__ membership management web application dedicated towards non profit organizations.
es: `Galette <https://galette.eu>`_es una aplicación web de gestión de socios de código abierto `Free/Libre Open Source <https://en.wikipedia.org/wiki/Free_and_open-source_software>`__ dedicada a organizaciones sin fines de lucro.
ta: `கேலட் <https://galette.eu>`_ என்பது ஒரு `இலவச/லிப்ரே திறந்த மூல <https://en.wikipedia.org/wiki/Free_and_open-source_software>`__ உறுப்பினர் மேலாண்மை வலை பயன்பாடு இலாப நோக்கற்ற நிறுவனங்களுக்கு அர்ப்பணிக்கப்பட்டுள்ளது.

source: :doc:`installation manual <installation/index>`
es: :doc:`manual de instalación <instalación/índice>`
ta: :doc:`நிறுவல் கையேடு <installation/index>`

source: :doc:`user manual <usermanual/index>`
es: :doc:`manual de usuario <manual de usuario/índice>`
ta: :doc:`பயனர் கையேடு<usermanual/index>`

source: :doc:`plugins documentation <plugins/index>`
es: :doc:`documentación de complementos <complementos/índice>`
ta: :doc:`செருகுநிரல்கள் ஆவணங்கள் <plugins/index>`

source: About Galette
es: Acerca de Galette
ta: கேலட் பற்றி

source: The Galette project is kindly hosted by `TuxFamily <https://www.tuxfamily.org>`_:
es: El proyecto Galette está amablemente alojado en `TuxFamily <https://www.tuxfamily.org>`_:

source: `Galette website <https://galette.eu/dc/?navlang=en>`_,
es: `Sitio web de Galette <https://galette.eu/dc/?navlang=en>`,

source: :doc:`a GIT repository to manage Galette source code <source_code>`,
es: :doc:`un repositorio GIT para gestionar el código fuente de Galette <código_fuente>`,
ta: :doc:`a GIT களஞ்சியம் பெறுநர் manage Galette மூலம் குறியீடு <source_code>`,

source: mailing lists,
es: Listas de correo
ta: அஞ்சல் பட்டியல்கள்,

source: There are also a few external services:
es: También hay algunos servicios externos:
ta: சில வெளிப்புற சேவைகளும் உள்ளன:

source: `a bug tracker <https://bugs.galette.eu/projects/galette/>`_, to declare issues or to ask for evolutions,
es: `un rastreador de errores <https://bugs.galette.eu/projects/galette/>`_, para declarar problemas o solicitar evoluciones,
ta: `ஒரு பிழை டிராக்கர் <https://bugs.galette.eu/projects/galette/>` _, சிக்கல்களை அறிவிக்க அல்லது பரிணாமங்களைக் கேட்க,

source: `a wonderfull :p documentation <https://doc.galette.eu>`_, you are currently reading,
es: `una maravillosa documentación :p <https://doc.galette.eu>`_, que está leyendo actualmente,
ta: `ஒரு அற்புதமான: பி ஆவணம் <https://doc.galette.eu>` _, நீங்கள் தற்போது படிக்கிறீர்கள்,

source: `a voting system <https://vote.galette.eu>`_, you can vote for features,
es: `un sistema de votación <https://vote.galette.eu>`_, puede votar por las características,
ta: `ஒரு வாக்களிக்கும் முறை <https://vote.galette.eu>` _, நீங்கள் அம்சங்களுக்கு வாக்களிக்கலாம்,

source: `a Github organization <https://github.com/galette>`_, used to run unit tests or documentation on readthedocs, among others,
es: `una organización de Github <https://github.com/galette>`_, utilizada para ejecutar pruebas unitarias o documentación en readthedocs, entre otros,

source: `a continous integration system <https://github.com/galette/galette/actions>`_, that runs a bunch of tests each time a commit is done on the github mirror.
es: `un sistema de integración continua <https://github.com/galette/galette/actions>`_, que ejecuta un montón de pruebas cada vez que se hace un commit en el mirror de github.

source: `a Telemetry application <https://telemetry.galette.eu>`_ which handles and displays Telemetry data received from volunteer Galette instances.
es: `una aplicación de telemetría <https://telemetry.galette.eu>`_ que maneja y muestra los datos de telemetría recibidos de instancias voluntarias de Galette.
ta: `ஒரு டெலிமெட்ரி பயன்பாடு <https://telemetry.galette.eu>` _ இது தன்னார்வ கேலட் நிகழ்வுகளிலிருந்து பெறப்பட்ட டெலிமெட்ரி தரவைக் கையாளுகிறது மற்றும் காண்பிக்கும்.

source: Galette documentation is released under the terms of the `Attribution-ShareAlike 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/>`_ license, written using `reStructuredText <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html>`_ and built with `Sphinx documentation builder <https://www.sphinx-doc.org>`_.
es: La documentación de Galette se publica bajo los términos de la licencia `Attribution-ShareAlike 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/>`_, escrita con `reStructuredText <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html>`_ y construida con `Sphinx documentation builder <https://www.sphinx-doc.org>`_.
ta: `மறுசீரமைப்பு <http: //docutil.sourceforge ஐப் பயன்படுத்தி எழுதப்பட்ட` பண்புக்கூறு-சரேலைக் 3.0 <https://creativecommons.org/licenses/by-sa/3.0/> _ உரிமத்தின் விதிமுறைகளின் கீழ் கலெட் ஆவணங்கள் வெளியிடப்படுகின்றன. net/docs/ref/rst/reguluctedtext.html> `_ மற்றும்` ச்பின்க்ச் ஆவணங்கள் பில்டர் <https://www.sphinx-doc.org> `_ உடன் கட்டப்பட்டுள்ளது.

source: Sphinx allows to build documentation in various formats from the same sources. Galette's documentation is therefore available as HTML, PDF and EPUB formats; thanks to `Read the docs <https://readthedocs.io>`_.
es: Sphinx permite construir la documentación en varios formatos a partir de las mismas fuentes. Por lo tanto, la documentación de Galette está disponible en formatos HTML, PDF y EPUB; gracias a `Read the docs <https://readthedocs.io>`_.
ta: ஒரே மூலங்களிலிருந்து பல்வேறு வடிவங்களில் ஆவணங்களை உருவாக்க சூரரிமாச்சிலை அனுமதிக்கிறது. எனவே கேலட்டின் ஆவணங்கள் HTML, PDF மற்றும் EPUB வடிவங்களாக கிடைக்கின்றன; `டாக்சைப் படித்ததற்கு நன்றி <https://readthedocs.io>` _.

source: `Galette website <https://galette.eu>`_,
ta: `கலெட் வலைத்தளம் <https://galette.eu>` _,
