Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/source_code.po
Languages: it, uk

source: Galette source code
it: Codice sorgente di Galette
uk: Код джерела Galette

source: Galette sources are stored in `Git repositories <https://en.wikipedia.org/wiki/Git>`_ on `Galette GitHub organization <https://github.com/galette/>`_.
it: I sorgenti di Galette sono archiviati in `Repository Git <https://it.wikipedia.org/wiki/Git_(software)>`_ su `Galette GitHub organization <https://github.com/galette/>`_.
uk: Джерела Galette зберігаються в `репозиторіях Git <https://en.wikipedia.org/wiki/Git>`_ в організації `Galette GitHub <https://github.com/galette/>`_.

source: All repositories follow the same development model, therefore you will find two branches in each:
it: Tutti i repository Git seguono lo stesso modello di sviluppo, quindi troverete due rami in ogni repository:
uk: Усі репозиторії дотримуються однієї моделі розробки, тому ви знайдете дві гілки в кожному:

source: ``master``: this is always the latest stable release,
it: ``master``: questa è sempre l'ultima versione stabile,
uk: ``master``: це завжди останній стабільний випуск,

source: ``develop``: the development version, which may be unstable.
it: ``develop``: la versione di sviluppo, che può essere instabile.
uk: ``develop``: версія розробки, яка може бути нестабільною.

source: Project
it: Progetto
uk: Проекти

source: Repository
uk: Репозиторій

source: Galette core
it: Core di Galette
uk: Galette ядро

source: Documentation
it: Documentazione
uk: Документація

source: Auto plugin
it: Plugin Auto
uk: Автоматичний плагін

source: Events plugin
it: Plugin Events
uk: Статус на сервери

source: Fullcard plugin
it: Plugin Fullcard
uk: Fullcard плагін

source: PayPal plugin
it: Plugin PayPal
uk: Плагін PayPal

source: Objects lend plugin
it: Plugin Objects lend
uk: Плагін Objects Lend

source: Activities plugin
it: Plugin attività
uk: Плагін активності

source: Third-party libraries
it: Librerie di terze parti
uk: Сторонні бібліотеки

source: Galette's third-party dependencies are not included in the repository. Instead, PHP dependencies are handled with `Composer dependency manager <https://getcomposer.org>`_ and JavaScript ones with `Node Package Manager (npm) <https://npmjs.com>`_ and `gulp <https://gulpjs.com/>`_.
it: Le dipendenze dalle terze parti di Galette non sono incluse nel repository. Invece, le dipendenze PHP vengono gestite con il `Manager delle dipendenze Composer <https://getcomposer.org>`_ e quelle JavaScript con `Node Package Manager (npm) <https://npmjs.com>`_ e `gulp <https://gulpjs.com/>`_.
uk: Сторонні залежності Galette не включено до репозиторію. Замість цього PHP-залежності обробляються за допомогою `Composer dependency manager <https://getcomposer.org>`_, а JavaScript-залежності - за допомогою `Node Package Manager (npm) <https://npmjs.com>`_ і `gulp <https://gulpjs.com/>`_.

source: In order to install all third party dependencies, just go to the Galette source directory and run:
it: Per installare tutte le dipendenze di terze parti, basta andare nella cartella sorgente di Galette ed eseguire:
uk: Щоб встановити всі сторонні залежності, просто перейдіть до вихідного каталогу Galette та запустіть:
