Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/adherents.po
Languages: es, fr_fr, it, ta, uk

source: Members management
es: Gestión de miembros
fr_fr: Gestion des membres
it: Gestione membri
ta: உறுப்பினர்கள் மேலாண்மை
uk: Управління членами

source: One of the first contact with Galette interface after the installation, login and dashboard will be members list, main part of the system. Of course, this list will be empty for now :)
es: Uno de los primeros contactos con la interfaz de Galette tras la instalación, inicio de sesión y panel de control será la lista de miembros, parte principal del sistema. Por supuesto, la lista estará vacía por ahora :)
fr_fr: L'un des premiers contacts que vous aurez avec l'interface de Galette après l'installation, l'authentification et le tableau de bord sera la liste des adhérents, la partie principale du système. Bien entendu, la liste sera vide pour le moment :)
it: Uno dei primi contatti con l'interfaccia Galette dopo installazione, login e cruscotto sarà la lista dei membri, parte principale del sistema. Naturalmente, per ora, questa lista sarà vuota :)
ta: நிறுவலுக்குப் பிறகு கேலட் இடைமுகத்துடனான முதல் தொடர்புகளில் ஒன்று, உள்நுழைவு மற்றும் டாச்போர்டு உறுப்பினர்கள் பட்டியலாக இருக்கும், இது கணினியின் முக்கிய பகுதியாகும். நிச்சயமாக, இந்த பட்டியல் இப்போது காலியாக இருக்கும் :)
uk: Одним з перших контактів з інтерфейсом Galette після встановлення, входу і дошки даних буде список членів, основна частина системи. Звичайно, поки що цей список буде порожнім :)

source: Let's start by creating a new member. As everywhere in Galette, mandatory fields are displayed with a red border; all other are optional. Different parts of the page (`Identity`, `Contact information`, `Galette related data` and maybe `Dynamic fields`) can be retracted clicking on their respective title.
es: Empezemos creando un nuevo miembro. Como todo en Galette, se muestran los campos obligatorios con un borde rojo; todos los demás son opcionales. Las distintas partes de la página (`Identidad`, `Información de contacto`, `Datos relacionados de Galette` y quizás `Campos dinámicos`) se pueden retraer haciendo clic en sus respectivos títulos.
it: Iniziamo creando un nuovo membro. Come ovunque in Galette, i campi obbligatori sono visualizzati con un bordo rosso; tutti gli altri sono facoltativi. Diverse parti della pagina (`Identità`, `Informazioni di contatto`, `Dati correlati a Galette` e forse `Campi dinamici`) possono essere ritirate facendo clic sul rispettivo titolo.
ta: புதிய உறுப்பினரை உருவாக்குவதன் மூலம் ஆரம்பிக்கலாம். கேலட்டில் எல்லா இடங்களிலும், கட்டாய புலங்கள் சிவப்பு எல்லையுடன் காட்டப்படும்; மற்ற அனைத்தும் விருப்பமானவை. பக்கத்தின் வெவ்வேறு பகுதிகள் (`அடையாளம்`,` தொடர்பு தகவல்`, `கேலட் தொடர்பான தரவு` மற்றும்` மாறும் புலங்கள்`) அந்தந்த தலைப்பில் சொடுக்கு செய்வதைத் திரும்பப் பெறலாம்.
uk: Почнімо зі створення нового користувача. Як і всюди в Galette, обов'язкові поля відображаються з червоною рамкою; всі інші є опціональними. Різні частини сторінки (`Особа`, `Контактні дані`, `Дані, пов'язані з Galette` і, можливо, `Динамічні поля`) можуть бути відсунуті, якщо натиснути на відповідний заголовок.

source: `Identity` screen part adding member
es: Pantalla `Identidad` al añadir un miembro
fr_fr: Écran `identité` à l'ajout d'un adhérent
it: Parte della schermata `Identità` che aggiunge un membro
ta: `அடையாளம்` திரை பகுதி உறுப்பினரைச் சேர்ப்பது
uk: Частина екрана `Особистість` додає учасника

source: `Identity` screen part editing member
es: Pantalla `Identidad` al editar un miembro
fr_fr: Écran `identité` à l'édition d'un adhérent
it: Parte della schermata `Identità` che modifica un membro
ta: `அடையாளம்` திரை பகுதி திருத்துதல் உறுப்பினர்
uk: Частина екрана `Особистість` редагує учасника

source: On date fields, you can access a calendar:
es: En los campos de fecha, puedes acceder a un calendario:
fr_fr: Sur les champs de date, vous pourrez accéder à un calendrier :
it: Nei campi data è possibile accedere a un calendario:
ta: தேதி புலங்களில், நீங்கள் ஒரு காலெண்டரை அணுகலாம்:
uk: У полях дат ви можете отримати доступ до календаря:

source: Date selection
es: Selección de fecha
fr_fr: Sélection de la date
it: Selezione data
ta: தேதி தேர்வு
uk: Вибір дати

source: When storing a member (or any other object in Galette), page will be reloaded with all information you've entered (excepting passwords).
es: Al guardar un miembro (o cualquier otro objeto en Galette), se recargará la página con toda la información que has introducido (excepto las contraseñas).
it: Quando si memorizza un membro (o qualsiasi altro oggetto in Galette), la pagina verrà ricaricata con tutte le informazioni immesse (a eccezione delle password).
ta: ஒரு உறுப்பினரை (அல்லது வேறு எந்த பொருளையும் கேலட்டில்) சேமிக்கும்போது, நீங்கள் உள்ளிட்ட அனைத்து தகவல்களுடனும் (கடவுச்சொற்களைத் தவிர) பக்கம் மீண்டும் ஏற்றப்படும்.
uk: Під час збереження члена (або будь-якого іншого об'єкта в Galette), сторінка буде перезавантажена з усіма відомостями, які ви ввели (за винятком паролів).

source: Members list
es: Lista de miembros
fr_fr: Liste des membres
it: Lista dei membri
ta: உறுப்பினர்கள் பட்டியல்
uk: Список членів

source: Members list allows you to:
es: La lista de miembros te permite:
fr_fr: La liste des adhérents vous permet de :
it: L'elenco dei membri consente di:
ta: உறுப்பினர்கள் பட்டியல் உங்களை அனுமதிக்கிறது:
uk: Список членів дозволяє:

source: filter and order members,
es: filtrar y ordenar miembros,
fr_fr: filtrer et ordonner les adhérents,
it: filtrare e ordinare i membri,
ta: உறுப்பினர்களை வடிகட்டி ஆர்டர் செய்யுங்கள்,
uk: добирати та впорядковувати членів,

source: display members card,
es: mostrar la tarjeta de los miembros,
fr_fr: afficher les fiches membres,
it: mostrare la tessera dei soci,
ta: காட்சி உறுப்பினர்களின் அட்டை,
uk: відображати картку членів,

source: removals,
es: baja,
fr_fr: supprimer,
it: effettuare rimozioni,
ta: நீக்குதல்,
uk: переміщення,

source: send mailings,
es: enviar correos electrónicos,
fr_fr: envoyer des emailings,
it: inviare messaggi di posta,
ta: அஞ்சல்களை அனுப்பவும்,
uk: надсилати розсилання,

source: generate PDF labels,
es: generar etiquetas en PDF,
fr_fr: générer des étiquettes PDF,
it: generare etichette in PDF,
ta: PDF லேபிள்களை உருவாக்குங்கள்,
uk: утворювати мітки PDF,

source: generate PDF attendance sheets,
es: generar hojas de asistencia en PDF,
it: generare fogli di presenza in PDF,
ta: PDF வருகை தாள்களை உருவாக்குங்கள்,
uk: утворювати списки розширення PDF,

source: generate PDF members cards,
es: generar tarjetas de miembros en PDF,
fr_fr: générer des cartes de membres,
it: generare tessere soci in PDF,
ta: PDF உறுப்பினர்களின் அட்டைகளை உருவாக்குங்கள்,
uk: утворювати картки членів PDF,

source: CSV exports,
es: exportaciones CSV,
fr_fr: exporter en CSV,
it: effettuare esportazioni CSV,
ta: சி.எச்.வி ஏற்றுமதி,
uk: експорти CSV,

source: mass changes.
es: cambios masivos.
fr_fr: modifications en masse.
it: cambiamenti multipli.
ta: வெகுசன மாற்றங்கள்.
uk: масові зміни.

source: Each possible action per member is grouped at the end of the line, actions designed to be applied on a selection are at the bottom of the list. Plugins may add entries in both cases.
es: Para cada miembro, cada acción posible se agrupa al final de la línea, las acciones a aplicar en una selección se encuentran en la parte inferior de la lista. Los complementos pueden añadir entradas en ambos casos.
fr_fr: Chaque action possible sur un adhérent sont regroupées en fin de ligne, les actions prévues pour être appliquées sur une sélection se trouvent en bas de la liste. Les plugins peuvent ajouter des entrées dans les deux cas.
it: Ogni possibile azione per membro è raggruppata alla fine della riga, le azioni progettate per essere applicate a una selezione sono in fondo all'elenco. I plugin possono aggiungere voci in entrambi i casi.
ta: ஒரு உறுப்பினருக்கு சாத்தியமான ஒவ்வொரு செயலும் வரியின் முடிவில் தொகுக்கப்பட்டுள்ளது, ஒரு தேர்வில் பயன்படுத்த வடிவமைக்கப்பட்ட நடவடிக்கைகள் பட்டியலின் கீழே உள்ளன. செருகுநிரல்கள் இரண்டு நிகழ்வுகளிலும் உள்ளீடுகளைச் சேர்க்கலாம்.
uk: Всі можливі дії для кожного члена групуються в кінці рядка, дії, призначені для застосування до вибору, знаходяться в нижній частині списку. Модулі можуть додавати записи в обох випадках.

source: Filter and select members
es: Filtra y selecciona miembros
fr_fr: Filtrage et sélection d'adhérents
it: Filtro e selezione membri
ta: உறுப்பினர்களை வடிகட்டி தேர்ந்தெடுக்கவும்
uk: Добірки та виділення членів

source: Filtering members list is documented in :ref:`search section <search_galette>`. All possibilities can be used with actions on selection.
es: Filtrar la lista de miembros se documenta en :ref:`sección de búsqueda <search_galette>`. Se pueden utilizar todas las posibilidades en la selección.
fr_fr: Le filtrage de la liste des adhérents est documenté dans :ref:`la section recherche <search_galette>`. Toutes les possibilités peuvent être utilisées conjointement avec les actions sur la sélection.
it: Il filtro dell'elenco membri è documentato nella :ref:`sezione ricerca <search_galette>`. Tutte le possibilità possono essere utilizzate con azioni sulla selezione.
ta: வடிகட்டுதல் உறுப்பினர்கள் பட்டியல் ஆவணப்படுத்தப்பட்டுள்ளது: குறிப்பு: `தேடல் பிரிவு <தேடல்_கலெட்>`. அனைத்து சாத்தியக்கூறுகளும் தேர்வுக்கான செயல்களுடன் பயன்படுத்தப்படலாம்.
uk: Добірки списків членів документовані у :ref:`розділі пошуку <search_galette>`. Всі можливості можуть бути використані за допомогою дій під час вибору.

source: Mass changes
es: Cambios masivos
fr_fr: Modifications en masse
it: Cambiamenti multipli
ta: வெகுசன மாற்றங்கள்
uk: Масові зміни

source: Members selected in list can be edited (partially) at once.
es: Se pueden editar (parcialmente) los miembros seleccionados en la lista de una vez.
fr_fr: Les adhérents sélectionnés dans la liste peuvent être (partiellement) modifiés en une seule fois.
it: I membri selezionati nell'elenco possono essere modificati (parzialmente) contemporaneamente.
ta: பட்டியலில் தேர்ந்தெடுக்கப்பட்ட உறுப்பினர்களை ஒரே நேரத்தில் (ஓரளவு) திருத்தலாம்.
uk: Членів, вибраних у списку, можна редагувати (частково) одночасно.

source: Mass change selected members
es: Cambio masivo de miembros seleccionados
fr_fr: Modification en masse des adhérents sélectionnés
it: Cambiamenti multipli dei membri selezionati
ta: வெகுசன மாற்றம் தேர்ந்தெடுக்கப்பட்ட உறுப்பினர்கள்
uk: Купна зміна обраних членів

source: Only fields with a checked checkbox at the beginning of the line will be changed. A summary will be displayed.
es: Solo se cambiarán los campos con una casilla marcada al inicio de la línea. Se mostrará un resumen.
fr_fr: Seuls les champs dont la case en début de ligne est cochée seront modifiés. Un résumé sera affiché.
it: Verranno modificati solo i campi con una casella di controllo selezionata all'inizio della riga. Verrà visualizzato un riepilogo.
ta: வரியின் தொடக்கத்தில் சரிபார்க்கப்பட்ட தேர்வுப்பெட்டியைக் கொண்ட புலங்கள் மட்டுமே மாற்றப்படும். ஒரு சுருக்கம் காண்பிக்கப்படும்.
uk: Будуть змінені тільки ті поля, на початку рядка яких встановлено прапорець. З'явиться зведення.

source: Summary of changes
es: Resumen de cambios
fr_fr: Résumé des changements
it: Riepilogo delle modifiche
ta: மாற்றங்களின் சுருக்கம்
uk: Підсумок змін

source: Ordering
es: Ordenar
fr_fr: Tri
it: Ordinamento
ta: வரிசைப்படுத்துதல்
uk: Упорядковування

source: It is possible to order members list on following fields:
es: Se puede ordenar los miembros de la lista por los siguientes campos:
fr_fr: Il est possible de trier les adhérents sur les champs suivants :
it: È possibile ordinare l'elenco dei membri in base ai seguenti campi:
ta: பின்வரும் துறைகளில் உறுப்பினர்கள் பட்டியலை ஆர்டர் செய்ய முடியும்:
uk: Список членів можна впорядкувати за наступними полями:

source: name,
es: nombre,
fr_fr: nom,
it: nome,
ta: பெயர்,
uk: назва,

source: nickname,
es: apodo,
fr_fr: pseudo,
it: soprannome,
ta: புனைப்பெயர்,
uk: позивний,

source: status,
es: estado,
fr_fr: statut,
it: stato,
ta: நிலை,
uk: стан,

source: contribution status,
es: estado de contribución,
fr_fr: statut de contribution,
it: stato contributi,
ta: பங்களிப்பு நிலை,
uk: стан внеску,

source: modification date.
es: fecha de modificación.
fr_fr: date de modification.
it: data di modifica.
ta: மாற்றும் தேதி.
uk: дата зміни.

source: Most of the times, the result is transparent. Just note ordering on `status` will use status priority and ordering on `contribution status` will use creation date, contribution exemption and due date;
es: La mayoría de las veces, el resultado es cristalino. Solo ten en cuenta que ordenar por `estado` utilizará la prioridad de estado y ordenar por `estado de contribución` utilizará la fecha de creación, exención de contribución y fecha de vencimiento;
fr_fr: La plupart du temps, les résultats sont transparents. Notez simplement que le tri sur le `statut` utilisera la priorité du statut et le tri sur le `statut de contribution` utilisera la date de création, l'exemption de contribution et la date d'échéance ;
it: Nella maggior parte dei casi, il risultato è trasparente. Si noti che l'ordinamento su `stato` utilizzerà la priorità di stato e l'ordinamento su `stato contributi` utilizzerà la data di creazione, l'esenzione dal contributo e la data di scadenza;
ta: பெரும்பாலான நேரங்களில், இதன் விளைவாக வெளிப்படையானது. குறிப்பு `நிலை 'இல் வரிசைப்படுத்துதல் நிலை முன்னுரிமையைப் பயன்படுத்தும் மற்றும்` பங்களிப்பு நிலை' இல் வரிசைப்படுத்துவது உருவாக்கும் தேதி, பங்களிப்பு விலக்கு மற்றும் உரிய தேதியைப் பயன்படுத்தும்;
uk: У більшості випадків результат виходить прозорим. Просто запримітьте, що під час упорядкування за `станом` буде використовуватися пріоритет стану, а під час упорядкування за `станом внеску` буде використовуватися дата створення, звільнення від внеску і дата виконання;

source: Configure CSV fields
es: Configurar campos de CSV
fr_fr: Configuration des champs CSV
it: Configura campi CSV
ta: காபிம புலங்களை உள்ளமைக்கவும்
uk: Налаштування полів CSV

source: Per default, CSV export for a members selection will provide same fields as the ones that are displayed on screen. It is possible to change this behavior specifiying yourself which fields must be exported in the ``galette/config/local_export_fields.inc.php`` file. If for example you only want identifier, first and last member names, the content of the file will be:
es: Por defecto, la exportación CSV de una selección de miembros proporcionará los mismos campos que los que se muestran por pantalla. Es posible cambiar este comportamiento especificando por ti mismo que campos se deben exportar en el archivo ``galette/config/local_export_fields.inc.php``. Si, por ejemplo, solo quieres el identificador, el nombre y apellido de los miembros, el contenido del archivo será:
fr_fr: Par défaut, les exports CSV des adhérents fourniront les champs qui sont affichés à l'écran. Il est possible de modifier ce comportement en spécifiant vous même quels champs doivent être exportés dans le fichier ``galette/config/local_export_fields.inc.php``. Si par exemple vous souhaitez juste l'identifiant, nom et prénom de l'adhérent, le contenu sera :
it: Per impostazione predefinita, l'esportazione CSV per una selezione di membri fornirà gli stessi campi di quelli visualizzati sullo schermo. È possibile modificare questo comportamento specificando autonomamente quali campi devono essere esportati nel file ``galette/config/local_export_fields.inc.php``. Se ad esempio si desidera solo l'identificatore, il nome e il cognome del membro, il contenuto del file sarà:
ta: இயல்புநிலைக்கு, உறுப்பினர்களின் தேர்வுக்கான காபிம ஏற்றுமதி திரையில் காட்டப்படும் அதே புலங்களை வழங்கும். `` கேலட்/கட்டமைப்பு/லோக்கல்_எக்ச்போர்ட்_ஃபீல்ட்ச்.இ.என்.இ.என்.இ.என்.சி.எச்.பி`` கோப்பில் எந்த புலங்கள் ஏற்றுமதி செய்யப்பட வேண்டும் என்பதை நீங்களே குறிப்பிட்ட இந்த நடத்தையை மாற்ற முடியும். எடுத்துக்காட்டாக நீங்கள் அடையாளங்காட்டி, முதல் மற்றும் கடைசி உறுப்பினர் பெயர்களை மட்டுமே விரும்பினால், கோப்பின் உள்ளடக்கம்:
uk: Типово експорт CSV для вибору членів надаватиме ті ж поля, які відображаються на екрані. Цю поведінку можна змінити, вказавши самостійно, які поля повинні бути експортовані в файлі ``galette / config / local_export_fields.inc.php``. Якщо, наприклад, вам потрібні тільки ідентифікатор, ім'я та прізвище користувача, вміст файлу буде таким:

source: E-Mailing
es: Correspondencia electrónica
it: Invio email
ta: மின்னஞ்சல்
uk: Е-поштове розсилання

source: **Mailings in Galette are designed to work from the members list.**
es: La correspondencia en Galette está diseñada para funcionar desde la lista de miembros.**
fr_fr: **Les mailings dans Galette sont prévus pour fonctionner depuis la liste des adhérents.**
it: **L'invio di posta in Galette è progettato per funzionare a partire dall'elenco dei membri.**
ta: ** கேலட்டில் உள்ள அஞ்சல்கள் உறுப்பினர்கள் பட்டியலிலிருந்து வேலை செய்ய வடிவமைக்கப்பட்டுள்ளன. **
uk: **Розсилання в Galette призначені для роботи зі списку членів.**

source: Direct mailing creation will work without problems, but members selection is harder.
es: La creación directa de correspondencia funcionará sin problemas, pero la selección de miembros es más difícil.
fr_fr: La création directe de mailings fonctionnera, mais la sélection des adhérents sera moins pratique.
it: La creazione di una spedizione di posta diretta funzionerà senza problemi, ma la selezione dei membri sarà più difficile.
ta: நேரடி அஞ்சல் உருவாக்கம் சிக்கல்கள் இல்லாமல் செயல்படும், ஆனால் உறுப்பினர்களின் தேர்வு கடினமானது.
uk: Створення прямого розсилання працюватиме без ускладнень, але вибір членів складніший.

source: From Galette, you can send mailings to a selection of members. Each sent mailing is stored in order to be reused, so you can select a stored mailing to be used as a template, retrieving selected members list, mailing subject and contents.
es: Desde Galette, puedes enviar correos electrónicos a una selección de miembros. Cada correo enviado se almacena para ser reutilizado, así que puedes seleccionar un correo guardado para utilizarlo como plantilla, recuperar la lista de miembros, el asunto y el contenido.
fr_fr: Depuis Galette, vous pouvez envoyer des courriels à une sélection d'adhérents. Chaque envoi sera enregistré pour être réutilisé, vous pouvez donc utiliser un envoi déjà envoyé comme modèle, récupérant la liste des adhérents, le sujet ainsi que le contenu.
it: Da Galette, si può inviare posta a una selezione di membri. Ogni messaggio inviato viene archiviato per essere riutilizzato, quindi si può selezionare una spedizione archiviata da utilizzare come modello, recuperando l'elenco dei membri selezionati, l'oggetto dei messaggi e il loro contenuto.
ta: கலெட்டிலிருந்து, நீங்கள் உறுப்பினர்களின் தேர்வுக்கு அஞ்சல்களை அனுப்பலாம். அனுப்பப்பட்ட ஒவ்வொரு அஞ்சலும் மீண்டும் பயன்படுத்தப்படுவதற்காக சேமிக்கப்படுகிறது, எனவே நீங்கள் ஒரு வார்ப்புருவாக பயன்படுத்த சேமிக்கப்பட்ட அஞ்சலைத் தேர்ந்தெடுக்கலாம், தேர்ந்தெடுக்கப்பட்ட உறுப்பினர்களின் பட்டியல், அஞ்சல் பொருள் மற்றும் உள்ளடக்கங்களை மீட்டெடுக்கிறது.
uk: З Galette ви можете надсилати розсилання обраним членам. Кожне надіслане розсилання зберігається для повторного використання, тому ви можете вибрати збережене розсилання для використання в якості шаблону, витягуючи обраний список членів, тему розсилання і зміст.

source: To send a new mailing, select members from the list and then use the `Send an email` button at the bottom of the list. If some of selected members does not have an email address, Galette will propose you to print corresponding labels.
es: Para enviar un nuevo correo, selecciona los miembros desde la lista y utiliza el botón `Enviar un correo electrónico` en la parte inferior de la lista. Si alguno de los miembros no tiene una dirección de correo electrónico, Galette te propondrá imprimir las etiquetas correspondientes.
fr_fr: Pour envoyer un nouvel emailing, sélectionnez les adhérents dans la liste et utilisez le bouton `Envoyer un mailing` en bas de la liste. Si certains adhérents ne possèdent pas d'adresse de courriel, Galette vous proposera d'imprimer les étiquettes correspondantes.
it: Per inviare nuova posta, selezionare i membri dall'elenco e poi usa il pulsante `Invia un'email` in fondo all'elenco. Se alcuni dei membri selezionati non hanno un indirizzo email, Galette proporrà di stampare le etichette corrispondenti.
ta: ஒரு புதிய அஞ்சலை அனுப்ப, பட்டியலிலிருந்து உறுப்பினர்களைத் தேர்ந்தெடுத்து, பட்டியலின் கீழே `ஒரு மின்னஞ்சல் அனுப்பவும்` பொத்தானைப் பயன்படுத்தவும். தேர்ந்தெடுக்கப்பட்ட சில உறுப்பினர்களுக்கு மின்னஞ்சல் முகவரி இல்லையென்றால், தொடர்புடைய லேபிள்களை அச்சிட கேலட் உங்களை முன்மொழியும்.
uk: Щоб надіслати нове розсилання, виберіть членів зі списку, а потім скористайтеся кнопкою `Надіслати лист` в нижній частині списку. Якщо у когось з вибраних членів немає адреси е-пошти, Galette запропонує вам показати відповідні мітки.

source: Selected members for mailing
es: Seleccionar miembros para correspondencia
fr_fr: Adhérents sélectionnés pour le publipostage
it: Membri selezionati per l'invio postale
ta: அஞ்சல் அனுப்பப்பட்ட உறுப்பினர்கள்
uk: Вибрані учасники для розсилки

source: Selecting members in the list must be done on one page only. Filtering features, as well as the possibility to display all members will be useful ;)
es: Seleccionar miembros de la lista se debe hacer solo en una página. Serán útiles la función para filtrar así como la posibilidad de mostrar todos los miembros ;)
fr_fr: La sélection des adhérents de la liste doit être effectuée sur une seule page uniquement. Les fonctionnalités de recherche ainsi que la possibilité d'afficher tous les membres seront utiles ;)
it: La selezione dei membri nell'elenco deve essere fatta su una sola pagina. Le funzionalità di filtro, così come la possibilità di visualizzare tutti i membri torneranno utili ;)
ta: பட்டியலில் உறுப்பினர்களைத் தேர்ந்தெடுப்பது ஒரு பக்கத்தில் மட்டுமே செய்யப்பட வேண்டும். அம்சங்களை வடிகட்டுதல், அத்துடன் அனைத்து உறுப்பினர்களையும் காண்பிப்பதற்கான சாத்தியமும் பயனுள்ளதாக இருக்கும்;)
uk: Вибір членів в списку повинен здійснюватися тільки на одній сторінці. Корисними будуть функції добірки, а також можливість відображення всіх членів ;)

source: You can choose a sender for each mailing:
es: Puedes elegir un emisor por cada correo:
fr_fr: Vous pouvez choisir un expéditeur pour chaque emailing :
it: Si può scegliere un mittente per ogni invio:
ta: ஒவ்வொரு அஞ்சலுக்கும் அனுப்புநரை நீங்கள் தேர்வு செய்யலாம்:
uk: Ви можете вибрати відправника для кожного розсилання:

source: **from Galette preferences** (default value): this will use information stored in preferences,
es: **desde los ajustes de Galette** (valor predeterminado): esto utilizará la información almacenada en los ajustes,
it: **dalle preferenze di Galette** (valore predefinito): verranno utilizzate le informazioni memorizzate nelle preferenze,
ta: ** கேலட் விருப்பங்களிலிருந்து ** (இயல்புநிலை மதிப்பு): இது விருப்பங்களில் சேமிக்கப்பட்ட தகவல்களைப் பயன்படுத்தும்,
uk: **з налаштувань Galette** (типове значення): тут будуть використані відомості, що зберігаються в налаштуваннях,

source: **current logged-in user**: will use the name and the email of the current logged-in user (not available for super admin),
es: **usuario conectado actualmente**: utilizará el nombre y el correo electrónico del usuario conectado actualmente (no disponible para el superadministrador),
fr_fr: **utilisateur courant** : utilisera le nom et l'adresse de courriel de l'utilisateur actuellement connecté (non disponible pour le super administrateur),
it: **utente attualmente connesso**: utilizzerà il nome e l'email dell'utente attualmente connesso (non disponibile per il super amministratore),
ta: ** தற்போதைய உள்நுழைந்த பயனர் **: தற்போதைய உள்நுழைந்த பயனரின் பெயர் மற்றும் மின்னஞ்சலைப் பயன்படுத்தும் (சூப்பர் நிர்வாகிக்கு கிடைக்கவில்லை),
uk: **поточний зареєстрований користувач**: використовуватиме ім'я та е-пошту поточного зареєстрованого користувача (недоступно для суперадміністратора),
