Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/adherents.po
Languages: es, fr_fr, it, ta, uk

source: **other**: you can set any name and email address you want.
es: **otros**: puedes establecer cualquier nombre y dirección de correo electrónico que quieras.
fr_fr: **autre** : vous pouvez indiquer les nom et adresse de courriel que vous souhaitez.
it: **altro**: si può impostare qualsiasi nome e indirizzo email desiderato.
ta: ** பிற **: நீங்கள் விரும்பும் எந்த பெயரையும் மின்னஞ்சல் முகவரியையும் அமைக்கலாம்.
uk: **інше**: ви можете встановити будь-яке ім’я та е-пошту, які хочете.

source: Sender selection
es: Selección del emisor
fr_fr: Sélection de l'expéditeur
it: Selezione del mittente
ta: அனுப்புநர் தேர்வு
uk: Вибір відправника

source: Once the subject has been filled, you can work on the contents. You can send email in text only, or in HTML (keep in mind sending HTML messages by mail is often not the way to go). A simple HTML WYSIWYG editor is provided.
es: Una vez que se ha rellenado el asunto, puedes trabajar en el contenido. Puedes enviar correos electrónicos en texto plano, o en HTML (recuerda que enviar mensajes HTML por correo no suele ser lo habitual). Se proporciona un sencillo editor HTML WYSIWYG.
fr_fr: Une fois le sujet renseigné, vous pouvez travailler sur le contenu. Vous pouvez envoyer des courriels en texte seul, ou en HTML (gardez à l'esprit que l'envoi de courriels HTML n'est souvent pas la bonne manière de procéder). Un éditeur WYSIWYG est fourni.
it: Una volta compilato l'oggetto, si può lavorare sui contenuti. Si può inviare email solo in testo o in HTML (tenere presente che inviare messaggi HTML via email spesso non è la soluzione migliore). Viene fornito un semplice editor HTML WYSIWYG.
ta: பொருள் நிரப்பப்பட்டதும், நீங்கள் உள்ளடக்கங்களில் வேலை செய்யலாம். நீங்கள் உரையில் மட்டும் அல்லது உஉகுமொ இல் மின்னஞ்சலை அனுப்பலாம் (HTML செய்திகளை அஞ்சல் மூலம் அனுப்புவதை நினைவில் கொள்ளுங்கள் பெரும்பாலும் செல்ல வழி அல்ல). ஒரு எளிய உஉகுமொ WYSIWYG எடிட்டர் வழங்கப்படுகிறது.
uk: Після того як тема заповнена, можна працювати над змістом. Ви можете відправити лист тільки в текстовому вигляді або в HTML (майте на увазі, що відправляти HTML-повідомлення поштою часто небажано). Для цього передбачений простий редактор HTML WYSIWYG.

source: Once the HTML editor is enabled, the checkbox to handle HTML tags is automatically checked, remember to check the box if you do not use the editor but want to send HTML!
es: Una vez que se ha activado el editor HTML, la casilla para gestionar las etiquetas HTML se marcará automáticamente, ¡recuerda marcar la casilla si no utilizas el editor pero quieres enviar HTML!
fr_fr: Une fois l'éditeur HTML activé, la case pour gérer le HTML est automatiquement cochée., pensez à cocher cette case si vous n'utilisez pas l'éditeur mais que vous souhaitez utiliser du HTML !
it: Una volta abilitato l'editor HTML, la casella di controllo per gestire i tag HTML viene selezionata automaticamente. Ricordarsi di selezionare la casella se non si usa l'editor ma si desidera inviare codice HTML!
ta: உஉகுமொ எடிட்டர் இயக்கப்பட்டதும், உஉகுமொ குறிச்சொற்களைக் கையாள்வதற்கான தேர்வுப்பெட்டி தானாகவே சரிபார்க்கப்படும், நீங்கள் எடிட்டரைப் பயன்படுத்தாவிட்டால், ஆனால் உஉகுமொ ஐ அனுப்ப விரும்பினால் பெட்டியை சரிபார்க்க நினைவில் கொள்ளுங்கள்!
uk: Після увімкнення HTML-редактора автоматично встановлюється прапорець для обробки HTML-міток, не забудьте встановити його, якщо ви не використовуєте редактор, але хочете надіслати HTML!

source: Even if Galette is able to send HTML emails, this is discouraged. Messages length will be way larger (for almost nothing), and some (like me!) read their emails as text only. That is why Galette will **always** provide a text version of HTML emails.
es: Incluso si Galette es capaz de enviar correos electrónicos en HTML, no se recomienda hacerlo. La longitud de los mensajes será muy extensa (por casi nada), y algunos (¡como yo!) leen sus correos electrónicos en texto plano. Es por esto que Galette **siempre** proporciona una versión en texto plano de los correos electrónicos HTML.
it: Anche se Galette è in grado di inviare email HTML, ciò è sconsigliato. La lunghezza dei messaggi sarà molto maggiore (per quasi nessun vantaggio) e alcuni (come me!) leggeranno le loro email solo come testo. Ecco perché Galette fornirà **sempre** una versione di testo delle email HTML.
ta: கேலட் உஉகுமொ மின்னஞ்சல்களை அனுப்ப முடிந்தாலும், இது ஊக்கமளிக்கிறது. செய்திகளின் நீளம் பெரியதாக இருக்கும் (கிட்டத்தட்ட எதுவுமில்லை), சில (என்னைப் போன்றவை!) அவற்றின் மின்னஞ்சல்களை உரையாக மட்டுமே படிக்கின்றன. அதனால்தான் கேலட் ** எப்போதும் ** உஉகுமொ மின்னஞ்சல்களின் உரை பதிப்பை வழங்கும்.
uk: Навіть якщо Galette може надсилати електронні листи в форматі HTML, робити це не пораджено. Довжина повідомлень буде набагато більшою (практично ні для чого), а деякі (наприклад, я!) Читають свої листи тільки як текст. Тому Galette **завжди** надаватиме текстову версію HTML листів.

source: It is also possible to add attachements, just click on the `Browse` button in that attachements section. If your browser is compatible, you can add several files at once (using `Shift` and `Ctrl` keys). All attachements are stored on disk, under a directory named with the mailing identifier (automatically defined from database).
es: También es posible añadir adjuntos, haz clic en el botón `Examinar` en la sección de adjuntos. Si tu navegador es compatible, puedes añadir varios archivos de una vez (utilizando las teclas `Shift` y `Ctrl`). Todos los adjuntos se guardan en el disco, en una carpeta llamada con el identificador del correo (definido automáticamente desde la base de datos).
fr_fr: Il est également possible d'ajouter des pièces jointes, cliquez juste sur le bouton `Parcourir` dans la section pièces jointes. Si votre navigateur le permet, vous pouvez ajouter plusieurs fichiers en une seule fois (en utilisant les touches `Shift` et `Ctrl`). Toutes les pièces jointes sont enregistrées sur le disque, dans un dossier nommé avec l'identifiant du mailing (déterminé automatiquement par la base de données).
it: È anche possibile aggiungere allegati, basta fare clic sul pulsante `Sfoglia` nella sezione degli allegati. Se il proprio browser è compatibile, si può aggiungere più file contemporaneamente (usando i tasti `Maiusc` e `Ctrl`). Tutti gli allegati vengono salvati su disco, in una cartella denominata con l'identificativo di posta (definito automaticamente dal database).
ta: இணைப்புகளைச் சேர்க்கவும் முடியும், அந்த இணைப்பு பிரிவில் உள்ள `உலாவுதல்` பொத்தானைக் சொடுக்கு செய்க. உங்கள் உலாவி இணக்கமாக இருந்தால், நீங்கள் ஒரே நேரத்தில் பல கோப்புகளைச் சேர்க்கலாம் (`சிப்ட்` மற்றும்` ctrl` விசைகளைப் பயன்படுத்தி). அனைத்து இணைப்புகளும் அஞ்சல் அடையாளங்காட்டியுடன் பெயரிடப்பட்ட ஒரு கோப்பகத்தின் கீழ் வட்டில் சேமிக்கப்படுகின்றன (தரவுத்தளத்திலிருந்து தானாக வரையறுக்கப்படுகிறது).
uk: Також можна додавати долученняу, просто натисніть на кнопку `Переглянути` в розділі долучень. Якщо ваш браузер сумісний, ви можете додавати кілька файлів одночасно (використовуючи клавіші `Shift` і `Ctrl`). Усі долучення зберігаються на диску, в каталозі з назвою ідентифікатора розсилання (автоматично визначається з бази даних).

source: `Preview` button let you preview your message before sending it.
es: El botón `Vista previa` te permite previsualizar tu mensaje antes de enviarlo.
fr_fr: Le bouton `Prévisualiser` vous permet de vérifier le message avant de l'envoyer.
it: Il pulsante `Anteprima` consente di visualizzare in anteprima il messaggio prima di inviarlo.
ta: `முன்னோட்டம்` பொத்தான் உங்கள் செய்தியை அனுப்புவதற்கு முன் அதை முன்னோட்டமிட அனுமதிக்கிறது.
uk: Кнопка `Попередній перегляд` дозволяє попередньо переглянути повідомлення перед надсиланням.

source: Preview message
es: Vista previa de mensaje
fr_fr: Prévisualiser le message
it: Anteprima messaggio
ta: முன்னோட்ட செய்தி
uk: Доперегляд повідомлення

source: Any started emailings will be stored in your session to be retrieved in the future. An icon will be displayed in pages titles when a mailing is progress and will provide a link to go to it.
es: Cualquier correo electrónico iniciado se almacenará en tu sesión y se podrá recuperar en el futuro. Se mostrará un icono en el título de las páginas cuando haya un correo en curso y tendrás un enlace para acceder a él.
fr_fr: Tout emailing commencé est stocké en session pour être retrouvé par la suite. Une icône sera affichée dans les titres des pages dès qu'un emailing est en cours et fourni un lien pour y accéder.
it: Ogni invio di posta avviato verrà archiviato nella propria sessione per poter essere recuperato in futuro. Un'icona verrà visualizzata nei titoli delle pagine quando un invio è in corso e fornirà un collegamento per accedervi.
ta: எதிர்காலத்தில் மீட்டெடுக்க உங்கள் அமர்வில் எந்த தொடங்கிய மின்னஞ்சல்களும் சேமிக்கப்படும். ஒரு அஞ்சல் முன்னேறும்போது பக்கங்களின் தலைப்புகளில் ஒரு படவுரு காண்பிக்கப்படும், மேலும் அதற்குச் செல்ல ஒரு இணைப்பை வழங்கும்.
uk: Усі розпочаті розсилки буде збережено у вашій сесії, щоб їх можна було отримати в майбутньому. У заголовках сторінок буде відображатися піктограма, коли йде процес розсилання, і посилання для переходу до нього.

source: If you want, you can cancel this mailing using the `Cancel mailing` button, it will be deleted from your session. If you want to store it for a longer time, you can add the `Save` button. It will then be stored in the mailings list, and you will be able to grab it later.
es: Si quieres, puedes descartar este correo utilizando el botón `Descartar correo`, se eliminará de tu sesión. Si quieres almacenarlo durante más tiempo, puedes añadir el botón `Guardar`. Se guardará en tu lista de correos, y podrás recuperarlo más adelante.
fr_fr: Si vous souhaitez annuler un emailing, utilisez le bouton `Annuler le mailing`, il sera supprimé de votre session. Si vous souhaitez l'enregistrer pour plus tard, utilisez le bouton `Enregistrer`. Il sera alors enregistré dans la liste des mailings et vous pourrez le récupérer plus tard.
it: Se lo si desidera, si può annullare questo invio postale usando il pulsante `Annulla invio postale`; questo verrà eliminato dalla sessione. Se invece si vuole conservarlo per un periodo più lungo, si può aggiungere il pulsante `Salva`. Verrà quindi conservato nell'elenco degli invii e da dove si potrà recuperare in seguito.
ta: நீங்கள் விரும்பினால், `ரத்துசெய் அஞ்சல்` பொத்தானைப் பயன்படுத்தி இந்த அஞ்சலை ரத்து செய்யலாம், இது உங்கள் அமர்விலிருந்து நீக்கப்படும். நீங்கள் அதை நீண்ட நேரம் சேமிக்க விரும்பினால், நீங்கள் `சேமி` பொத்தானைச் சேர்க்கலாம். பின்னர் அது அஞ்சல் பட்டியலில் சேமிக்கப்படும், பின்னர் நீங்கள் அதைப் பிடிக்க முடியும்.
uk: Якщо ви хочете, ви можете скасувати це розсилання за допомогою кнопки `Скасувати розсилання`, вона буде видалена з вашої сесії. Якщо ви хочете зберегти її на більш тривалий час, ви можете додати кнопку `Зберегти`. Тоді вона буде збережена в списку розсилань, і ви зможете отримати її пізніше.

source: Mailings history
es: Historial de correos
fr_fr: Historique des emailings
it: Cronologia invii postali
ta: அஞ்சல் வரலாறு
uk: Історія розсилань

source: When you start a mailing, it is stored into your session. Session ends when users log out, or on a server defined timeout. Mailing history stores the mailing in the database, this ensure it will always be available in the future.
es: Cuando inicies un correo, se almacenará en tu sesión. La sesión finaliza cuando un usuario cierra su sesión, o con un tiempo agotado definido en el servidor. El historial de correos almacena los correos en la base de datos, esto asegura que siempre estarán disponibles en el futuro.
fr_fr: Lorsque vous commencez un mailing, il est enregistré dans votre session. La session se termine lorsque l'utilisateur se déconnecte, ou en fonction du paramétrage du serveur. L'historique des mailings stocke en base de données, ce qui vous assure que ce sera toujours disponible par la suite.
it: Quando si avvia un invio postale, questo viene memorizzato nella sessione. La sessione termina quando gli utenti si disconnettono o in base alla scadenza di un tempo definito dal server. La cronologia degli invii memorizza l'invio nel database, assicurandone per sempre la futura reperibilità.
ta: நீங்கள் ஒரு அஞ்சலைத் தொடங்கும்போது, அது உங்கள் அமர்வில் சேமிக்கப்படுகிறது. பயனர்கள் வெளியேறும்போது அமர்வு முடிகிறது, அல்லது சேவையக வரையறுக்கப்பட்ட காலக்கெடுவில். அஞ்சல் வரலாறு தரவுத்தளத்தில் அஞ்சலை சேமிக்கிறது, இது எதிர்காலத்தில் எப்போதும் கிடைக்கும் என்பதை இது உறுதி செய்கிறது.
uk: Коли ви починаєте розсилання, воно зберігається у вашій сесії. Сесія закінчується, коли користувачі виходять із системи або за певним тайм-аутом серверу. Історія розсилань зберігає розсилання в базі даних, що гарантує її постійну доступність у майбутньому.

source: Every sent mailing is stored into the database, and can be used as a template to write a new one. In this case, a new mailing will be created using information from the history, and the original one will be kept as is.
es: Cada correo enviado se almacena en la base de datos, y se puede utilizar como plantilla para escribir uno nuevo. En este caso, se creará un nuevo correo utilizando la información del historial, y el original se mantendrá como está.
it: Ogni invio postale inoltrato viene memorizzato nel database e può essere utilizzato come modello per scriverne uno nuovo. In questo caso, verrà creato un nuovo invio utilizzando le informazioni della cronologia e l'originale verrà mantenuto così com'è.
ta: அனுப்பப்பட்ட ஒவ்வொரு அஞ்சலும் தரவுத்தளத்தில் சேமிக்கப்படுகிறது, மேலும் புதிய ஒன்றை எழுத ஒரு வார்ப்புருவாக பயன்படுத்தலாம். இந்த விசயத்தில், வரலாற்றிலிருந்து தகவல்களைப் பயன்படுத்தி ஒரு புதிய அஞ்சல் உருவாக்கப்படும், மேலும் அசல் ஒன்று வைக்கப்படும்.
uk: Кожне надіслане розсилання зберігається в базі даних і може бути використане в якості шаблону для написання нового. У цьому випадку новий лист буде створено з використанням відомостей з історії, а первину листа буде збережено як є.

source: Mailings can be stored before they are sent. In this case, it is possible to continue it later. When you use history on a draft mailing, original entry will be replaced on sending.
es: Los correos se almacenan antes de ser enviados. En este caso, es posible continuar más tarde. Cuando utilizas el historial en un borrador, la entrada original será reemplazado cuando se envíe.
fr_fr: Les emailings peuvent être enregistrés en base avant leur envoi. Dans ce cas, il est possible de les reprendre par la suite. Lorsque vous utilisez l'historique avec un emailing brouillon, l'entrée originale sera remplacée lors de l'envoi.
it: Gli invii possono essere archiviati prima di essere inviati. In questo caso, è possibile continuare in seguito. Quando si utilizza la cronologia su una bozza di spedizione, la voce originale verrà sostituita all'invio.
ta: அஞ்சல்கள் அனுப்பப்படுவதற்கு முன்பு சேமிக்க முடியும். இந்த வழக்கில், பின்னர் அதைத் தொடர முடியும். வரைவு அஞ்சலில் நீங்கள் வரலாற்றைப் பயன்படுத்தும்போது, அனுப்பும் போது அசல் நுழைவு மாற்றப்படும்.
uk: Розсилання можна зберігати до їх надсилання. У цьому випадку їх можна продовжити пізніше. Під час використанні історія на чернетці розсилання вихідний запис буде замінена під час надсилання.

source: When you use an existing history entry, here are the information that will be used:
es: Cuando utilices una entrada existente en el historial, esta es la información que se utilizará:
it: Quando si usa una voce della cronologia, ecco le informazioni che verranno utilizzate:
ta: நீங்கள் ஏற்கனவே உள்ள வரலாற்று உள்ளீட்டைப் பயன்படுத்தும்போது, பயன்படுத்தப்படும் தகவல்கள் இங்கே:
uk: Коли ви використовуєте наявний запис історії, ось відомості, які будуть використовуватися:

source: recipients,
es: destinatarios,
fr_fr: destinataires,
it: destinatari,
ta: பெறுநர்கள்,
uk: одержувачі,

source: attachements,
es: adjuntos,
fr_fr: pièces jointes,
it: allegati,
ta: இணைப்புகள்,
uk: долучення,

source: subject,
es: sujeto,
fr_fr: sujet,
it: oggetto,
ta: பொருள்,
uk: тема,

source: message,
es: mensaje,
it: messaggio,
ta: செய்தி,
uk: повідомлення,

source: html/text flag.
es: indicador html/text.
fr_fr: drapeau html/texte.
it: flag html/testo.
ta: HTML/உரை கொடி.
uk: прапорець html/тексту.

source: CSV imports
es: Importaciones CSV
fr_fr: Imports CSV
it: Importazioni CSV
ta: சி.எச்.வி இறக்குமதி
uk: Імпорти CSV

source: It is possible to import member data from a predefined model. A default model is provided, but you can configure it to suits your needs, using the `Imports` menu entry.
es: Es posible importar los datos de un miembro de un modelo predefinido. Se proporciona un modelo predeterminado, pero puedes configurarlo para que se ajuste a tus necesidades, utilizando la entrada del menú `Importaciones`.
fr_fr: Il est possible d'importer des adhérents à partir d'un modèle prédéfini. Un modèle par défaut est fourni, mais vous pouvez l'adapter à vos besoins, en utilisant l'entrée de menu `Imports`.
it: È possibile importare i dati dei membri da un modello predefinito. Viene fornito un modello predefinito, ma è possibile configurarlo in base alle proprie esigenze, utilizzando la voce di menu `Importazioni`.
ta: முன் வரையறுக்கப்பட்ட மாதிரியிலிருந்து உறுப்பினர் தரவை இறக்குமதி செய்ய முடியும். இயல்புநிலை மாதிரி வழங்கப்படுகிறது, ஆனால் `இறக்குமதி` பட்டியல் உள்ளீட்டைப் பயன்படுத்தி உங்கள் தேவைகளுக்கு ஏற்றவாறு அதை உள்ளமைக்கலாம்.
uk: Можна імпортувати дані про членів з визначеною моделлю. Типова модель надається, але ви можете налаштувати її відповідно до своїх потреб, використовуючи пункт меню `Імпорт`.

source: Model
es: Modelo
fr_fr: Modèle
it: Modello
uk: Модель

source: Import model defines fields and their order in a CSV file. When importing, current model will be used to check your CSV file integrity.
es: El modelo de importación define los campos y su orden en un archivo CSV. Al importar, el modelo actual será utilizado para comprobar la integridad de tu archivo CSV.
it: Il modello di importazione definisce i campi e il loro ordine in un file CSV. Durante l'importazione, il modello corrente verrà utilizzato per verificare l'integrità del file CSV.
ta: இறக்குமதி மாதிரி ஒரு காபிம கோப்பில் புலங்களையும் அவற்றின் வரிசையையும் வரையறுக்கிறது. இறக்குமதி செய்யும் போது, உங்கள் காபிம கோப்பு ஒருமைப்பாட்டை சரிபார்க்க தற்போதைய மாதிரி பயன்படுத்தப்படும்.
uk: Модель імпорту визначає поля і їх порядок в CSV-файлі. Під час імпорту поточна модель буде використовуватися для перевірки сумісності вашого CSV-файлу.

source: To configure the model, click on the `Configure` button from the UI.
es: Para configurar el modelo, haz clic en el botón `Configurar` desde la interfaz de usuario.
fr_fr: Pour configurer le modèle, cliquez sur le bouton `Configurer` depuis l'interface.
it: Per configurare il modello, fare clic sul pulsante `Configura` dall'interfaccia utente.
ta: மாதிரியை உள்ளமைக்க, இடைமுகம் இலிருந்து `உள்ளமைவு` பொத்தானைக் சொடுக்கு செய்க.
uk: Щоб налаштувати модель, натисніть кнопку `Налаштувати` в інтерфейсі користувача.

source: Default import model
es: Modelo de importación predeterminado
fr_fr: Modèle d'import par défaut
it: Modello di importazione predefinito
ta: இயல்புநிலை இறக்குமதி மாதிரி
uk: Звична модель імпорту

source: If proposed model is not ok for you, click on `Edit model` and choose your fields:
es: Si el modelo proporcionado no te parece bien, haz clic en `Editar modelo` y elige tus campos:
fr_fr: Si le modèle proposé ne vous convient pas, cliquez sur `Modifier le modèle` et choisissez vos champs :
it: Se il modello proposto non ci soddisfa, fare clic su `Modifica modello` e scegliere i propri campi:
ta: முன்மொழியப்பட்ட மாதிரி உங்களுக்கு சரியில்லை என்றால், `திருத்து மாடலை` என்பதைக் சொடுக்கு செய்து உங்கள் புலங்களைத் தேர்வுசெய்க:
uk: Якщо запропонована модель вам не підходить, натисніть `Змінити модель` та оберіть поля:

source: Import model configuration
es: Configuración del modelo de importación
fr_fr: Configuration du modèle d'import
it: Importa configurazione modello
ta: மாதிரி உள்ளமைவை இறக்குமதி செய்யுங்கள்
uk: Налаштування моделі імпорту

source: Once you have selected your fields, click on the `Store new model` button.
es: Una vez hayas seleccionado tus campos, haz clic en el botón `Guardar nuevo modelo`.
fr_fr: Une fois vos champs sélectionnés, cliquez sur le bouton `Enregistrer un nouveau modèle`.
it: Dopo aver selezionato i campi, fare clic sul pulsante `Memorizza nuovo modello`.
ta: உங்கள் புலங்களைத் தேர்ந்தெடுத்ததும், `புதிய மாடல்` பொத்தானைக் சொடுக்கு செய்க.
uk: Вибравши поля, натисніть кнопку `Зберегти нову модель`.

source: When in the current model tab, you can download an empty model from the `Generate an empty CSV file` button. Of course, you can change model if you want, or remove it to get the default model back.
es: En la pestaña de modelo, puedes descargar un modelo vacío desde el botón `Generar un archivo CSV vacío`. Por supuesto, puedes cambiar el modelo si quieres, o borrarlo par recuperar el modelo predeterminado.
fr_fr: Depuis l'onglet modèle courant, vous pouvez télécharger un modèle vide avec le bouton `Générer un fichier CSV vide`. Bien sûr, vous pouvez changer le modèle si vous le souhaitez, ou le supprimer pour retourner au modèle par défaut.
it: Nella scheda del modello corrente, si può scaricare un modello vuoto usando il pulsante `Genera un file CSV vuoto`. Ovviamente, si può cambiare modello se lo si desidera, o rimuoverlo per ottenere di nuovo il modello predefinito.
ta: தற்போதைய மாதிரி தாவலில் இருக்கும்போது, `வெற்று சி.எச்.வி கோப்பு` பொத்தானை உருவாக்குதல் ஆகியவற்றிலிருந்து வெற்று மாதிரியை பதிவிறக்கம் செய்யலாம். நிச்சயமாக, நீங்கள் விரும்பினால் மாதிரியை மாற்றலாம் அல்லது இயல்புநிலை மாதிரியை திரும்பப் பெற அதை அகற்றலாம்.
uk: Перебуваючи на вкладці поточної моделі, ви можете завантажити порожню модель за допомогою кнопки `Утворити порожній файл CSV`. Звичайно, ви можете змінити модель, якщо хочете, або видалити її, щоб повернути типову модель.

source: Import
es: Importación
it: Importa
ta: இறக்குமதி
uk: Імпорт

source: Once you have retrieved and fill the empty file, you have to send it using the form `Send a new file`. At this step, Galette will check your file extension is ``csv`` (or ``txt``) and it size does not exceed maximum upload file size (2Mio per default in PHP).
es: Una vez hayas recuperado y rellenado el archivo vacío, tienes que enviarlo utilizando el formulario `Enviar un archivo nuevo`. En este paso, Galette comprobará que la extensión del archivo sea ``csv`` (o ``txt``) y que el tamaño no exceda el tamaño máximo de subida (2Mio en PHP por defecto).
fr_fr: Une fois le fichier vide récupéré et rempli, vous devez l'envoyer en utilisant le formulaire `Envoyer un nouveau fichier`. Durant cette étape, Galette vérifiera que l'extension de votre fichier est ``csv`` (ou ``txt``) et que sa taille n'excède pas la taille maximale d'envoi autorisée (2Mio par défaut côté PHP).
ta: நீங்கள் மீட்டெடுத்ததும், வெற்று கோப்பை நிரப்பியதும், `புதிய கோப்பை 'அனுப்பவும் படிவத்தைப் பயன்படுத்தி அதை அனுப்ப வேண்டும். இந்த கட்டத்தில், உங்கள் கோப்பு நீட்டிப்பு `` csv`` (அல்லது `` txt``) என்பதை கலெட் சரிபார்க்கும், மேலும் அதன் அளவு அதிகபட்ச பதிவேற்ற கோப்பு அளவை விட அதிகமாக இருக்காது (PHP இல் இயல்புநிலைக்கு 2mio).
uk: Після того, як ви отримали та заповнили порожній файл, ви повинні надіслати його, використовуючи форму ``додати новий файл``. На цьому кроці Galette перевірить, що розширення вашого файлу ``csv`` (або ``txt``) і його розмір не перевищує щонайбільший розмір файлу (типово 2 Мб у PHP).
