Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/adherents.po
Languages: es, fr_fr, it, ta, uk

source: If you want to import a huge file, you can put it from your FTP client in the ``galette/data/imports`` directory, or split it into several smaller files you can import one by one.
es: Si quieres importar un archivo gigante, puedes subirlo con tu cliente FTP en la carpeta ``galette/data/imports``, o dividirlo en varios archivos más pequeños que puedas importar uno a uno.
fr_fr: Si vous souhaitez importer un fichier volumineux, vous pouvez l'envoyer avec votre client FTP dans le dossier ``galette/data/imports``, ou le scinder en fichiers plus petits que vous pourrez importer un par un.
ta: நீங்கள் ஒரு பெரிய கோப்பை இறக்குமதி செய்ய விரும்பினால், அதை உங்கள் FTP கிளையண்டிலிருந்து `` கேலட்/தரவு/இறக்குமதி`` கோப்பகத்தில் வைக்கலாம் அல்லது நீங்கள் ஒவ்வொன்றாக இறக்குமதி செய்யக்கூடிய பல சிறிய கோப்புகளாக பிரிக்கலாம்.
uk: Якщо ви хочете імпортувати величезний файл, ви можете помістити його з вашого FTP-клієнта в каталог ``galette/data/imports`` або розбити його на кілька невеликих файлів, які можна імпортувати по одному.

source: Sent files are listed in the `Existing files` section. You can show, remove or import it:
es: Los archivos enviados se enumeran en la sección `Archivos existentes`. Puedes mostrarlos, borrarlos o importarlos:
fr_fr: Les fichiers envoyés sont listés dans la section `Fichiers existants`. Vous pouvez les consulter, les supprimer ou les importer :
ta: அனுப்பப்பட்ட கோப்புகள் `இருக்கும் கோப்புகள்` பிரிவில் பட்டியலிடப்பட்டுள்ளன. நீங்கள் அதைக் காட்டலாம், அகற்றலாம் அல்லது இறக்குமதி செய்யலாம்:
uk: Надіслані файли перелічені в розділі `Наявні файли`. Ви можете відобразити, видалити або імпортувати їх:

source: Select and import file
es: Selecciona e importa el archivo
fr_fr: Sélectionner et importer un fichier
ta: கோப்பைத் தேர்ந்தெடுத்து இறக்குமதி செய்யுங்கள்
uk: Вибрати файл імпорту

source: The `dry run` checkbox (checked per default) is designed to test your file data are valid (mandatory fields filled, data formatting is correct, ...) without storing anything in the database.
es: La casilla de `simulacro` (marcada por defecto) está diseñada para probar que los datos de tu archivo son válidos (los campos obligatorios rellenos, el formato de datos es correcto, ...) sin guardar nada en la base de datos.
fr_fr: La case `galop d'essai` (cochée par défaut) est prévue pour tester que les données de votre fichier sont valides (présence des champs requis, formatage correct des données, ...) sans enregistrer quoi que ce soit dans votre base de données.
ta: தரவுத்தளத்தில் எதையும் சேமிக்காமல் `உலர் ரன்` தேர்வுப்பெட்டி (இயல்புநிலைக்கு சரிபார்க்கப்பட்டது) உங்கள் கோப்பு தரவு செல்லுபடியாகும் (கட்டாய புலங்கள் நிரப்பப்பட்டவை, தரவு வடிவமைப்பு சரியானது, ...) வடிவமைக்கப்பட்டுள்ளது.
uk: Прапорець `спробний прогін` (типово встановлений) призначений для перевірки правдивості даних вашого файлу (заповнені обов'язкові поля, форматування даних правильне тощо) без збереження чого-небудь в базі даних.

source: When you import a CSV file, if one line is incorrect, previous ones may be stored in the database already; so it is advised to use the dry-run before to get error fixed.
es: Al importar un archivo CSV, si una línea es incorrecta, las anteriores ya se han guardado en la base de datos; por lo que se recomienda utilizar el simulacro antes para corregir los errores.
fr_fr: Lorsque vous importez un fichier CSV, si une ligne est incorrecte, les précédentes pourraient être enregistrées en base déjà ; il est fortement conseillé d'utiliser le galop d'essai auparavant pour corriger les erreurs.
ta: நீங்கள் ஒரு காபிம கோப்பை இறக்குமதி செய்யும் போது, ஒரு வரி தவறாக இருந்தால், முந்தையவை ஏற்கனவே தரவுத்தளத்தில் சேமிக்கப்படலாம்; எனவே பிழையை சரிசெய்ய முன் உலர்ந்த ரனைப் பயன்படுத்த அறிவுறுத்தப்படுகிறது.
uk: Під час імпорту CSV-файлу, якщо один рядок недійсний, попередні можуть бути вже збережені в базі даних; тому пораджено використовувати спробний прогін, щоб виправити помилку.

source: You will have error messages than something went wrong (in dry-run mode or not):
es: Habrá mensajes de error si algo sale mal (en modo simulacro o no):
fr_fr: Des messages d'erreurs seront affichés si quelque chose tourne mal (en galop d'essai ou pas) :
ta: ஏதேனும் தவறு நடந்ததை விட உங்களிடம் பிழை செய்திகள் இருக்கும் (உலர்-ரன் பயன்முறையில் அல்லது இல்லை):
uk: Ви отримаєте повідомлення про помилки, якщо щось пішло не так (в режимі спробного прогону чи не в ньому):

source: You may see mandatory missing fields even if import is ok. This may happen when all the fields you set as required in Galette configuration are not listed in your import model.
es: Puede que veas que falten campos obligatorios incluso si la importación es correcta. Esto puede ocurrir cuando todos los campos que estableciste como obligatorios en la configuración de Galette no se enumeran en tu modelo de importación.
fr_fr: Vous pourrez voir des champs requis manquants même si l'import est ok. Cela peut arriver si tous les champs marqués comme requis dans Galette ne sont pas listés dans votre modèle d'import.
ta: இறக்குமதி சரியாக இருந்தாலும் கட்டாயக் காணாமல் போன புலங்களை நீங்கள் காணலாம். உங்கள் இறக்குமதி மாதிரியில் கேலட் உள்ளமைவில் தேவைக்கேற்ப அமைக்கும் அனைத்து புலங்களும் பட்டியலிடப்படாதபோது இது நிகழலாம்.
uk: Ви можете побачити відсутні обов'язкові поля, навіть якщо імпорт пройшов нормально. Це може статися, якщо всі поля, які ви встановили як обов'язкові в конфігурації Galette, не перераховано у вашій моделі імпорту.

source: Links between members
es: Enlaces entre miembros
ta: உறுப்பினர்களிடையே இணைப்புகள்
uk: Посилання між членами

source: You can link several members to a "parent" one. This may be used to store families for exemple, or members of a same company. You can access children members from the parent, and parent from the children.
es: Puedes enlazar varios miembros a uno superior. Esto puede utilizarse, por ejemplo, para almacenar familias, o miembros de la misma empresa. Puedes acceder a los miembros secundarios desde el superior, y al superior desde los secundarios.
ta: நீங்கள் பல உறுப்பினர்களை "பெற்றோர்" உடன் இணைக்கலாம். எக்செம்பிள் அல்லது அதே நிறுவனத்தின் உறுப்பினர்களுக்காக குடும்பங்களை சேமிக்க இது பயன்படுத்தப்படலாம். நீங்கள் பெற்றோரிடமிருந்து குழந்தைகள் உறுப்பினர்களையும், குழந்தைகளின் பெற்றோரையும் அணுகலாம்.
uk: Ви можете зв'язати кілька членів з одним "батьківським". Це може використовуватися, наприклад, для зберігання сімей або членів однієї компанії. Ви можете отримати доступ до дочірніх членів від батьківського, а до батьківських - від дочірнього.

source: You can add as many child as you want for a member, but a child cannot become a parent.
es: Puedes añadir tantos miembros secundarios como quieras para un miembro, pero un secundario no puede llegar a ser un superior.
fr_fr: Vous pouvez ajouter autant d'enfants que vous le souhaitez pour un adhérent, mais un enfant ne peut devnir parent lui même.
ta: நீங்கள் ஒரு உறுப்பினரை விரும்பும் அளவுக்கு குழந்தைகளைச் சேர்க்கலாம், ஆனால் ஒரு குழந்தை பெற்றோராக மாற முடியாது.
uk: Ви можете додати скільки завгодно дочірніх для члена, але дочірній не може стати батьком.

source: The other interesting point of this system is you can retrieve some information from the parent when sending mailings or labels. In the children members, email and postal addresses automatically become optional, whatever the configuration says. If any of those information is missing, it will be retrieved from the parent.
es: El otro punto interesante de este sistema es que puedes recuperar cierta información desde el superior al enviar correspondencia o etiquetas. En los miembros secundarios, las direcciones de correo electrónico y postal se convierten en opcionales automáticamente, cualquiera que sea la configuración. Si falta cualquiera de esos datos, se recuperarán desde el superior.
ta: இந்த அமைப்பின் மற்ற சுவையான புள்ளி என்னவென்றால், அஞ்சல்கள் அல்லது லேபிள்களை அனுப்பும்போது பெற்றோரிடமிருந்து சில தகவல்களை மீட்டெடுக்கலாம். குழந்தைகள் உறுப்பினர்களில், உள்ளமைவு என்ன சொன்னாலும் மின்னஞ்சல் மற்றும் அஞ்சல் முகவரிகள் தானாகவே விருப்பமாக மாறும். அந்த தகவல்கள் ஏதேனும் காணவில்லை என்றால், அது பெற்றோரிடமிருந்து மீட்டெடுக்கப்படும்.
uk: Інший цікавий момент цієї системи полягає в тому, що ви можете отримати деякі дані від батьківського під час надсилання розсилань або міток. У дочірніх членах, адреси е-пошти та поштові адреси автоматично стають опціональними, незалежно від того, що зазначено в конфігурації. Якщо які-небудь відомості відсутні, вони будуть отримані від батька.

source: Members without email adresses cannot use the "retrieve password" feature. This does not affect the uniqueness email constraint in the database.
es: Los miembros sin dirección de correo electrónico no pueden utilizar la función "recuperar contraseña". Esto no afecta a la restricción de correo electrónico único en la base de datos.
ta: மின்னஞ்சல் அல்லாத உறுப்பினர்கள் "கடவுச்சொல்லை மீட்டெடு" அம்சத்தைப் பயன்படுத்த முடியாது. இது தரவுத்தளத்தில் உள்ள தனித்துவமான மின்னஞ்சல் கட்டுப்பாட்டை பாதிக்காது.
uk: Члени без адреси е-пошти не можуть скористатися функцією "відновити пароль". Це не впливає на обмеження єдності е-пошти в базі даних.

source: Impersonating
es: Suplantación de identidad
ta: ஆள்மாறாட்டம்
uk: Видавання себе за іншого

source: Some issues may be related to a particular account, because of its ACLs, groups, ... In this case, it is unfortunately frequent to see some credentials sent by insecure emails; which should really be avoid.
es: Algunos problemas pueden estar relacionados a una cuenta en particular, debido a sus ACLs, grupos, ...En este caso, es lamentablemente frecuente ver credenciales enviadas por correos electrónicos no seguros; lo cual se debería evitar.
ta: சில சிக்கல்கள் ஒரு குறிப்பிட்ட கணக்குடன் தொடர்புடையதாக இருக்கலாம், ஏனெனில் அதன் ACL கள், குழுக்கள், ... இந்த விசயத்தில், துரதிர்ச்டவசமாக பாதுகாப்பற்ற மின்னஞ்சல்களால் அனுப்பப்பட்ட சில நற்சான்றிதழ்களைப் பார்ப்பது அடிக்கடி நிகழ்கிறது; இது உண்மையில் தவிர்க்கப்பட வேண்டும்.
uk: Деякі проблеми можуть бути пов'язані з конкретним обліковим записом, через її ACL, групи тощо. В цьому випадку, на жаль, часто можна побачити деякі облікові дані, надіслані по незахищеній е-пошті, чого слід уникати.

source: As super administrator user, you wil see an extra icon in the members list, allowing you to log in as selected user without his credentials. Once you've impersonated the user, you can reproduce the issue and fix it or get all required information to report the issue upstream.
es: Como usuario superadministrador, puedes ver un icono extra en la lista de miembros, permitiendo que inicies sesión como un usuario seleccionado sin tener sus credenciales. Una vez hayas suplantado su identidad, puedes reproducir el problema y solucionarlo o recuperar toda la información necesaria para notificar el problema.
ta: சூப்பர் நிர்வாகி பயனராக, உறுப்பினர்கள் பட்டியலில் கூடுதல் ஐகானைக் காண்பீர்கள், இது அவரது நற்சான்றிதழ்கள் இல்லாமல் தேர்ந்தெடுக்கப்பட்ட பயனராக உள்நுழைய அனுமதிக்கிறது. நீங்கள் பயனருக்கு ஆள்மாறாட்டம் செய்தவுடன், சிக்கலை மீண்டும் உருவாக்கி அதை சரிசெய்யலாம் அல்லது சிக்கலை அப்ச்ட்ரீமைப் புகாரளிக்க தேவையான அனைத்து தகவல்களையும் பெறலாம்.
uk: Як користувач суперадміністратор, ви побачите додаткову піктограму в списку членів, що дозволяє увійти в систему як обраний користувач без його облікових даних. Після того як ви видасте себе за користувача, ви зможете відтворити проблему та усунути її або отримати всі необхідні відомості, щоб повідомити про проблему вище.

source: You can use the "Generate fake data" from the "Configuration" menu to add demonstration data in your instance.
fr_fr: Vous pouvez utiliser la « Génération des données factices » depuis la menu « Configuration » pour ajouter des données d'exemple à votre instance.
it: Si può usare la funzione "Genera dati falsi" dal menu "Configurazione" per aggiungere dati dimostrativi alla propria istanza.

source: Let's start by creating a new member. As everywhere in Galette, mandatory fields are displayed with a red border; all other are optionnal. Different parts of the page (`Identity`, `Contact informations`, `Galette related data` and maybe `Dynamic fields`) can be retracted clicking on their respective title.
fr_fr: Commençons par créer un nouvel adhérent. Comme partout dans Galette, les champs requis sont affichés avec une bordure rouge ; tous les autres sont optionnels. Les différentes parties de la page (`Identité`, `Informations de contact`, `Informations relatives à Galette` et éventuellement `Champs dynamiques`) peuvent être rétractées en cliquant sur leur titre respectif.

source: When storing a member (or any other object in Galette), page will be reloaded with all informations you've entered (excepting passwords).
fr_fr: Lors de l'enregistrement d'un adhérent (ou de tout autre objet dans Galette), la page sera rechargées avec toutes les informations que vous aurez saisies (à l'exception des mots de passe).

source: generate PDF emargement lists,
fr_fr: générer des listes d'émargement PDF,

source: **from Galette preferences** (default value): this will use informations stored in preferences,
fr_fr: **depuis les préférences de galette** (par défaut) : utilisera les informations enregistrées dans les préférences,

source: Even if Galette is able to send HTML emails, this is discouraged. Messages lenght will be way larger (for almost nothing), and some (like me!) read their emails as text only. That is why Galette will **always** provide a text version of HTML emails.
fr_fr: Bien que Galette soit en mesure d'envoyer des courriels HTML, c'est déconseillé. La taille des messages n'en sera que plus grande (pour pas grand chose), et certains (comme moi !) lisent leurs courriels en texte seul. C'est pourquoi Galette enverra **toujours** une version texte des courriels HTML.

source: Every sent mailing is stored into the database, and can be used as a template to write a new one. In this case, a new mailing will be created using informations from the history, and the original one will be kept as is.
fr_fr: Chaque emailing envoyé est stocké dans la base de données, et peut être utilisé comme modèle pour en créer un nouveau. Dans ce cas, un nouvel emailing sera créé en utilisant les informations de l'historique, et les originaux conservés tels quels.

source: When you use an existing history entry, here are the informations that will be used:
fr_fr: Lorsque vous utilisez une entrée de l'historique, voici les informations qui seront utilisées :

source: Import model defines fields and their order in a CSV file. When importing, current model will be used to check your CSV file intergity.
fr_fr: Le modèle d'import définit des champs et leur ordre au sein d'un fichier CSV. Lors de l'import, le modèle courant sera utilisé pour vérifier l'intégrité de votre fichier CSV.

source: Links beetween members
fr_fr: Lien entre fiches adhérent

source: You can link several members to a "parent" one. This may be used to store families for exemple, or members of a same compagny. You can access children members from the parent, and parent from the children.
fr_fr: Vous pouvez attacher plusieurs adhérents à un « parent ». Cela peut être utilisé pour gérer des familles par exemple, ou des membres d'une même société. Vous pouvez accéder aux fiches « enfants » depuis le parent, et du parent depuis les enfants.

source: The other interesting point of this system is you can retrieve some informations from the parent when sending mailings or labels. In the children members, email and postal addresses automatically become optionnal, whatever the configuration says. If any of those informations is missing, it will be retrieved from the parent.
fr_fr: L'autre point intéressant de ce système est de pouvoir récupérer certaines informations depuis le parent lors de l'envoi de mailings ou d'étiquettes. Pour les enfants, l'adresse de courriel et l'adresse postale deviennent optionnelles, quoi qu'en dise la configuration. Si l'une de ces informations est manquante, elle sera récupérée depuis son parent.

source: Members without email adresses cannot use the "retrieve password" feature. This does not affect the unicity email constraint in the database.
fr_fr: Les adhérents sans adresse courriel ne peuvent utiliser la fonctionnalité « Mot de passe perdu ». Cela n'affecte pas l'unicité des courriels en base.

source: Impersonnating
fr_fr: Prise d'identité

source: Some issues may be related to a particular account, because of its ACLs, groups, ... In this case, it is unfortuntely frequent to see some credentials sent by insecure emails; which should really be avoid.
fr_fr: Certains problèmes peuvent être liés à un compte spécifique, pour des raisons de droits, d'appartenance à des groupes, ... Dans ce cas Il est malheureusement fréquent de voir des informations d'authentification envoyées par le biais de courriels non sécurisés ; ce qui doit absolument être évité.

source: As super admininistrator user, you wil see an extra icon in the members list, allowing you to log in as selected user without his credentials. Once you've impersonnated the user, you can reproduce the issue and fix it or get all required informations to report the issue upstream.
fr_fr: En tant que super administrateur, vous verrez une action supplémentaire depuis la liste des adhérents, qui vous permettra de vous connecter avec le compte de l'utilisateur sans ses informations de connexion. Une fois cela fait, vous pourrez reproduire le problème et le corriger ou obtenir les informations nécessaires à un rapport de bogue.
