Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/avancee.po
Languages: es, it, uk

source: **reinitialize mailings contents** will reset all emails contents to default values,
es: **reinicializar los contenidos de los correos electrónicos** restablecerá todo el contenido de los correos electrónicos a valores predeterminados,
it: **reinizializza i contenuti dei messaggi di posta** ripristinerà tutti i contenuti delle email ai valori predefiniti,
uk: **повторна ініціалізація вмістів розсилань** поверне вміст всіх листів до типових значень,

source: **reinitialize fields configuration** will reset all members core fields to their default value. This does not imply dynamic fields,
es: **reinicializar la configuración de los campos** restablecerá todos los campos principales de los miembros a sus valores predeterminados. Esto no implica a los campos dinámicos,
it: **reinizializza la configurazione dei campi** ripristinerà tutti i campi principali dei membri al loro valore predefinito. Ciò non implica campi dinamici,
uk: **повторна ініціалізація конфігурацій полів** скине всі поля ядра членів в типові значення. Це не включає динамічні поля,

source: **reinitialize PDF models** will reset ll PDF models to default values,
es: **reinicializar los modelos PDF** restablecerá todos los modelos PDF a sus valores predeterminados,
it: **reinizializza modelli PDF** ripristinerà tutti i modelli PDF ai valori predefiniti,
uk: **повторна ініціалізація моделей PDF** скине моделі PDF до типових значень,

source: **generate empty logins and passwords** those information are required to improve security, but sometimes missing (if you import a CSV for example). This feature will set random values as login and password fields that would be empty in database.
es: **generar nombres de usuario y contraseñas vacíos** esas informaciones son obligatorias para mejorar la seguridad, pero a veces faltan (si importas un CSV por ejemplo). Esta función establecerá valores aleatorios para los campos de nombre de usuario y contraseñas que puedan estar vacías en la base de datos.
it: **genera accessi e password vuoti** queste informazioni sono necessarie per migliorare la sicurezza, ma a volte mancano (se si importa un CSV, ad esempio). Questa funzione imposterà valori casuali come campi di login e password che rimarrebbero vuoti nel database.
uk: **утворити порожні логіни і паролі** ці дані необхідні для підвищення безпеки, але іноді відсутні (наприклад, при імпорті CSV). Ця функція встановить випадкові значення в поля логіна і пароля, які будуть порожніми в базі даних.

source: **Fix dynamic fields dates format** will convert all dynamic fields dates to the new format (see :ref:`dynamic fields <dynamic_fields>`).
it: **Correggi il formato delle date dei campi dinamici** convertirà tutte le date dei campi dinamici nel nuovo formato (vedi :ref:`campi dinamici <dynamic_fields>`).
uk: **Виправити формат дат динамічних полів** перетворить усі дати динамічних полів у новий формат (див. :ref:`dynamic fields <dynamic_fields>`).

source: Galette modes
es: Modos de Galette
it: Modalità di Galette
uk: Режими Галетта

source: Several modes are provided in Galette you can configure with ``GALETTE_MODE`` constant (:ref:`see Galette behavior configuration <behavior>`). This directive can take the following values:
es: En Galette se suministran varios modos que puedes configurar con la constante ``GALETTE_MODE`` (:ref:`ver la configuración de comportamiento de Galette <behavior>`). Esta directiva puede tomar los siguientes valores:
it: È possibile configurare Galette con varie modalità di cui è fornito con la costante``GALETTE_MODE`` (:ref:`vedere configurazione comportamento di Galette <behavior>`). Questa direttiva può assumere i seguenti valori:
uk: У Galette передбачено кілька режимів, які можна налаштувати за допомогою константи ``GALETTE_MODE`` (:ref:`see Galette behavior configuration <behavior>`). Ця директива може приймати такі значення:

source: ``PROD``: production mode (non production instance should be on an other mode). This is the default mode for releases, but it may change in development branch.
es: ``PROD``: modo producción (la instancia no producción debe estar en otro modo). Este es el modo predeterminado para los lanzamientos, pero puede cambiar en la rama de desarrollo.
it: ``PROD``: modalità di produzione (l'istanza di non produzione dovrebbe essere su un'altra modalità). Questa è la modalità predefinita per i rilasci, ma può cambiare nel ramo di sviluppo.
uk: ``PROD``: робочий режим (невиробничий екземпляр має бути в іншому режимі). Це режим за замовчуванням для випусків, але він може змінитися в розробці.

source: ``DEMO``: demonstration mode, the same as ``PROD`` but with some features disabled like sending emails, modifying superadmin data, ...
es: ``DEMO``: modo demonstración, parecido a ``PROD`` pero con algunas funciones desactivadas como el envío de correos electrónicos, modificar los datos del superadministrador, ...
it: ``DEMO``: modalità dimostrativa, uguale a ``PROD`` ma con alcune caratteristiche disabilitate come l'invio di e-mail, la modifica dei dati superadmin, ...
uk: ``DEMO``: демонстраційний режим, такий самий, як ``PROD``, але з вимкненими деякими функціями, як-от надсилання електронних листів, зміна даних суперадміністратора, ...

source: ``TEST``: reserved for unit tests.
es: ``TEST``: reservado para los test unitarios.
it: ``TEST``: riservata agli unit test.
uk: ``TEST``: зарезервовано для модульних тестів.

source: ``MAINT``: maintainance mode. Only super admin will be able to login.
es: ``MAINT``: modo mantenimiento. Solo el superadministrador podrá iniciar sesión.
it: ``MAINT``: modalità di manutenzione. Solo il super amministratore sarà in grado di effettuare il login.
uk: ``MAINT``: режим обслуговування. Лише суперадміністратор зможе увійти.

source: Galette Debug
es: Depuración de Galette
it: Debug di Galette
uk: Налагодження Galette

source: A dedicated constant name ``GALETTE_DEBUG`` can be used to enable debug mode. With this mode on:
es: Para activar el modo depuración se puede utilizar una constante específica llamada ``GALETTE_DEBUG``. Con este modo activado:
it: Un nome costante dedicato ``GALETTE_DEBUG``` può essere utilizzato per abilitare la modalità debug. Con questa modalità abilitata:
uk: Щоб увімкнути режим налагодження, можна використовувати спеціальну постійну назву ``GALETTE_DEBUG``. При включеному режимі:

source: unstable/not finished parts will be activated,
es: se activarán las partes inestables/no acabadas,
it: parti instabili/non finite verranno attivate,
uk: нестабільні/недороблені частини будуть активовані,

source: some data will not be stored in session,
es: algunos datos no se guardan en la sesión,
it: alcuni dati non saranno memorizzati nella sessione,
uk: деякі дані не зберігатимуться в сесії,

source: default log level is set to ``DEBUG``,
es: El nivel de registro por defecto está establecido en ``‘DEBUG``,
it: il livello di log predefinito sarà impostato a `DEBUG`,
uk: рівень журналу за замовчуванням встановлено на ``DEBUG``,

source: news won't be cached,
es: las noticias no se almacenarán en caché,
it: le notizie non verranno memorizzate,
uk: новини не будуть кешуватися,

source: database version check will not be done.
es: no se comprobará la versión de la base de datos.
it: il controllo della versione del database non sarà eseguito.
uk: перевірка версії бази даних не проводитиметься.

source: Behavior configuration
es: Configuración de comportamiento
it: Configurazione del comportamento
uk: Конфігурація поведінки

source: It is possible to change some of Galette behaviors:
es: Es posible cambiar alguno de los ajustes de Galette:
it: È possibile cambiare alcuni comportamenti di Galette:
uk: Можна змінити деякі поведінки Galette:

source: `GALETTE_DEBUG`: :ref:`see Galette debug <debug>`;
es: `GALETTE_DEBUG`: :ref:`ver depuración de Galette <debug>`;
it: `GALETTE_DEBUG`: ref: `vedere il Debug di Galette <debug>`;

source: you'll find in related part of the documentation you can use behavior configuration for some other usages (such as PDF cards settings, session lifetime, ...).
es: En la parte relacionada de la documentación puede encontrar la configuración del comportamiento para otros usos (como por ejemplo, las tarjetas PDF, la duración de la sesión,...).
it: troverete nella parte relativa della documentazione che è possibile utilizzare la configurazione del comportamento per altri usi (come le impostazioni delle schede PDF, la durata della sessione, ...).
uk: ви знайдете у відповідній частині документації, яку можна використовувати для деяких інших цілей (наприклад, параметрів карток PDF, тривалості сеансу тощо).

source: You can add those directives by declaring constants in the ``galette/config/behavior.inc.php``.
es: Puede agregar estas directivas declarando constantes en el archivo ``galette/config/behavior.inc.php``.
it: È possibile aggiungere queste direttive dichiarando costanti in ``galette/config/behavior.inc.php``.
uk: Ви можете додати ці директиви, оголосивши константи в ``galette/config/behavior.inc.php``.

source: For example:
es: Por ejemplo:
it: Per esempio:
uk: Наприклад:
