Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/avancee.po
Languages: es, it, uk

source: Experienced users
es: Usuarios experimentados
it: Utenti esperti
uk: Користувачі, що брали участь в експериментах

source: Use only following instructions if you know what you are doing... "The management is not responsable for any case of [...]" :D
es: Utiliza las siguientes instrucciones solo si sabes lo que estás haciendo... "El administrador no es responsable en ningún caso de [...] " :D
it: Usare solo seguendo le istruzioni se si sa cosa si sta facendo... "La gestione non è responsabile per ogni caso di [...]" :D
uk: Користуйтеся тільки слідуючи вказівкам, якщо ви знаєте, що робите ... "Керівництво не несе відповідальності за будь-який випадок [...]": D

source: Adapt to your graphical chart
es: Adaptar a tu gráfica
it: Adatta al grafico
uk: Пристосування до вашого графіку

source: If you are comfortable with CSS stylesheets, you can adapt Galette CSS to fit your own colors. To achieve that, it is strongly discouraged to edit Galette CSS files, but rather the specific mecanism designed for that. Create a ``galette_local.css`` file in your ``webroot/themes/default`` directory with your styles, it will be automatically included.
es: Si te sientes cómodo con las hojas de estilo CSS, puedes adaptar Galette CSS para que se ajuste con tus propios colores. Para lograrlo, se desaconseja encarecidamente editar los archivos CSS de Galette, sino usar el mecanismo específico diseñado para ello. Crea un archivo ``galette_local.css`` en tu carpeta ``webroot/themes/default`` con tus propios estilos, serán incluidos automáticamente.
it: Se si conosce fogli di stile CSS, si può adattare i CSS di Galette per impostare i colori. Per raggiungere questo obiettivo, è fortemente sconsigliato modificare i file CSS di Galette direttamente, ma piuttosto attraverso un meccanismo specificatamente progettato per questo. Creando un file ``galette_local.css`` nella cartella ``webroot/themes/default`` i propri stili, verranno automaticamente inclusi.
uk: Якщо ви вмієте працювати з таблицями стилів CSS, ви можете пристосувати Galette CSS під свої власні кольори. Для цього настійно не пораджено редагувати файли Galette CSS, а краще використовувати спеціальний механізм, призначений для цього. Створіть файл ``galette_local.css`` у вашому каталозі ``webroot/themes/default`` зі своїми стилями, їх буде автоматично увімкнено.

source: Try to keep things as simple as possible. For example, if you want to change association name color (displayed under pages titles), you will find in Galette the CSS rule `#asso_name` that defines several parameters including the color. Then, in your stylesheet, you will just need the following:
es: Intenta mantener las cosas lo más simples posible. Por ejemplo, si deseas cambiar el nombre del color de la organización (mostrado bajo los títulos de las páginas), encontrará en Galette la regla CSS `#asso_name` que define varios parámetros, incluido el color. Después, en tu hoja de estilo, solo necesitarás lo siguiente:
it: Si cerchi di mantenere le cose il più semplici possibile. Ad esempio, se si vuole cambiare il colore del nome dell'associazione (visualizzato sotto i titoli delle pagine), si troverà in Galette la regola CSS `#asso_name` che definisce diversi parametri incluso il colore. Quindi, nel proprio foglio di stile, si avrà bisogno solo di quanto segue:
uk: Постарайтеся зробити все якомога простіше. Наприклад, якщо ви хочете змінити колір назви товариства (відображається під заголовками сторінок), ви знайдете в Galette CSS-правило `#asso_name`, яке визначає кілька параметрів, включно з кольором. Потім, у вашій таблиці стилів, вам знадобиться тільки наступне:

source: This will be enough to display your association name in red. Note that local CSS file and all issues it may cause will not be took into account by the Galette team, no support will be provided.
es: Esto será suficiente para mostrar el nombre de su organización en rojo. Ten en cuenta que el archivo CSS local y todos los problemas que pueda causar no serán tenidos en cuenta por el equipo de Galette, no se prestará ningún tipo de ayuda.
it: Questo sarà sufficiente per visualizzare il nome della propria associazione in rosso. Si noti che il file CSS locale e tutti i problemi che può causare non saranno presi in considerazione dal team Galette, non verrà fornito alcun supporto.
uk: Цього буде достатньо для показу назви вашого товариства червоним кольором. Запримітьте, що локальний CSS файл і всі проблеми, які він може викликати, не будуть прийняті до уваги командою Galette, підтримка не буде надана.

source: You also can override the print stylesheet, just create a ``galette_print_local.css`` file.
es: También puedes sobrescribir la hoja de estilos de la impresión, sólo tienes que crear un archivo ``galette_print_local.css``.
it: Si può anche imporre il foglio di stile di stampa, basta creare un file ``galette_print_local.css``.
uk: Ви також можете перевизначити таблицю стилів друку, просто створіть файл ``galette_print_local.css``.

source: Add and change strings
es: Añadir y modificar cadenas
it: Aggiungere e modificare le stringhe
uk: Додавання та змінення рядків

source: It is possible if needed to customize translated strings in Galette - without editing any Galette source file. Just create a ``galette_{mylang}_local_lang.php`` file (where `{mylang}` must be replaced with the language, like `fr_FR.utf8` or `en_US`) in the ``lang`` directory. This file must contains a simple PHP array with the original string (the one in Galette source code) as index.
es: Es posible, si es necesario, personalizar las cadenas traducidas en Galette - sin editar ningún archivo fuente de Galette. Sólo tienes que crear un archivo ``galette_{mylang}_local_lang.php`` (donde `{mylang}` debe ser sustituido por el idioma, como `fr_FR.utf8` o `en_US`) en la carpeta ``lang``. Este archivo debe contener una simple matriz PHP con la cadena original (la del código fuente de Galette) como índice.
it: Se necessario, è possibile personalizzare le stringhe tradotte in Galette, senza modificare alcun file sorgente Galette. Basta creare un file ``galette_{mylang}_local_lang.php`` (dove `{mylang}` deve essere sostituito con la lingua, come `it_IT.utf8` o `en_US`) nella cartella ``lang``. Questo file deve contenere un semplice array PHP con la stringa originale (quella nel codice sorgente Galette) come indice.
uk: За необхідності можна налаштувати перекладені рядки в Galette - без змінення будь-якого вихідного файлу Galette. Просто створіть файл ``galette_ {mylang} _local_lang.php`` (де `{mylang}` повинен бути замінений на мову, наприклад `fr_FR.utf8` або` en_US`) в каталозі `` lang``. Цей файл повинен містити простий PHP-масив з вихідним рядком (тим, що у вихідному коді Galette) в якості індексу.

source: As example, we want to change the "Password" string on the login page in french, translated as `Mot de passe :`. The original string is `Password:` (see ``galette/templates/default/index.tpl``), its french translation is `Mot de passe :` and we want to replace it with `Secret :`; so we will create the ``galette_fr_FR.utf8_local_lang.php`` with the following contents:
es: Como ejemplo, queremos cambiar la cadena "Contraseña" en la página de inicio de sesión en francés, traducida como `Mot de passe :`. La cadena original es `Password:` (ver ``galette/templates/default/index.tpl``), su traducción al francés es `Mot de passe :` y queremos reemplazarla con `Secret :`; así que crearemos ``galette_fr_FR.utf8_local_lang.php`` con el siguiente contenido:
it: Ad esempio, vogliamo cambiare la stringa "Password" nella pagina di accesso in francese, tradotta come `Mot de passe :`. La stringa originale è `Password:` (vedere ``galette/templates/default/index.tpl``), la sua traduzione francese è `Mot de passe :` e vogliamo sostituirla con `Secret :`; quindi creeremo il ``galette_fr_FR.utf8_local_lang.php`` con il seguente contenuto:
uk: Наприклад, ми хочемо змінити рядок "Password" на сторінці входу в систему українською мовою, перекладену як `Пароль:`. Оригінальний рядок - `Password:` (див. ``Galette / templates / default / index.tpl``), його український переклад - `Пароль:` і ми хочемо замінити його на `Гасло: ``; тому ми створимо `` galette_fr_FR.utf8_local_lang.php`` з наступним змістом:

source: Since Galette uses a cache system for translations, changes may not be visible immediately; you may have to restart PHP (or to clear cache). It is important to take the original string verbatim, punctuation included; and take care to escape single quotes (with a backslash) in all the strings.
es: Desde que Galette utiliza un sistema de caché para las traducciones, los cambios no serán visibles inmediatamente; debes reiniciar tu PHP (o vaciar la caché). Es importante tomar la cadena original al pie de la letra, puntuación incluida; y tener cuidado de escapar las comillas simples (con una barra invertida) en todas las cadenas.
it: Poiché Galette utilizza un sistema di cache per le traduzioni, le modifiche potrebbero non essere immediatamente visibili; potrebbe essere necessario riavviare PHP (o svuotare la cache). È importante prendere la stringa originale alla lettera, punteggiatura inclusa; e fare attenzione a evitare le virgolette singole (con una barra rovesciata) in tutte le stringhe.
uk: Оскільки Galette використовує систему кешування для перекладів, зміни можуть бути видні не відразу; можливо, вам доведеться перезапустити PHP (або очистити кеш). Важливо сприймати вихідний рядок дослівно, включаючи пунктуацію, і стежити за тим, щоб у всіх рядках були одинарні лапки (зі зворотною скісною рискою).

source: You also can override langs for plugins using the sam method, just place the file in plugins lang directory and name it ``{plugin}_{mylang}_local_lang.php`` where `{plugin}` is the routing name you can find in the ``_define.php`` file.
es: También puedes sobrescribir los idiomas para los complementos utilizando el mismo método, pon el archivo en la carpeta de idiomas de los complementos y llámalo ``{plugin}_{mylang}_local_lang.php`` donde `{plugin}` es el nombre de la ruta donde puedes encontrar el archivo ``_define.php``.
it: Si può anche imporrsi sui lang per i plugin usando il metodo sam, basta inserire il file nella cartella lang dei plugin e chiamarlo ``{plugin}_{mylang}_local_lang.php`` dove `{plugin}` è il nome del routing che si trova nel file ``_define.php``.
uk: Ви також можете перевизначити мови для розширень, використовуючи метод sam, просто помістіть файл в каталог plugins lang і назвіть його ``{plugin}_{mylang}_local_lang.php`` де `{plugin}` - назва маршруту, яку ви можете знайти в файлі ``_define.php``.

source: This will work only if you use Galette translation features, and not with native gettext.
es: Esto solo funcionará si utilizas la función de traducción de Galette, y no la nativa gettext.
it: Funzionerà solo se usano le funzionalità di traduzione di Galette e non con gettext nativo.
uk: Це буде працювати тільки за використання функцій перекладу Galette, але не за використання рідного gettext.

source: Change session lifetime
es: Cambiar la duración de la sesión
it: Modifica la durata della sessione
uk: Зміна тривалості сеансу

source: Per default, Galette will create session with default lifetime duration (and it seems browsers acts differently in this case). You can anyways define a constant named ``GALETTE_TIMEOUT`` to change session lifetime using :ref:`behavior configuration <behavior>`:
es: Por defecto, Galette creará la sesión con la duración por defecto (y parece que los navegadores actúan diferente en este caso). De todas maneras puedes definir una constante llamada ``GALETTE_TIMEOUT`` para cambiar la duración de la sesión utilizando :ref:`configuración de comportamiento <behavior>`:
it: Per impostazione predefinita, Galette creerà sessioni con durata di vita predefinita (e sembra che i browser funzionino in modo diverso in questo caso). È comunque possibile definire una costante chiamata ``GALETTE_TIMEOUT`` per cambiare la durata della sessione usando :ref:`la configurazione del comportamento <behavior>`:
uk: За замовчуванням Galette створить сеанс із тривалістю життя за замовчуванням (і, схоже, браузери в цьому випадку діють інакше). Ви все одно можете визначити константу з назвою ``GALETTE_TIMEOUT`` змінити тривалість сеансу за допомогою :ref:`behavior configuration <behavior>`:

source: Log IP addresses behind a proxy
es: Registrar las direcciones IP detrás de un proxy
it: Registra gli indirizzi IP dietro un proxy
uk: Запис IP-адрес за проксі-сервером

source: If your Galette instance is behind a proxy, IP address stored in history will be the proxy one, and not the user one :(
es: Si tu instancia de Galette se encuentra detrás de un proxy, la dirección IP guardada en el historial será la del proxy, no la del usuario :(
it: Se l'istanza Galette è dietro un proxy, l'indirizzo IP memorizzato nella storia sarà quello del proxy e non quello dell'utente :(
uk: Якщо ваш зразок Galette знаходиться за проксі-сервером, IP-адреса, збережена в історії, буде проксі-адресою, а не призначеною для користувача :(

source: To fix that, use :ref:`behavior configuration <behavior>` to create a constant named ``GALETTE_X_FORWARDED_FOR_INDEX`` like:
es: Para corregir esto, utiliza :ref:`configuración de comportamiento <behavior>` para crear una constante llamada ``GALETTE_X_FORWARDED_FOR_INDEX`` como:
it: Per risolvere questo problema, utilizzare :ref: `la configurazione del comportamento <behavior>` per creare una costante denominata ``GALETTE_X_FORWARDED_FOR_INDEX`` come:
uk: Щоб виправити це, використовуйте :ref:`behavior configuration <behavior>` створити константу з назвою ``GALETTE_X_FORWARDED_FOR_INDEX``, наприклад:

source: Each proxy server will add its own address on the list, example above will work only if there is only one proxy server.
es: Cada servidor de proxy añadirá su propia dirección a la lista, el ejemplo anterior solo funcionará si hay un único servidor proxy.
it: Ogni server proxy aggiungerà il proprio indirizzo nell'elenco, l'esempio sopra funzionerà solo se c'è solo un server proxy.
uk: Кожен проксі-сервер додаватиме свою власну адресу в список, приклад вище працюватиме тільки якщо є тільки один проксі-сервер.

source: For security reasons, do not use this if your instance is not behind a proxy!
es: Por motivos de seguridad, ¡no utilices esto si tu instancia no está detrás de un proxy!
it: Per motivi di sicurezza, da non utilizzare se l'istanza non è dietro un proxy!
uk: З метою безпеки не використовуйте це, якщо ваш зразок не знаходиться за проксі-сервером!

source: External stats
es: Estadísticas externas
it: Statistiche esterne
uk: Зовнішня статистика

source: Many statistics plaftforms relies on an extra Javascript block to work. You can create a ``tracking.js`` file under ``webroot/themes/default`` directory, it will be automatically included.
es: Muchas plataformas de estadísticas se basan en un bloque Javascript adicional para funcionar. Puedes crear un archivo ``tracking.js`` en la carpeta ``webroot/themes/default``, se incluirá automáticamente.
it: Molte piattaforme di statistica si basano su un blocco Javascript extra per funzionare. È possibile creare un file ``tracking.js`` nella cartella ``webroot/themes/default``, esso verrà incluso automaticamente.
uk: Багато статистичних платформ покладаються на додатковий блок JavaScript для роботи. Ви можете створити файл ``tracking.js`` у каталозі ``webroot/themes/default``, його буде автоматично включено.

source: Galette uses Javascript to work. If the code you add in the ``tracking.js`` file is incorrect, this may break Galette!
es: Galette utiliza Javascript para funcionar. Si el código que añades en el archivo ``tracking.js`` no es correcto, ¡esto romperá Galette!
it: Galette utilizza Javascript per funzionare. Se il codice aggiunto nel file ``tracking.js`` è errato, si può bloccare Galette!
uk: Для роботи Galette використовує Javascript. Якщо код, який ви додасте в файл ``tracking.js``, буде неправильним, це може привести до зламання Galette!

source: CSV exports
es: Exportaciones CSV
it: Esportazioni CSV
uk: Експорти CSV

source: You can setup paremeters exports with a `YAML <https://yaml.org/>`_ file instead of an XML one.
es: Puedes configurar parámetros de exportaciones con un archivo `YAML <https://yaml.org/>`_ en vez de uno XML.
it: È possibile impostare le esportazioni dei parametri con un file `YAML <https://yaml.org/>`_ anziché con uno XML.
uk: Ви можете налаштувати експорт параметрів за допомогою файлу `YAML <https://yaml.org/>`_ замість XML.

source: Galette provides a parameted CSV exports system. Only one parameted export is provided, but you can add your own to the ``config/exports.yaml`` file.
es: Galette proporciona un sistema de exportación CSV parametrizado. Solo se proporciona una exportación parametrizada, pero puede agregar la suya al archivo `config/exports.yaml`.
it: Galette fornisce un sistema di esportazione CSV parametrizzato. Viene fornita solo un'esportazione con parametri, ma è possibile aggiungerne una propria al file ``config/exports.yaml``.
uk: Galette надає систему експорту CSV з параметрами. Надається тільки один параметричний експорт, але ви можете додати свій власний в файл ``config / exports.yaml``.

source: Legacy XML configuration file is still supported; if a duplicate identifier is found, YAML file takes precedence.
es: Todavía se admite el archivo de configuración XML heredado; si se encuentra un identificador duplicado, el archivo YAML tiene prioridad.
it: Il file di configurazione XML tradizionale è ancora supportato; ma se si trova un identificatore duplicato, il file YAML ha la precedenza.
uk: Застарілий файл конфігурації XML все ще підтримується; якщо знайдено повторюваний ідентифікатор, пріоритет має файл YAML.

source: Let's examine existing "cotisations" parameted export:
es: Examinemos la exportación parametrizada existente "cotizaciones":
it: Esaminiamo i parametri di esportazione delle "cotizzazioni" esistenti:
uk: Давайте розглянемо існуючий параметризований експорт "cotisations":

source: each array entry is a unique identifier, lowercase without spaces or special character
es: cada matriz de entrada es un identificador único, en minúsculas sin espacios o caracteres especiales
it: ogni voce dell'array è un identificatore univoco, minuscolo senza spazi o caratteri speciali
uk: кожен запис масиву є унікальним ідентифікатором, малими літерами без пробілів або спеціальних символів

source: `name` and `description` are mandatory as used to display each parameted export in the user interface
es: `name` and `description` son obligatorios ya que se utilizan para mostrar cada exportación parametrizada en la interfaz de usuario
it: `nome` e `descrizione` sono obbligatori poiché vengono utilizzati per visualizzare ciascuna esportazione con parametri nell'interfaccia utente
uk: `name` та `description` є обов’язковими для відображення кожного параметрованого експорту в інтерфейсі користувача

source: `filename` sets the filename for output file
es: `filename` establece el nombre del archivo de salida
it: `filename` imposta il nome del file per il file di uscita
uk: `filename` встановлює назву файлу для вихідного файлу

source: `query` is the query to execute, it's mandatory. There is no other limitation than the SQL engine ones, expect you cannot send them any parameters
es: `query` es la consulta a ejecutar, es obligatorio. No hay más limitaciones que las del motor SQL, salvo que no puedes enviarles ningún parámetro
it: `query` è la query da eseguire, è obbligatorio. Non c'è altra limitazione oltre a quelle del motore SQL, ci si aspetta che non si possano inviare loro dei parametri
uk: `query` – це запит для виконання, він є обов’язковим. Немає жодних інших обмежень, окрім обмежень механізму SQL, очікуйте, що ви не можете надіслати їм жодних параметрів

source: `headers` manages columns titles:
es: `headers` gestiona los títulos de las columnas:
it: `headers` gestisce i titoli delle colonne:
uk: `headers` керує заголовками стовпців:

source: like in the above example, an array of columns titles of your own
es: como en el ejemplo anterior, una matriz de títulos de tus propias columnas
it: come nell'esempio sopra, una serie di titoli di colonne di propria scelta
uk: як у наведеному вище прикладі, масив власних заголовків стовпців

source: if not present, Galette fields names will be exported. You can use named columns in your SQL query (``SELECT nom_adh AS "Column title" FROM ...``)
es: si no está presente, se exportarán los nombres de los campos de Galette. Puedes utilizar alias para las columnas en tu consulta SQL (``SELECT nom_adh AS "Column title" FROM ...``)
it: se non presente, i nomi dei campi Galette saranno esportati. È possibile utilizzare le colonne nominate nella query SQL (`SELECT nom_adh AS "Titolo colonna" FROM ...``)
uk: якщо їх немає, імена полів Galette будуть експортовані. Ви можете використовувати іменовані стовпці у своєму запиті SQL (``SELECT nom_adh AS "Column title" FROM ...``)

source: set to false (``headers: false``) to disable column headers output
es: establecer a falso (``headers: false``) para desactivar la columna de cabecera de la salida
it: impostare a falso (``headers: false``) per disabilitare le intestazioni delle colonne nell'uscita
uk: встановіть значення false (``headers: false``), щоб вимкнути виведення заголовків стовпців

source: `separator` is the CSV separator that will be used. Possible values are:
es: `separator` se utilizará el separador CSV. Los valores posibles son:
it: `separator` è il separatore CSV che verrà utilizzato. Valori possibili sono:
uk: `separator` – це роздільник CSV, який буде використано. Можливі значення:

source: semicolon (``;``) - default
es: punto y coma (``;``) - default
it: punto e virgola (``;``) - predefinito
uk: крапка з комою (``;``) - за замовчуванням

source: comma (``,``)
es: coma (``,``)
it: virgola (``,``)
uk: кома (``,``)

source: tabulation character (``\t``)
es: tabulación (``\t``)
it: carattere di tabulazione (``\t``)
uk: символ таблиці (``\t``)

source: `quote` either double quote - default - or simple quote character
es: `quote` ya sea doble - por defecto - o sencilla
it: `quote` virgolette doppie - predefinito - oppure singolo apice
uk: `quote` або подвійна лапка (за замовчуванням) або простий символ лапки

source: to disable an export, you can add ``inactive: true``
es: para desactivar una exportación, puedes añadir ``inactive: true``
it: per disabilitare un'esportazione, è possibile aggiungere ``inactive: true``
uk: щоб вимкнути експорт, ви можете додати ``inactive: true``

source: Administration tools
es: Herramientas administrativas
it: Impostazioni amministratore
uk: Засоби адміністрування

source: All the admin tools operation are destructive, use it with cautions, and **make sure you did a database backup** before!
es: Todas las operaciones de herramientas de administrador son destructivas, utilízalas con precaución, ¡**asegúrate que hiciste una copia de seguridad** antes!
it: Tutte le operazioni degli strumenti di amministrazione sono distruttive, usarle con cautela e prima **assicurarsi di aver eseguito un backup del database**!
uk: Всі засоби адміністратора є небезпечними, використовуйте їх з обережністю, і ** переконайтеся, що ви зробили резервну копію бази даних** перед використанням!

source: There are a few tools provided for Galette admin that permits to:
es: Hay algunas herramientas suministradas por el administrador de Galette que permite:
it: Ci sono alcuni strumenti forniti per l'amministratore di Galette che permettono di:
uk: Для адміністратора Galette передбачено кілька засобів, що дозволяють:
