Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/configuration.po
Languages: es, fr_fr, it, uk

source: Fields Configuration
es: Configuración de campos
fr_fr: Configuration des champs
it: Configurazione campi
uk: Конфігурація полів

source: List fields
es: Lista de campos
fr_fr: Liste des champs
it: Elenca campi
uk: Поля списків

source: You can choose which fields will appears on Galette members list and the order they will appear with a drag & drop interface. Related access rights can be set from core fields configuration (see below).
es: Puedes elegir que campos aparecerán en la lista de miembros de Galette y en que orden se mostrarán con una interfaz de arrastrar y soltar. Se pueden establecer los permisos de acceso relacionados desde la configuración de campos principales (ver a continuación).
fr_fr: Vous pouvez choisir quels champs apparaitront sur la liste des adhérents de Galette et leur ordre d'affichage avec une interface simple glisser-déposer. Les droits d'accès liés sont gérés depuis la configuration des champs (voir ci-dessous).
it: Si può scegliere quali campi appariranno nell'elenco membri di Galette e l'ordine con il quale questi verranno visualizzati con un'interfaccia drag & drop. I diritti di accesso correlati possono essere impostati dalla configurazione dei campi del nucleo (vedere sotto).
uk: Ви можете вибрати, які поля будуть відображатися в списку членів Galette і в якому порядку вони будуть відображатися за допомогою інтерфейсу перетягування. Відповідні права доступу можуть бути встановлені з конфігурації основних полів (див. нижче).

source: Two fields are mandatory and cannot be moved: member number and name.
es: Dos campos son obligatorios y no se pueden mover: número de miembro y nombre.
fr_fr: Deux champs sont requis et ne peuvent être déplacés : le numéro de l'adhérent et le nom.
it: Due campi sono obbligatori e non possono essere spostati: numero e nome del membro.
uk: Два поля є обов'язковими та не можуть бути переміщені: номер члена й ім'я.

source: It is not possible to set access rights on id column, and parent will be accessible for staff members only.
es: No es posible establecer los permisos de acceso en la columna de identificador, y el nivel superior solo será accesible por el personal interno.
fr_fr: Il n'est pas possible de définir de droits d'accès sur la colonne id,et la colonne parent sera accessible aux seuls membres du staff.
it: Non è possibile impostare i diritti di accesso sulla colonna id, e il genitore sarà accessibile solo per i membri del personale.
uk: Неможливо встановити права доступу на ID стовпця, і батьківський стовпець буде доступний тільки для співробітників.

source: List fields management
es: Gestión de lista de campos
fr_fr: Gestion de la liste des champs
it: Gestione dei campi di lista
uk: Управління полями списків

source: Mandatory fields and access rights
es: Campos obligatorios y permisos de acceso
fr_fr: Champs obligatoires et droits d'accès
it: Campi obbligatori e diritti di accesso
uk: Обов'язкові поля та права доступу

source: When you create or edit a member, some fields are mandatory. Default configuration may not suit your needs, but you can configure some elements easily ;)
es: Cuando creas o editar un miembro, algunos campos son obligatorios. Quizá la configuración por defecto no se ajuste a tus necesidades, pero puedes configurar algunos elementos fácilmente ;)
fr_fr: Lorsque vous crééz ou modifiez un adhérent, certains champs sont requis. La configuration par défaut peut ne pas vous convenir, mais vous pouvez configurer certains éléments facilement ;)
it: Quando si crea o modifica un membro, alcuni campi sono obbligatori. La configurazione predefinita potrebbe non soddisfare le proprie esigenze, ma è facilmente possibile configurare alcuni elementi ;)
uk: Коли ви створюєте або редагуєте члена, деякі поля є обов’язковими. Типова конфігурація може не відповідати вашим потребам, але ви можете легко налаштувати деякі елементи ;)

source: From the `Configuration`, `Core fields` menu, you will get access to all fields available for members, and choose for each one if it is mandatory or not, as well as associated access rights:
es: Desde la `Configuration`, menú `Core fields` tendrás acceso a todos los campos disponibles para los miembros, y elegir para cada campo si es obligatorio o no, así como los permisos de acceso asociados:
fr_fr: Depuis le menu `Configuration`, `Champs du cœur`, vous aurez accès à tous les champs disponibles pour les adhérents, et choisir pour chacun d'entre eux s'il est requis ou non, ainsi que les droits qui y sont associés :
it: Dal menu `Configurazione`, `Campi nucleo`, si otterrà l'accesso a tutti i campi disponibili per i membri, e si potrà scegliere per ciascuno se renderlo obbligatorio oppure no, così come per i diritti di accesso associati:
uk: В меню `Конфігурація`, `Основні поля`, ви отримаєте доступ до всіх полів, доступним для членів, і зможете вибрати для кожного з них, чи є воно обов'язковим чи ні, а також відповідні права доступу:

source: `inaccessible` will make the field inaccessible for everyone,
es: `inaccessible` hará que el campo sea no accesible para todos,
fr_fr: `inaccessible` rendra le champ inaccessible à tous,
it: `inaccessibile` renderà il campo inaccessibile per tutti,
uk: `недоступність` (inaccessible) зробить поле недоступним для всіх,

source: `administrator` will make the field readable and writeable for administrators only,
es: `administrator` hará que el campo se pueda leer y escribir solo por los administradores,
fr_fr: `administrateur` rendra le champ accessible en lecture et écriture aux seuls administrateurs,
it: `amministratore` renderà il campo leggibile e scrivibile solo per gli amministratori,
uk: `адміністратор` (administrator) зробить поле доступним для читання і запису тільки для адміністраторів,

source: `staff members` will make the field readable and writable for staff members and administrators,
es: `staff members` hará que el campo se pueda leer y escribir por el personal interno y los administradores,
fr_fr: `membres du bureau` rendra le champ accessible en lecture et écriture aux membres du bureau ainsi qu'aux administrateurs,
it: `membri del personale` renderà il campo leggibile e scrivibile per i membri del personale e gli amministratori,
uk: `співробітники` (staff members) зробить поле доступним для читання і запису для співробітників та адміністраторів,

source: `groups managers` will make the field readable and writable for groups managers on the memebrs of groups they own, and for staff memebrs and administrators,
es: `groups managers` hará que el campo se pueda leer y escribir por los administradores de grupos en los miembros de los grupos que posean, y por el personal interno y los administradores,
fr_fr: `responsables de groupes` rendra le champ accessible en lecture et écriture aux responsables de groupes pour les adhérents des groupes qu'ils gèrent ainsi qu'aux membres du bureau et administrateurs,
it: `amministratori dei gruppi` renderà il campo leggibile e scrivibile per i gestori di gruppi per i membri dei gruppi che possiedono, e per i membri del personale e gli amministratori,
uk: `менеджери груп` (groups managers) зробить поле доступним для читання і запису менеджерам груп для членів груп, якими вони володіють, а також для співробітників та адміністраторів,

source: `read/write` will make the field readable and writeable for member, groups managers, staff members and administrators,
es: `read/write` hará que el campo se pueda leer y escribir por los miembros, administradores de grupos, personal interno y administradores,
fr_fr: `lecture/ecriture` rendra le champs rendra le champ accessible en lecture et écriture aux adhérents, responsables de groupes, membres du bureau et administrateurs,
it: `lettura/scrittura` renderà il campo leggibile e scrivibile per membri, amministratori dei gruppi, membri del personale e amministratori,
uk: `читання/запис` (read/write) зробить поле доступним для читання і запису для членів, менеджерів груп, співробітників та адміністраторів,

source: `read only` will make the field read only for the members, but writable for groups managers, staff members and administrators.
es: `read only` hará que el campo se pueda leer por los miembros, pero se pueda escribir por administradores de grupos, personal interno y administradores.
fr_fr: `lecture seule` rendra le champ accessible en lecture seule aux adhérents, mais en écriture aux responsables de groupes, membres du bureau et administrateurs.
it: `sola lettura` renderà il campo in sola lettura per i membri, ma scrivibile per i gestori di gruppi, membri del personale e amministratori.
uk: `тільки читання` (read only) зробить поле доступним для читання тільки для членів групи, але доступним для запису для менеджерів груп, співробітників та адміністраторів.

source: Core fields management
es: Gestión de campos principales
fr_fr: Gestion des champs du cœur
it: Gestione campi del nucleo
uk: Управління основними полями

source: Dynamic fields
es: Campos dinámicos
fr_fr: Champs dynamiques
it: Campi dinamici
uk: Динамічні поля

source: Galette comes per default with many fields for members, contributions and transactions. Some of them will be useless, but you may need fields that does not exists...
es: Galette viene por defecto con muchos campos para los miembros, contribuciones y transacciones. Algunos pueden no ser útiles, pero puedes necesitar campos que no existan...
fr_fr: Galette fournit par défaut beaucoup de champs pour les adhérents, contributeurs et transactions. Certains d'entre eux seront inutiles, mais vous pourriez avoir besoin de champs qui n'existent pas...
it: Galette è fornito come impostazione predefinita con molti campi per membri, contributi e transazioni. Alcuni saranno inutili, ma si potrebbe aver bisogno di altri campi...
uk: Типово Galette поставляється з великою кількістю полів для членів, внесків і переказів. Деякі з них будуть марні, але вам можуть знадобитися поля, яких не існує...

source: In this case, that is quite simple : just add a new dynamic field with a label, define if it is mandatory or not, and that's all : Galette will handle them automatically, just show the result ;)
es: En este caso, es muy sencillo : simplemente añade un campo dinámico con una etiqueta, defínelo como obligatorio o no, y ya está : Galette lo gestionará automáticamente, mira el resultado ;)
fr_fr: Dans ce cas, c'est assez simple : ajoutez juste un nouveau champ dynamique avec un nom, définissez s'il est requis ou non et c'est tout : Galette le gèrera automatiquement, admirez juste le résultat ;)
it: In questo caso è abbastanza semplice: basta aggiungere un nuovo campo dinamico con un'etichetta, definire se è obbligatorio o no, e questo è tutto: Galette li gestirà automaticamente, basterà mostrare il risultato ;)
uk: В цьому випадку це досить просто: лишень додайте нове динамічне поле з міткою, визначте, чи є воно обов'язковим чи ні, і все: Galette буде обробляти їх автоматично, просто покажіть результат ;)

source: There are several types of dynamic fields:
es: Hay varios tipos de campos dinámicos:
fr_fr: Il existe différents types de champs dynamiques :
it: Ci sono diversi tipi di campi dinamici:
uk: Існує кілька типів динамічних полів:

source: `separator`: just a label, like a part title,
es: `separator`: como una etiqueta, como una parte del título,
fr_fr: `séparateur` : juste une étiquette, comme un titre de section,
it: `separatore`: solo un'etichetta, come un titolo di parte,
uk: `роздільник` (separator): просто мітка, як назва частини,

source: `free text`: multiline text area,
es: `free text`: área de texto multilínea,
fr_fr: `texte libre` : zone de texte multi-ligne,
it: `testo libero`: area testo multilinea,
uk: `вільний текст` (free text): область багаторядкового тексту,

source: `single line`: one line text,
es: `single line`: una línea de texto,
fr_fr: `ligne simple` : une ligne de texte,
it: `riga singola`: testo su una sola riga,
uk: `один рядок` (single line): один рядок тексту,

source: `choice`: a dropdown list,
es: `choice`: una lista desplegable,
fr_fr: `choix` : une liste déroulante,
it: `scelta`: un elenco a discesa,
uk: `вибір` (choice): випадний список,

source: `date`: a date field with a selector,
es: `date`: un campo de fecha con un selector,
fr_fr: `date` : un champ date avec un sélecteur,
it: `data`: un campo data con un selettore,
uk: `дата` (date): поле дати з перемикачем,

source: `boolean`: a checkbox,
es: `boolean`: una casilla,
fr_fr: `booléen` : une case à cocher,
it: `booleano`: una casella di controllo,
uk: `булеан` (boolean): прапорець,

source: `file`: add files.
es: `file`: añadir archivos.
fr_fr: `fichier` : ajout de fichiers.
it: `file`: aggiunge file.
uk: `файл` (file): дадає файли.

source: Dynamic date fields used to be stored using logged-in user locale format; which causes issues trying to make searchs. Now, every date is stored using the `Y-m-d` format.
fr_fr: Les champs dynamiques de type date étaient stockés en utilisant le format de date localisé de l'utilisateur connecté ; ce qui causait des problèmes pour les recherches. Désormais, toute sles dates sont stockées en utilisant le format `Y-m-d`.
it: I campi data dinamici venivano memorizzati utilizzando il formato della data dell'utente registrato; il che causava problemi nel tentativo di effettuare ricerche. Ora, ogni data viene memorizzata utilizzando il formato `Y-m-d`.
uk: Динамічні поля дати раніше зберігалися у форматі локалі користувача, який увійшов у систему; що викликає проблеми під час пошуку. Тепер кожна дата зберігається у форматі `Y-m-d`.

source: If you were using dynamic date fields, you will have to :ref:`update your data using the related admin tool <admintools>` (⚠️ make sure to backup your database before! ⚠️).
fr_fr: Si vous utilisiez des champs dynamiques de type date vous devrez :ref:`mettre à jour vos données en utilisant l'outil d'administration relatif <admintools>` (⚠️ assurez-vous de sauvegarder votre base de données auparavant ! ⚠️).
it: Se si stava utilizzando campi data dinamici, si dovrà :ref:`aggiornare i propri dati usando lo strumento di amministrazione associato <admintools>` (⚠️ assicurarsi di eseguire prima il salvataggio del database! ⚠️).
uk: Якщо ви використовували динамічні поля дати, вам доведеться :ref:`update your data using the related admin tool <admintools>` (⚠️ перед тим обов’язково створіть резервну копію своєї бази даних! ⚠️).

source: While creating a new field (or editing an existing one); you also can:
es: Al crear un nuevo campo (o al editar uno ya existente); también puedes:
fr_fr: Lors de la création de nouveaux champs (ou la modification de champs existants) ; vous pourrez :
it: Durante la creazione di un nuovo campo (o la modifica di uno esistente); si può anche:
uk: Під час створення нового поля (або редагування наявного) ви також можете:

source: mark it as required,
es: marcarlo como obligatorio,
fr_fr: les marquer comme requis,
it: contrassegnarlo come richiesto,
uk: позначити його як обов'язкове,

source: define access rights, the same as for core fields,
es: definir los permisos de acceso, lo mismo que para los campos principales,
fr_fr: définir des droits d'accès, de la même manière que pour les champs du cœur,
it: definire i diritti di accesso, come per i campi principali,
uk: визначити права доступу, такі ж, як для основних полів,

source: add extra information to help users.
es: añadir información adicional para ayudar a los usuarios.
fr_fr: ajout d'informations supplémentaires pour aider les utilisateurs.
it: aggiungere informazioni extra per aiutare gli utenti.
uk: додайте дод. інформацію, щоб допомогти користувачам.

source: A dynamic field
es: Campo dinámico
fr_fr: Un champ dynamique
it: Un campo dinamico
uk: Динамічне поле

source: Some field types like separators, dates and booleans, does not need any extra information; for others:
es: Algunos tipos de campos como los separadores, fechas y booleanos, no necesitan información adicional; en cambio otros:
fr_fr: Certains champs comme les séparateurs, les dates et les booléens ne requièrent aucune information complémentaire ; pour les autres :
it: Alcuni tipi di campo, come separatori, date e valori booleani, non necessitano di informazioni aggiuntive; per altri:
uk: Деякі типи полів, такі як роздільники, дати та логічні значення (булеани), не потребують додаткових даних; інші ж:

source: `free text`:
fr_fr: `texte libre` :
it: `testo libero`:
uk: `вільний текст` (free text):

source: `width`: define number of columns,
es: `width`: define el número de columnas,
fr_fr: `largeur` : définit le nombre de colonnes,
it: `larghezza`: definisce il numero di colonne,
uk: `ширина` (width): визначає кількість стовпців,

source: `height`: define number of rows.
es: `height`: define el número de filas.
fr_fr: `hauteur` : définit le nombre de lignes.
it: `altezza`: definisce il numero di righe.
uk: `висота` (height): визначає кількість рядків.

source: `single line`:
fr_fr: `ligne simple` :
it: `riga singola`:
uk: `один рядок` (single line):

source: `width`: field width,
es: `width`: ancho del campo,
fr_fr: `largeur` : largeur du champ,
it: `larghezza`: campo larghezza,
uk: `ширина` (width): ширина поля,

source: `size`: number of characters,
es: `size`: número de caracteres,
fr_fr: `taille` : nombre de caractères,
it: `dimensione`: numero di caratteri,
uk: `розмір` (size): кількість символів,

source: `repeat`: number of possible ocurences.
es: `repeat`: número de posibles ocurrencias.
fr_fr: `répétition` : nombre d'occurrences possibles.
it: `ripeti`: numero di occorrenze possibili.
uk: `повтор` (repeat): кількість можливих подій.

source: `choice`:
fr_fr: `choix` :
it: `scelta`:
uk: `вибір` (choice):

source: `values`: possible values for the dropdown.
es: `values`: posibles valores para la lista desplegable.
fr_fr: `valeurs` : valeurs possibles pour la liste déroulante.
it: `valori`: valori possibili per il menu a discesa.
uk: `значення` (values): можливі значення для випадного списку.

source: `file`:
fr_fr: `fichier` :
uk: `файл` (file):

source: `size`: maximum file size, in Kio (this size is limited to the one for the PHP configuration).
es: `size`: tamaño máximo del archivo, en Kio (este tamaño está limitado por una de las configuraciones de PHP).
fr_fr: `taille` : taille maximale du fichier en Kio (cette taille est limitée à celle de la configuration de PHP).
it: `dimensione`: dimensione massima del file, in Kio (questa dimensione è limitata dalla configurazione PHP).
uk: `розмір` (size): максимальний розмір файлу в Kio (цей розмір обмежений розміром для конфігурації PHP).

source: Labels translation
es: Traducción de etiquetas
fr_fr: Traduction des étiquettes
it: Traduzione etichette
uk: Переклад етикеток

source: Galette handle several languages, but when you add a new dynamic field, there is only one value possible. Galette proposes an interface to translate those labels in each available language.
es: Galette gestiona varios idiomas, pero cuando añades un campo dinámico, sólo hay un valor posible. Galette presenta una interfaz para traducir esas etiquetas en cada idioma disponible.
fr_fr: Galette gère plusieurs langues, mais lorsque vous ajoutez un nouveau champ dynamique, il n'y a qu'une seule valeur possible. Galette propose une interface pour traduire ces étiquettes dans toutes les langues disponibles.
it: Galette gestisce diverse lingue, ma quando si aggiunge un nuovo campo dinamico, c'è un solo valore possibile. Galette propone un'interfaccia per tradurre quelle etichette in ogni lingua disponibile.
uk: Galette працює з кількома мовами, але коли ви додаєте нове динамічне поле, можливе тільки одне значення. Galette пропонує інтерфейс для перекладу цих міток на кожну доступну мову.

source: Note that each new label will be added with current Galette lang.
es: Ten en cuenta que cada nueva etiqueta se añadirá con el idioma actual de Galette.
fr_fr: Notez que chaque nouvelle étiquette sera ajoutée dans Galette avec la langue courante.
it: Si noti che ogni nuova etichetta verrà aggiunta con la lingua Galette corrente.
uk: Зверніть увагу, що кожна нова мітка буде додана до поточної мови Galette.

source: Emails contents
es: Contenidos de los correos electrónicos
fr_fr: Contenus des courriels
it: Contenuto email
uk: Вміст листів е-пошти

source: Depending on your configuration (see preferences), administrative emails cans be sent to users and/or administrators, when you add a new member or a new contribution, or from the lost password feature for example.
es: Dependiendo de tu configuración (ver ajustes), los correos electrónicos administrativos se pueden enviar a los usuarios y administradores, cuando añadas un nuevo miembro o una nueva contribución, o desde la recuperación de contraseña por ejemplo.
fr_fr: En fonction de votre configuration (voir les préférences), des courriels administratifs peuvent être envoyés aux utilisateurs et/ou administrateurs, lorsque vous ajoutez un nouvel adhérent ou une nouvelle contribution, ou encore pour la fonctionnalité mot de passe perdu, par exemple.
it: A seconda della configurazione (vedere preferenze), le e-mail amministrative possono essere inviate agli utenti e/o agli amministratori, ad esempio quando si aggiunge un nuovo membro o un nuovo contributo, oppure dalla funzionalità di password smarrita.
uk: Залежно від вашої конфігурації (див. Налаштування), адміністративні листи е-пошти можуть бути надіслані користувачам і/або адміністраторам, коли ви додаєте нового члена або новий внесок, або, наприклад, від функції втрати пароля.

source: Defaults are provided, but you can change them.
es: Se suministran por defecto, pero los puedes cambiar.
fr_fr: Des valeurs par défaut sont fournies, mais vous pouvez les changer.
it: Sono forniti valori predefiniti, ma è possibile modificarli.
uk: Типово вони додаються, але ви можете їх змінити.

source: It is important to note that those textes contain variables - of the ``{VARIABLE}`` form - that will be replaced automatically on sending. Be carefull to not forget any of those, that could cause sending issues.
es: Es importante que tengas en cuenta que esos textos contienen variables - del tipo ``{VARIABLE}`` - que serán reemplazadas automáticamente al enviarse. Ten cuidado de no olvidarte ninguna de ellas, ya que podría causar problemas.
fr_fr: Il est important de noter que ces textes contiennent des variables - sous la forme ``{VARIABLE}`` - qui seront automatiquement remplacées lors de l'envoi. Prenez garde à n'en oublier aucune, cela pourrait causer des problèmes à l'envoi.
it: È importante notare che quei testi contengono variabili - del tipo ``{VARIABILE}`` - che saranno sostituite automaticamente all'invio. Fare attenzione a non dimenticarne nessuna, perché potrebbe causare problemi di invio.
uk: Важливо відзначити, що ці тексти містять змінні - у формі ``{VARIABLE}`` - які будуть автоматично замінені під час надсилання. Будьте уважні, щоб не забути жодну з них, це може викликати проблеми з надсиланням.

source: Edit mail send to a new member in french
es: Editar el correo electrónico que se envía a un nuevo miembro en francés
fr_fr: Édition du courriel envoyé à un nouvel adhérent en français
it: Modifica la posta inviata a un nuovo membro in francese
uk: Змінити лист, надісланий новому учаснику французькою мовою

source: An email will be send to member when:
es: Se enviará un correo electrónico al miembro cuando:
fr_fr: Un courriel sera envoyé à l'adhérent lorsque :
it: Verrà inviata un'e-mail al membro quando:
uk: Учаснику буде надіслано лист е-пошти, якщо:
