Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/configuration.po
Languages: es, fr_fr, it, uk

source: he self subscribes. This mail contains authentication information,
es: se suscriba él mismo. Este correo electrónico contiene información de autenticación,
fr_fr: il s'inscrit. Ce courriel contient ses informations d'authentification,
it: si iscrive autonomamente. Questa mail contiene informazioni di autenticazione,
uk: він самостійно підписується. Цей лист містить відомості про автентифікацію,

source: his card is added or edited by someone else (if the corresponding box is checked),
es: se añada o edite su tarjeta por otra persona (si la casilla correspondiente está marcada),
fr_fr: sa fiche est modifiée par une tierce personne (si la case correspondante est cochée),
it: la sua carta viene aggiunta o modificata da qualcun altro (se la casella corrispondente è selezionata),
uk: його картка додана або відредагована кимось іншим (якщо встановлене відповідне поле),

source: he uses lost password feature,
es: utilice la función para recuperar la contraseña,
fr_fr: il utilise la fonctionnalité mot de passe perdu,
it: usa la funzione password smarrita,
uk: він використовує функцію "забув пароль",

source: a new contribution is attache to his account (if the corresponding box is checked).
es: se adjunte una nueva contribución a su cuenta (si la casilla correspondiente está marcada).
fr_fr: une nouvelle contribution est attachée à son compte (si la case correspondante est cochée).
it: un nuovo contributo viene allegato al suo account (se la casella corrispondente è selezionata).
uk: новий внесок долучається до його облікового запису (якщо відповідний прапорець встановлений).

source: An email will be send to administrators when:
es: Se enviará un correo electrónico a los administradores cuando:
fr_fr: Un courriel sera envoyé aux administrateurs lorsque :
it: Verrà inviata un'e-mail agli amministratori quando:
uk: Лист е-пошти буде надіслано адміністраторам, коли:

source: a new member is added or self subscribes,
es: se añada un miembro o se suscriba por sí mismo,
fr_fr: un nouvel adhérent est ajouté ou s'inscrit,
it: un nuovo membro viene aggiunto o si auto-iscrive,
uk: додається або самостійно підписується новий член,

source: a new contribution is attached to his account.
es: se adjunte una nueva contribución a su cuenta.
fr_fr: une nouvelle contribution est attachée à son compte.
it: un nuovo contributo è allegato al suo account.
uk: до його облікового запису додається новий внесок.

source: Of course, emails will be sent ony if Galette configuration allows it (and the setup is correct). Sending messages to administrators is configured globally from the preferences, while sending emails to members is conditionned on a checkbox from the user interface, excepting for self subscription messages that will always be send.
es: Por supuesto, los correos electrónicos serán enviados solo si la configuración de Galette lo permite (y esté correctamente configurado). Enviar mensajes a los administradores se configura de manera global desde los ajustes, mientras que el envío de correos electrónicos a los miembros depende de una casilla desde la interfaz del usuario, excepto para los mensajes de suscripción propia, que siempre se envían.
fr_fr: Bien entendu, les courriels ne seront envoyés que si la configuration de Galette l'autorise (et que la configuration est correcte). L'envoi de message aux administrateurs est configuré globalement dans les préférences, alors que l'envoi de courriels aux adhérents est conditionné par une case à cocher dans l'interface utilisateur, sauf pour les messages de souscription par l'utilisateur qui seront toujours envoyés.
it: Naturalmente, le email saranno inviate solo se la configurazione di Galette lo consente (e se l'impostazione è corretta). L'invio di messaggi agli amministratori è configurato globalmente dalle preferenze, mentre l'invio di email ai membri è condizionato da una casella di controllo dall'interfaccia utente, fatta eccezione per i messaggi di autoiscrizione che saranno sempre inviati.
uk: Звичайно, електронні листи будуть надсилатися тільки в тому випадку, якщо конфігурація Galette дозволяє це (і налаштування правильне). надсилання повідомлень адміністраторам налаштовується глобально в налаштуваннях, в той час, як надсилання листів членам керується прапорцем в інтерфейсі, за винятком повідомлень самопідписання, які будуть надсилатися завжди.

source: Several variables - automatically replaced on sending - are available for both subject and contents. Some of them may be used in all messages, but others will be only on some conditions. Refer to the inline help on Galette interface to know more.
es: Algunas variables - reemplazadas automáticamente al enviar - están disponibles tanto para el asunto como para el contenido. Algunas de ellas pueden estar en uso en todos los mensajes, pero otras solo bajo algunas condiciones. Para saber más, consulta la ayuda en línea en la interfaz de Galette.
fr_fr: Plusieurs variables - remplacées automatiquement lors de l'envoi - sont disponible pour le sujet ainsi que le contenu. Certaines peuvent être utilisées dans tous les messages, mais d'autres ne sont accessibles que dans certaines conditions. Référez-vous à l'aide en ligne depuis l'interface de Galette pour en savoir plus.
it: Diverse variabili, sostituite automaticamente all'invio, sono disponibili sia per l'oggetto che per il contenuto. Alcune di esse possono essere utilizzate in tutti i messaggi, ma altre lo saranno solo in determinate condizioni. Per saperne di più, fare riferimento alla guida in linea sull'interfaccia di Galette.
uk: Як для теми, так і для вмісту доступні кілька змінних - автоматично замінюваних під час надсилання. Деякі з них можуть використовуватися у всіх повідомленнях, але інші - тільки за деяких умов. Для отримання додаткових відомостей зверніться до вбудованої довідки з інтерфейсу Galette.
