Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/contributions.po
Languages: es, fr_fr, ta

source: Contributions management
es: Gestión de contribuciones
fr_fr: Gestion des contributions
ta: பங்களிப்பு மேலாண்மை

source: Galette allows you to manage contributions sent from your members. There are several types of contributions, and transactions are also proposed.
es: Galette te permite gestionar las contribuciones enviadas por tus miembros. Hay varios tipos de contribuciones, y también se proponen transacciones.
fr_fr: Galette vous permet de gérer les contributions envoyées par vos adhérents. Il y a différents types de contributions, et des transactions sont aussi proposées.
ta: உங்கள் உறுப்பினர்களிடமிருந்து அனுப்பப்பட்ட பங்களிப்புகளை நிர்வகிக்க கலெட் உங்களை அனுமதிக்கிறது. பல வகையான பங்களிப்புகள் உள்ளன, மேலும் பரிவர்த்தனைகளும் முன்மொழியப்பட்டுள்ளன.

source: A transaction? What's that? Well, a simple example is better than a long text... We will use three members of a same association: Marc, Julie and Zac. Each one is member, independently of which group or else they are affected to, that does not matters.
es: ¿Una transacción? ¿Qué es eso? Bueno, un ejemplo sencillo es mejor que una parrafada... Utilizaremos tres miembros de la misma organización: Marc, Julie y Zac. Cada uno es miembro, independientemente de que grupo al que pertenezca, eso no importa.
fr_fr: Une transaction ? Qu'est ce que c'est ? Et bien, un petit exemple simple vaut mieux qu'un long discours... Nous utiliserons trois adhérents d'une même association : Marc, Julie et Zac. Chacun est adhérent, indépendamment des groupes ou autres auquel il peut être affecté, ça n'a aucune importance.
ta: ஒரு பரிவர்த்தனை? அது என்ன? சரி, ஒரு நீண்ட உரையை விட ஒரு எளிய எடுத்துக்காட்டு சிறந்தது ... அதே சங்கத்தின் மூன்று உறுப்பினர்களை நாங்கள் பயன்படுத்துவோம்: மார்க், சூலி மற்றும் சாக். ஒவ்வொன்றும் உறுப்பினர், எந்தக் குழுவிலிருந்து சுயாதீனமாக, இல்லையெனில் அவை பாதிக்கப்படுகின்றன, அது முக்கியமல்ல.

source: Zac send you a check to pay his own membership, Marc and Julie ones and also a donation to the association. In this case, Zac's check will be handled in a transaction attached to his account, and which will be distributed in four contributions, each one attached to corresponding member.
es: Zac te envía un cheque para pagar su propia afiliación, las de Marc y Julie, y también una donación a la organización. En este caso, el cheque de Zac se gestionará en una transacción vinculada a su cuenta, y que será distribuida en cuatro contribuciones, cada una asociada al miembro correspondiente.
fr_fr: Zac vous envoie un chèque pour payer sa propre cotisation, celles de Marc et Julie, et aussi un don à l'association. Dans ce cas, le chèque de Zac sera géré dans une transaction attachée à son compte, et qui sera ventilée en quatre contributions, chacune attachée à son propre adhérent.
ta: சாக் தனது சொந்த உறுப்பினர், மார்க் மற்றும் சூலி ஆகியோரை செலுத்தவும், சங்கத்திற்கு நன்கொடை வழங்கவும் ஒரு காசோலையை உங்களுக்கு அனுப்புகிறார். இந்த வழக்கில், ZAC இன் காசோலை அவரது கணக்கில் இணைக்கப்பட்ட ஒரு பரிவர்த்தனையில் கையாளப்படும், மேலும் இது நான்கு பங்களிப்புகளில் விநியோகிக்கப்படும், ஒவ்வொன்றும் தொடர்புடைய உறுப்பினருடன் இணைக்கப்பட்டுள்ளன.

source: Another example: Pierre pays his own contribution, his transaction will only contains his membership and will be distributed in only one contribution.
es: Otro ejemplo: Pierre paga su propia contribución, su transacción solo contendrá su afiliación y se distribuirá en una sola contribución.
fr_fr: Un autre exemple : Pierre paie sa propre contribution, sa transaction ne contiendrai que son adhésion, et serait ventilée en une seule contribution.
ta: மற்றொரு எடுத்துக்காட்டு: பியர் தனது சொந்த பங்களிப்பை செலுத்துகிறார், அவரது பரிவர்த்தனை அவரது உறுப்பினர்களைக் கொண்டிருக்கும், மேலும் ஒரே ஒரு பங்களிப்பில் மட்டுமே விநியோகிக்கப்படும்.

source: If Pierre, Zac, Julie or Marc are late, you can send them a :ref:`reminder <reminders>` :p
es: Si Pierre, Zac, Julie o Marc se retrasan, puedes enviarles un :ref:`recordatorio <reminders>` :p
fr_fr: Si, Pierre, Zac, Julie ou Marc sont en retard, vous pouvez leur envoyer une :ref:`rappel <reminders>` :p
ta: பியர், சாக், சூலி அல்லது மார்க் தாமதமாகிவிட்டால், நீங்கள் அவர்களுக்கு அனுப்பலாம்: குறிப்பு: `நினைவூட்டல் <நினைவூட்டல்கள்>`: பி

source: Contributions
es: Contribuciones
ta: பங்களிப்புகள்

source: A contribution can be a membership, a donation, a gift, ... Galette allows you to store all of that for each member.
es: Una colaboración puede ser una afiliación, una donación, un regalo, ... Galette le permite almacenar todo eso para cada miembro.
fr_fr: Une contribution peut être une adhésion, un don, un cadeau, ... Galette vous permet de stocker tout cela pour chaque adhérent.
ta: ஒரு பங்களிப்பு ஒரு உறுப்பினர், நன்கொடை, பரிசு, ... ஒவ்வொரு உறுப்பினருக்கும் அதையெல்லாம் சேமிக்க கேலட் உங்களை அனுமதிக்கிறது.

source: Contributions types
es: Tipos de contribución
fr_fr: Types de contribution
ta: பங்களிப்பு வகைகள்

source: Contributions are entirely configurable. There are two main types of contributions in Galette:
es: Las contribuciones son totalmente configurables. Hay dos tipos de contribuciones en Galette:
fr_fr: Les contributions sont entièrement paramétrables. Il y a deux principaux types de contributions dans Galette :
ta: பங்களிப்புகள் முற்றிலும் கட்டமைக்கக்கூடியவை. கேலட்டில் இரண்டு முக்கிய வகை பங்களிப்புகள் உள்ளன:

source: the ones that extends a membership (a montly or yearly membership for example),
es: los que amplían la afiliación (por ejemplo: mensual o anual),
fr_fr: celles qui donnent lieu à une extension de l'adhésion (un renouvellement mensuel ou annuel d'adhésion par exemple),
ta: எடுத்துக்காட்டாக மாதாந்திர அல்லது வருடாந்திர உறுப்பினர் உறுப்பினரை நீட்டிக்கும்),,

source: the ones that do not extends membership, like donations.
es: las que no amplían la afiliación, como las donaciones.
fr_fr: celles qui ne donnent pas lieu à une extension de l'adhésion, comme les dons.
ta: நன்கொடைகள் போன்ற உறுப்பினர் எண்ணிக்கை இல்லை.

source: Contribution types management allows you to define a label, and if it extends the memebrship or not.
es: La gestión de los tipos de contribución te permite definir una etiqueta, y si extiende la afiliación o no.
fr_fr: La gestion des types de contribution vous permet de définir un nom et si elle donne lieu à une extension de l'adhésion ou non.
ta: பங்களிப்பு வகைகள் மேலாண்மை ஒரு லேபிளை வரையறுக்க உங்களை அனுமதிக்கிறது, மேலும் அது உறுப்பினர் நீட்டித்தாலும் இல்லாவிட்டாலும்.

source: Reminders
es: Recordatorios
fr_fr: Rappels
ta: நினைவூட்டல்கள்

source: Emails models to remind due dates are available from the emails contents ("Impending due date" and "Late due date").
es: Los modelos de correo electrónico para recordar el vencimiento del plazo están disponibles desde los contenidos de los correos electrónicos ("Fecha de vencimiento inminente" y "Fecha de vencimiento tardía").
fr_fr: Des modèles de courriels pour rappeler les dates d'échéances sont disponibles dans les contenus des courriels ("Échéances proches" et "Échéances dépassées").
ta: உரிய தேதிகளை நினைவூட்டுவதற்கான மின்னஞ்சல்கள் மாதிரிகள் மின்னஞ்சல்களின் உள்ளடக்கங்களிலிருந்து ("வரவிருக்கும் தேதி" மற்றும் "தாமதமான தேதி") கிடைக்கின்றன.

source: The reminder button from the dashboard or the reminders entry of the menu will give you access to the reminders management interface.
es: El botón de recordatorio desde el panel de control o la entrada de recordatorios del menú te dará acceso a la interfaz de gestión de recordatorios.
fr_fr: Le bouton rappel du tableau de bord ou l'entrée rappels du menu configuration vous donnent accès à l'interface de gestion des rappels.
ta: டாச்போர்டில் இருந்து நினைவூட்டல் பொத்தானை அல்லது மெனுவின் நினைவூட்டல் நுழைவு நினைவூட்டல் மேலாண்மை இடைமுகத்திற்கான அணுகலை உங்களுக்கு வழங்கும்.

source: Reminders management interface
es: Interfaz de gestión de recordatorios
fr_fr: Interface de gestion des rappels
ta: நினைவூட்டல்கள் மேலாண்மை இடைமுகம்

source: Two categories can be selected:
es: Se pueden seleccionar dos categorías:
fr_fr: Deux catégories peuvent être sélectionnées :
ta: இரண்டு வகைகளைத் தேர்ந்தெடுக்கலாம்:

source: members whose due date is close,
es: miembros cuya fecha de vencimiento esté cercana,
fr_fr: las adhérents dont la date d'échéance est proche,
ta: உரிய தேதி நெருக்கமாக இருக்கும் உறுப்பினர்கள்,

source: members whose due date is in the past.
es: miembros cuya fecha de vencimiento haya pasado.
fr_fr: les adhérents dont la date d'échéance est passée.
ta: கடந்த காலங்களில் உரிய தேதி இருந்த உறுப்பினர்கள்.

source: Per default (this is currently not configurable), reminders are sent one month, then seven days before the due date; and then one and two months after the due date expiration. Reminders are stored in the database, if you never sent any reminder, all matching members will be reminded.
es: Por defecto (de momento no puede configurarse), los recordatorios se envían un mes, después siete días antes de la fecha de vencimiento; y después uno y dos meses tras pasar la fecha de vencimiento. Los recordatorios se guardan en la base de datos, si nunca has enviado ningún recordatorio, se recordará a todos los miembros que coincidan.
fr_fr: Par défaut (ce n'est actuellement pas configurable), les rappels sont envoyés un mois, puis sept jours avant la date d'échéance ; et ensuite un puis deux mois après l'expiration de la date d'échéance. Les rappels sont stockés dans la base de données, si vous n'en avez encore envoyé aucun, tous les membres correspondants auront un rappel.
ta: இயல்புநிலைக்கு (இது தற்போது கட்டமைக்கப்படவில்லை), நினைவூட்டல்கள் ஒரு மாதம், பின்னர் சரியான தேதிக்கு ஏழு நாட்களுக்கு முன்னர் அனுப்பப்படுகின்றன; பின்னர் தேதி காலாவதியாகும் ஒன்று மற்றும் இரண்டு மாதங்களுக்குப் பிறகு. நினைவூட்டல்கள் தரவுத்தளத்தில் சேமிக்கப்படுகின்றன, நீங்கள் ஒருபோதும் எந்த நினைவூட்டலையும் அனுப்பவில்லை என்றால், பொருந்தக்கூடிய அனைத்து உறுப்பினர்களும் நினைவூட்டப்படுவார்கள்.

source: Galette will tell you if some members do not have an email address, you can print labels for those ones.
es: Galette te avisará si algunos miembros no tienen dirección de correo electrónico, podrás imprimir etiquetas para ellos.
fr_fr: Galette vous dira si certains adhérents n'ont pas d'adresse de courriel, vous pourrez imprimer des étiquettes pour ces derniers.
ta: சில உறுப்பினர்களுக்கு மின்னஞ்சல் முகவரி இல்லையென்றால், அவற்றுக்கான லேபிள்களை அச்சிடலாம்.

source: Finally, it is possible to automate reminders with a cron task which will call the ``galette/reminder.php`` file. If you want reminders to be sent every day at 8:30 AM, then you can add a ``/etc/cron.d/galette`` file (on Fedora and similar, look at your system documentation to know how to add a crontab) with the following content:
es: Finalmente, es posible automatizar los recordatorios con una tarea cron que llamará al archivo ``galette/reminder.php``. Si quieres que los recordatorios se envíen cada dia a las 8:30 AM, entonces puedes añadir un archivo ``/etc/cron.d/galette`` (en Fedora y similares, consulta la documentación de tu sistema para saber como añadir un crontab) con el siguiente contenido:
fr_fr: Enfin, il est possible d'automatiser l'envoi des rappels avec une tâche cron qui appellera le fichier ``galette/reminder.php``. Si vous voulez que les rappels soient envoyés chaque jour à 8h30, alors ajoutez une fichier ``/etc/cron.d/galette`` (sur Fedora et assimilés, référez-vous à la documentation de votre système sur la manière de mettre en place une tâche cron) avec le contenu suivant :
ta: இறுதியாக, ஒரு CRON பணியுடன் நினைவூட்டல்களை தானியக்கமாக்குவது சாத்தியமாகும், இது `` கேலட்/நினைவூட்டல்.பிபி`` கோப்பை அழைக்கும். ஒவ்வொரு நாளும் காலை 8:30 மணிக்கு நினைவூட்டல்களை அனுப்ப விரும்பினால், நீங்கள் ஒரு ``/etc/cron.d/கேலட்`` கோப்பைச் சேர்க்கலாம் (ஃபெடோரா மற்றும் அதற்கு ஒத்ததாக, உங்கள் கணினி ஆவணங்களைப் பாருங்கள் a எவ்வாறு சேர்ப்பது என்பதை அறிய CRONTAB) பின்வரும் உள்ளடக்கத்துடன்:

source: Invoices and receipts
es: Facturas y recibos
fr_fr: Factures et reçus
ta: விலைப்பட்டியல் மற்றும் ரசீதுகள்

source: In the contributions list, there is a PDF icon which is designed to generate invoice ou receipt for one contribution.
es: En la lista de contribuciones, hay un icono PDF que está diseñado para generar facturas o recibos por cada contribución.
fr_fr: Dans la liste des contributions, il y a une icône PDF qui fournit une facture ou un reçu pour une contribution.
ta: பங்களிப்பு பட்டியலில், ஒரு PDF படவுரு உள்ளது, இது ஒரு பங்களிப்புக்காக விலைப்பட்டியல் OU ரசீதை உருவாக்க வடிவமைக்கப்பட்டுள்ளது.

source: You can customize the PDF using :ref:`PDF models <pdf_models>`.
es: Puedes personalizar el PDF utilizando los :ref:`modelos PDF <pdf_models>`.
fr_fr: Vous pouvez personnaliser le PDF en utilisant :ref:`les modèles PDF <pdf_models>`.
ta: நீங்கள் PDF ஐப் பயன்படுத்தி தனிப்பயனாக்கலாம்: ref: `PDF மாதிரிகள் <pdf_models>`.

source: Scheduled payments
es: Pagos programados
fr_fr: Paiements planifiés
ta: திட்டமிடப்பட்ட கொடுப்பனவுகள்

source: It is possible to dispatch a contribution among one or several scheduled payments. All you have to do is to select "Scheduled payment" as payment type in your contribution; Galette will propose you to create an attached scheduled payment.
es: Es posible enviar una contribución junto con uno o varios pagos programados. Todo lo que tienes que hacer es seleccionar "Pago programado" como tipo de pago en tu contribución; Galette te propondrá crear un pago programado adjunto.
fr_fr: Il est possible de ventiler une contribution entre un ou plusieurs paiements planifiés. Tout ce que vous avez à faire est de sélectionner « Paiement échelonné » comme type de paiement dans votre contribution ; Galette vous proposera de créer un paiement planifié.
ta: ஒன்று அல்லது பல திட்டமிடப்பட்ட கொடுப்பனவுகளில் பங்களிப்பை அனுப்ப முடியும். நீங்கள் செய்ய வேண்டியதெல்லாம், உங்கள் பங்களிப்பில் கட்டண வகையாக "திட்டமிடப்பட்ட கட்டணம்" என்பதைத் தேர்ந்தெடுப்பதுதான்; இணைக்கப்பட்ட திட்டமிடப்பட்ட கட்டணத்தை உருவாக்க கேலட் உங்களை முன்மொழியும்.

source: Add scheduled payment to a contribution
es: Añadir un pago programado a la contribución
fr_fr: Ajouter un paiement planifié à une contribution
ta: பங்களிப்புக்கு திட்டமிடப்பட்ட கட்டணத்தைச் சேர்க்கவும்

source: By default, the entire remaining amount will be set into scheduled payment, but you can enter whatever you want. You can also select any payment type (except scheduled payment).
es: Por defecto, la totalidad del importe restante se establecerá en el pago programado, pero puedes introducir la que tú quieras. También puedes seleccionar cualquier tipo de pago (excepto pago programado).
fr_fr: Par défaut, le montant total restant sera défini sur le paiement planifié, mais vous pouvez entrer ce que vous voulez. Vous pouvez également sélectionner tout type de paiement (sauf le paiement planifié).
ta: இயல்பாக, மீதமுள்ள முழு தொகையும் திட்டமிடப்பட்ட கட்டணமாக அமைக்கப்படும், ஆனால் நீங்கள் விரும்பியதை உள்ளிடலாம். நீங்கள் எந்த கட்டண வகையையும் தேர்ந்தெடுக்கலாம் (திட்டமிடப்பட்ட கட்டணம் தவிர).

source: When you edit a contribution that already has attached scheduled payments, you can see a summary, and you can also see list of entries.
es: Cuando editas una contribución que ya tiene pagos programados adjuntos, puedes ver un resumen y ver una lista de entradas.
fr_fr: Lorsque vous modifiez une contribution qui a déjà des paiements planifiés attachés, vous pouvez voir un résumé, et vous pouvez aussi voir la liste des entrées.
ta: ஏற்கனவே திட்டமிடப்பட்ட கொடுப்பனவுகளை இணைத்துள்ள பங்களிப்பை நீங்கள் திருத்தும்போது, நீங்கள் ஒரு சுருக்கத்தைக் காணலாம், மேலும் உள்ளீடுகளின் பட்டியலையும் நீங்கள் காணலாம்.

source: Summary of scheduled payments
es: Resumen de pagos programados
fr_fr: Récapitulatif des paiements planifiés
ta: திட்டமிடப்பட்ட கொடுப்பனவுகளின் சுருக்கம்

source: List of attached scheduled payments
es: Lista de pagos programados adjuntos
fr_fr: Liste des paiements planifiés attachés
ta: இணைக்கப்பட்ட திட்டமிடப்பட்ட கொடுப்பனவுகளின் பட்டியல்

source: Transactions
es: Transacciones
ta: பரிவர்த்தனைகள்

source: As seen in the example from this chapter introduction, a transaction is a global payment for a member.
es: Como pudiste ver en el ejemplo de este capítulo de introducción, una transacción es un pago global para un miembro.
fr_fr: Comme vu dans l'exemple en introduction, une transaction est un système de paiement global pour un adhérent.
ta: இந்த அத்தியாய அறிமுகத்திலிருந்து எடுத்துக்காட்டில் காணப்படுவது போல, ஒரு பரிவர்த்தனை என்பது ஒரு உறுப்பினருக்கான உலகளாவிய கட்டணமாகும்.

source: Only a few information are required to add a new transaction:
es: Para añadir una nueva transacción solo se necesitan unos pocos datos:
fr_fr: Seules quelques informations sont nécessaires à l'ajout d'une nouvelle transaction :
ta: புதிய பரிவர்த்தனையைச் சேர்க்க சில தகவல்கள் மட்டுமே தேவை:

source: a description,
es: una descripción,
fr_fr: une description,
ta: ஒரு விளக்கம்,

source: the originator,
es: el autor,
fr_fr: l'émetteur,
ta: தோற்றுவிப்பவர்,

source: the date (current date per default),
es: la fecha (la fecha actual por defecto),
fr_fr: la date (date courante par défaut),
ta: தேதி (இயல்புநிலைக்கு தற்போதைய தேதி),

source: the amount.
es: la cantidad.
fr_fr: le montant.
ta: தொகை.

source: Transactions list
es: Lista de transacciones
fr_fr: Liste des transactions
ta: பரிவர்த்தனை பட்டியல்

source: Each transaction is dispatched among contributions, in the limit of the transaction amount. A transaction has itself no effect on members due dates.
es: Cada transacción se envía junto con las contribuciones, en el límite del importe de la transacción. Una transacción por sí misma no afecta a las fechas de vencimiento de los miembros.
fr_fr: Chaque transaction est ventilée entre différentes contributions, dans la limite du montant de la transaction. Une transaction n'a en elle même aucun effet sur les dates d'échéances des adhérents.
ta: ஒவ்வொரு பரிவர்த்தனையும் பரிவர்த்தனை தொகையின் வரம்பில், பங்களிப்புகளிடையே அனுப்பப்படுகிறது. ஒரு பரிவர்த்தனை உறுப்பினர்களின் உரிய தேதிகளில் எந்த விளைவையும் ஏற்படுத்தாது.

source: Add a transaction
es: Añadir una transacción
fr_fr: Ajouter une transaction
ta: ஒரு பரிவர்த்தனை சேர்க்கவும்

source: After adding a new transaction, you will be redirected to a new contribution creation. If this new contribution does not dispatch the remaning amount of the transaction, galette will propose you to create another one. Per default, the amount of a new contribution from a transaction will be the remaning amount of the transaction.
es: Tras añadir una nueva transacción, serás redirigido a la creación de una nueva contribución. Si esta no envía el importe restante de la transacción, galette te propondrá crear una nueva. Por defecto, el importe de una nueva contribución de una transacción será el importe restante de la transacción.
fr_fr: Après l'ajout d'une nouvelle transaction, vous serez redirigé vers la création d'une nouvelle contribution. Si cette dernière ne ventile pas le montant total de la transaction, Galette vous proposera d'en créer une autre. Par défaut, le montant d'une nouvelle contribution depuis une transaction sera le montant non encore ventilé de la transaction.
ta: ஒரு புதிய பரிவர்த்தனையைச் சேர்த்த பிறகு, நீங்கள் ஒரு புதிய பங்களிப்பு உருவாக்கத்திற்கு திருப்பி விடப்படுவீர்கள். இந்த புதிய பங்களிப்பு பரிவர்த்தனையின் மீளக்கூடிய தொகையை அனுப்பவில்லை என்றால், இன்னொன்றை உருவாக்க கேலட் உங்களை முன்மொழியும். இயல்புநிலைக்கு, ஒரு பரிவர்த்தனையிலிருந்து புதிய பங்களிப்பின் அளவு பரிவர்த்தனையின் மீளக்கூடிய அளவாகும்.

source: Add a contribution linked to a partially dispatched transaction
es: Añadir una contribución enlazada a un transacción parcialmente enviada
fr_fr: Ajouter une contribution liée à une transaction partiellement dispatchée
ta: ஓரளவு அனுப்பப்பட்ட பரிவர்த்தனையுடன் இணைக்கப்பட்ட பங்களிப்பைச் சேர்க்கவும்

source: Of course, it is also possible to edit a transaction:
es: Por supuesto, también es posible editar una transacción:
fr_fr: Bien sûr, il est également possible de modifier une transaction :
ta: நிச்சயமாக, ஒரு பரிவர்த்தனையைத் திருத்தவும் முடியும்:

source: Transaction edition
es: Edición de transacciones
fr_fr: Édition d'une transaction
ta: பரிவர்த்தனை பதிப்பு

source: You can also attach an existing contribution instead of creating a new one.
es: También puedes adjuntar una contribución existente en vez de crear una nueva.
fr_fr: Vous pouvez aussi attacher des contributions existantes au lieu d'en créer de nouvelles.
ta: புதிய ஒன்றை உருவாக்குவதற்கு பதிலாக ஏற்கனவே இருக்கும் பங்களிப்பையும் இணைக்கலாம்.

source: Add an already existing contribution to a transaction
es: Añadir una contribución existente a una transacción
fr_fr: Ajouter une contribution existante à une transaction
ta: ஒரு பரிவர்த்தனைக்கு ஏற்கனவே இருக்கும் பங்களிப்பைச் சேர்க்கவும்

source: Members selection
es: Selección de miembros
fr_fr: Sélection d’adhérents
ta: உறுப்பினர்கள் தேர்வு

source: The dropdown list to choose a member is available from contributions and transactions (as well as from several plugins) displays only a few members, for performances reasons.
es: La lista desplegable para elegir un miembro está disponible para las pantallas de contribuciones y transacciones (así como para varios complementos) solo para unos pocos miembros, por motivos de rendimiento.
fr_fr: La liste déroulante pour choisir un adhérent qui est disponible dans les contributions et les transactions (ainsi que dans certains plugins) n'affiche que quelques adhérents, pour des raisons de performances.
ta: ஒரு உறுப்பினரைத் தேர்ந்தெடுப்பதற்கான கீழ்தோன்றும் பட்டியல் பங்களிப்புகள் மற்றும் பரிவர்த்தனைகளிலிருந்து கிடைக்கிறது (அதே போல் பல செருகுநிரல்களிலிருந்தும்) செயல்திறன் காரணங்களுக்காக ஒரு சில உறுப்பினர்களை மட்டுமே காண்பிக்கும்.

source: Dropdown members list
es: Lista desplegable de miembros
fr_fr: Liste déroulante des adhérents
ta: கீழ்தோன்றும் உறுப்பினர்கள் பட்டியல்

source: You can display more members using arrow buttons or entering any text (this will search in first name, last name and identifiers).
es: Puedes mostrar más miembros utilizando los botones o introduciendo cualquier texto (esto buscará por el nombre, apellido e identificadores).
fr_fr: Vous pouvez en afficher davantage en utilisant les boutons flèches ou en entrant n'importe quel texte (la recherche sera effectuée dans les nom, prénom et identifiant).
ta: அம்பு பொத்தான்களைப் பயன்படுத்தி அல்லது எந்த உரையையும் உள்ளிடவும் அதிகமான உறுப்பினர்களைக் காண்பிக்கலாம் (இது முதல் பெயர், கடைசி பெயர் மற்றும் அடையாளங்காட்டிகளைத் தேடும்).
