Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/documents.po
Languages: es, fr_fr, it, ru, uk

source: Documents
es: Documentos
it: Documenti
ru: Документы
uk: Документи

source: You can store and share administrative documents from Galette, like statuses, meeting minutes, and so on.
es: Puede almacenar y compartir documentos administrativos desde Galette, como estatutos, actas de reuniones, etc.
fr_fr: Vous pouvez stocker et partager des documents administratifs de Galette, tels que les statuts, comptes rendus de réunion, etc.
it: È possibile memorizzare e condividere documenti amministrativi da Galette, come stati, minute di riunione, e così via.
ru: Вы можете хранить и делиться административными документами из Galette, такими как статусы, протоколы совещаний и т. д.
uk: Ви можете зберігати та ділитися адміністративними документами з Galette, як-от статуси, протоколи зустрічей тощо.

source: Documents list
es: Lista de documentos
fr_fr: Liste des documents
it: Elenco documenti
ru: Список документов
uk: Список документів

source: This is dispatched in two parts:
es: Esto se envía en dos partes:
fr_fr: Ceci est séparé en deux parties :
it: Questo viene inviato in due parti:
ru: Он рассылается в двух частях:
uk: Це відправляється двома частинами:

source: **Documents management**: where you can add, edit, and delete documents - available from Management, Documents menu;
es: ** Gestión de documentos**: donde puede añadir, editar y eliminar documentos - disponibles en el menú Gestión, Documentos;
fr_fr: ** Gestion des documents** : où vous pouvez ajouter, modifier et supprimer des documents - disponible depuis le menu Gestion, Documents ;
it: ** Gestione documenti**: dove è possibile aggiungere, modificare ed eliminare i documenti - disponibile dal menu Gestione, Documenti;
ru: **Управление документами**: здесь вы можете добавлять, редактировать и удалять документы - доступно из меню Управление, Документы;
uk: **Керування документами**: де ви можете додавати, редагувати та видаляти документи – доступно в меню «Керування», «Документи»;

source: **Public list**: where documents can be seen - available from Public pages, Documents menu.
es: ** Lista pública**: donde se pueden ver los documentos - disponibles en páginas públicas, menú Documentos.
fr_fr: ** Liste publique** : où les documents peuvent être vus - disponible à partir du menu Pages publiques, Documents.
it: ** Elenco pubblico**: dove i documenti possono essere visti - disponibile dal menu Pagine pubbliche, Documenti.
ru: **Публичный список**: где можно увидеть документы - доступен на Публичных страницах, меню Документы.
uk: **Публічний список**: де можна переглянути документи - доступно на Публічних сторінках, меню Документи.

source: Management
es: Gestión
fr_fr: Gestion
it: Gestione
ru: Управление
uk: управління

source: Documents management list
es: Lista de gestión de documentos
fr_fr: Gestion de la liste des documents
it: Elenco documenti di gestione
ru: Список управления документами
uk: Список управління документами

source: Add a document
es: Añadir un documento
fr_fr: Ajouter un document
it: Aggiungi documento
ru: Добавить документ
uk: Додайте документ

source: When creating or editing a document, you will of course choose a file to upload, a document type and a permission.
es: Al crear o editar un documento, por supuesto, elegirá el archivo que desea cargar, el tipo de documento y el permiso.
fr_fr: Lors de la création ou de l'édition d'un document, vous choisirez bien sûr un fichier à télécharger, un type de document et une autorisation.
it: Quando si crea o modifica un documento, si sceglierà naturalmente un file da caricare, un tipo di documento e un permesso.
ru: При создании или редактировании документа вы, конечно же, выбираете файл для загрузки, тип документа и разрешение.
uk: Під час створення або редагування документа ви, звичайно, виберете файл для завантаження, тип документа та дозвіл.

source: Several possible documents types are available from the list, you add a new one by just entering your text in the field.
es: Varios tipos de documentos posibles están disponibles en la lista, puede añadir uno nuevo simplemente introduciendo su texto en el campo.
fr_fr: Plusieurs types de documents sont disponibles dans la liste, vous ajoutez un nouveau en entrant simplement votre texte dans le champ.
it: Diversi tipi di documenti possibili sono disponibili dall'elenco; per aggiungerne uno nuovo basta inserire il testo nel campo.
ru: Несколько возможных типов документов доступны из списка, а для добавления нового достаточно ввести текст в поле.
uk: У списку доступні кілька можливих типів документів, ви додаєте новий, просто ввівши свій текст у поле.

source: Permissions will determine which documents will be displayed on public page; according to the user's rights.
es: Los permisos determinarán qué documentos se mostrarán en la página pública; de acuerdo con los derechos del usuario.
fr_fr: Les autorisations détermineront quels documents seront affichés sur la page publique ; selon les droits de l'utilisateur.
it: Le autorizzazioni determineranno quali documenti verranno visualizzati nelle pagine pubbliche; secondo i diritti dell'utente.
ru: Разрешения определяют, какие документы будут отображаться на публичной странице; в соответствии с правами пользователя.
uk: Дозволи визначатимуть, які документи відображатимуться на публічній сторінці; відповідно до прав користувача.

source: Public list
es: Lista pública
fr_fr: Liste publique
it: Lista pubblica
ru: Публичный список
uk: Публічний список

source: Documents public list is, as all public pages in Galette, related to "Show public pages" parameter from settings; but it's also related to specific access rights which has been set on each one.
es: La lista pública de documentos está, como todas las páginas públicas en Galette, relacionada con el parámetro "Mostrar páginas públicas" de los ajustes; pero también está relacionada con derechos de acceso específicos que se han establecido en cada una.
fr_fr: La liste publique des documents est, comme toutes les pages publiques de Galette, liée au paramètre « Afficher les pages publiques » de la configuration ; mais elle est également liée à des droits d'accès spécifiques qui ont été définis sur chacun.
it: L'elenco pubblico dei documenti è, come tutte le pagine pubbliche di Galette, collegato al parametro "Mostra pagine pubbliche" dalle impostazioni; ma è anche collegato a specifici diritti di accesso impostati su ciascuno di essi.
ru: Публичный список документов, как и все публичные страницы в Galette, связан с параметром "Показывать публичные страницы" из настроек; но он также связан с определенными правами доступа, которые были установлены для каждой из них.
uk: Публічний список документів, як і всі загальнодоступні сторінки в Galette, пов’язаний з параметром «Показати загальнодоступні сторінки» в налаштуваннях; але це також пов’язано з певними правами доступу, які були встановлені для кожного з них.

source: Documents list from a simple member
es: Lista de documentos de un solo miembro
fr_fr: Liste des documents d'un simple adhérent
it: Elenco documenti da un semplice membro
ru: Список документов от простого участника
uk: Список документів із простого члена

source: On the above screenshot, a simple member is logged and can only see documents which are public and which are allowed for users. The internal document is restricted to staff members and therefore is not shown here.
es: En la captura de pantalla anterior, un miembro simple está registrado y solo puede ver los documentos que son públicos y que están permitidos para los usuarios. El documento interno está restringido a los miembros del personal y, por tanto, no se muestra aquí.
fr_fr: Sur la capture d'écran ci-dessus, un simple adhérent simple est connecté et ne peut voir que les documents qui sont publics et qui sont autorisés pour les utilisateurs. Le document interne est limité aux membres du bureau et ne figure donc pas ici.
it: Nella schermata sopra, un membro semplice è registrato e può vedere solo documenti che sono pubblici e che sono permessi per gli utenti. Il documento interno è limitato ai membri del personale e pertanto non viene qui mostrato.
ru: На приведенном выше снимке экрана простой пользователь вошел в систему и может видеть только те документы, которые являются общедоступными и разрешенными для пользователей. Внутренний документ доступен только сотрудникам и поэтому здесь не показан.
uk: На наведеному вище скріншоті простий учасник увійшов у систему та може переглядати лише документи, які є загальнодоступними та дозволеними для користувачів. Внутрішній документ призначено лише для співробітників, тому тут не показано.
