Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/generalites.po
Languages: es, it

source: Generalities
es: Generalidades
it: Generalità

source: Rights
es: Permisos
it: Diritti

source: We can see several rights level in Galette, allowing access to different parts and features of the application. Levels are:
es: Podemos ver varios niveles de permisos en Galette, permitiendo acceder a diferentes partes o funciones de la aplicación. Los niveles son:
it: Si possono osservare diversi livelli di diritti in Galette, che consentono l'accesso a diverse parti e funzionalità dell'applicazione. I livelli sono:

source: **super administrator** is a special user (the only one that is not a member) created at installation,
es: **super administrador** es un usuario especial (el único que no es un miembro) creado en la instalación,
it: **super amministratore** è un utente speciale (l'unico che non è un membro) creato durante l'installazione,

source: **administrators** are members for who the "administrator" checkbox has been checked,
es: **administradores** son miembros para los que se ha marcado la casilla de "administrador",
it: **amministratori** sono membri per i quali è stata selezionata la casella di controllo "amministratore",

source: **staff members** have a specific status (President, Treasurer, Secretary, ...),
es: **personal interno** tienen un estado específico (presidente, tesorero, secretaria, ...),
it: **i membri dello staff** hanno uno status specifico (Presidente, Tesoriere, Segretario, ...),

source: **groups managers** have only rights on the groups they manage,
es: **administradores de grupos** solo tienen permisos en los grupos que ellos gestionan,
it: **i gestori dei gruppi** hanno diritti solo sui gruppi che gestiscono,

source: **up to date members** are members whose account are active, and whose subscription are up to date,
es: **miembros actuales** son miembros cuyas cuentas están activas, y cuyas suscripciones están al corriente,
it: **membri aggiornati** sono membri il cui account è attivo e il cui abbonamento è aggiornato,

source: **members** are members whose account is inactive or whose subscriptions are not up to date,
es: **miembros** son miembros cuyas cuentas no están activas o cuyas suscripciones no están al corriente,
it: **membri** sono membri il cui account è inattivo o i cui abbonamenti non sono aggiornati,

source: simple **visitors**.
es: simples **visitantes**.
it: semplici **visitatori**.

source: Staff members, administrators as well as the super administrator can create, edit and remove members, contributions, transactions, send emailings, ...
es: El personal interno, los administradores así como el super administrador puede crear, editar o eliminar miembros, contribuciones, transacciones, enviar correos electrónicos, ...
it: I membri dello staff, gli amministratori e il super amministratore possono creare, modificare e rimuovere membri, contributi, transazioni, inviare e-mail, ...

source: Administrators have also access to the application configuration, excepted super admin information.
es: Los administradores también tienen acceso a la configuración de la aplicación, excepto la información del superadministrador.
it: Gli amministratori hanno accesso anche alla configurazione dell'applicazione, a eccezione delle informazioni dei super amministratori.

source: The super administrator has a full access to the application, but not to all features. Indeed, this is not a member account, and it cannot have some of required information. He of course can change its own login information from application preferences.
es: El superadministrador tiene acceso total a la aplicación, pero no a todas las funciones. De hecho, no es una cuenta de miembro, y no puede tener cierta información obligatoria. Por supuesto puede cambiar su propia información de inicio de sesión desde los ajustes de la aplicación.
it: Il super amministratore ha accesso completo all'applicazione, ma non a tutte le funzionalità. Infatti, questo non è un account membro e non può avere alcune delle informazioni richieste. Naturalmente può modificare le proprie informazioni di accesso dalle preferenze dell'applicazione.

source: Members can change their own information, and can see their contributions and transactions (as read only).
es: Los miembros pueden cambiar su información propia, y pueden ver sus contribuciones y transacciones (solo lectura).
it: I membri possono modificare le proprie informazioni e visualizzare i propri contributi e le proprie transazioni (in sola lettura).

source: Visitors can - if this is parameted in preferences - access to public pages (trombinoscope, public members list) but can also register :)
es: Los visitantes pueden - si así se configura en los ajustes - acceder a las páginas públicas (anuario, lista de miembros públicos) pero también se pueden registrar :)
it: I visitatori possono - se impostato nelle preferenze - accedere alle pagine pubbliche (trombinoscopio, elenco dei membri pubblici) ma possono anche registrarsi :)

source: Group managers
es: Administradores de grupo
it: Gestori di gruppo

source: With the stricter configuration, groups managers can show and search on members of their groups, and see accessible data for members. On members and cards, you can :ref:`configure which fields are accessible <fields_acls>`.
es: Con la configuración más estricta, los administradores de grupos pueden mostrar y buscar miembros de sus grupos, y ver los datos accesible para miembros. En los miembros y tarjetas, puedes :ref:`configurar que campos son accesibles <fields_acls>`.
it: Con la configurazione più rigorosa, i gestori dei gruppi possono mostrare e cercare i membri dei loro gruppi e vedere i dati accessibili per i membri. Sui membri e sulle schede, si può :ref:`configurare quali campi sono accessibili <fields_acls>`.

source: From the preferences, you can also :ref:`give groups managers extra rights <pref_rights>`, like editing or creating members.
es: Desde los ajustes, también puedes :ref:`dar permisos adicionales para los administradores de grupos <pref_rights>`, como editar o crear miembros.
it: Dalle preferenze si può anche :ref:`concedere ai gestori dei gruppi diritti aggiuntivi <pref_rights>`, come la modifica o la creazione di membri.

source: Management rules
es: Reglas de gestión
it: Regole di gestione

source: Due dates are calculated by day. If a member pay into before the end of his membership, duration of this membership will be added to remaining days. Example:
es: Las fechas de vencimiento se calculan por día. Si un miembro paga antes de que finalice su afiliación, la duración de esta afiliación se sumará a los días restantes. Ejemplo:
it: Le date di scadenza sono calcolate in base al giorno. Se un membro versa prima della fine della sua iscrizione, la durata di questa iscrizione verrà aggiunta ai giorni rimanenti. Esempio:

source: Roger subscribed on 2004-01-01 for one year,
es: Roger se ha suscrito el 01-01-2004 por un año,
it: Roberto si è abbonato il 2004-01-01 per un anno,

source: if he pays into for a year on 2004-12-13,
es: si paga un año el 13-12-2004,
it: se versa per un anno il 2004-12-13,

source: his due date will become 2006-01-01.
es: su fecha de vencimiento será el 01-01-2006.
it: la sua data di scadenza diventerà 2006-01-01.

source: No day will be forget.
es: No se olvidará ningún día.
it: Nessun giorno verrà saltato.

source: At the contrary, if a member renew his membership late, we evaluate again his membership duration:
es: Por el contrario, si un afiliado renueva su afiliación con retraso, evaluamos de nuevo la duración de su afiliación:
it: Al contrario, se un membro rinnova la sua iscrizione in ritardo, si valuta nuovamente la sua durata di iscrizione:

source: if he pays into for a year on 2006-01-13,
es: si paga un año el 13-´01-2006,
it: se paga per un anno il 2006-01-13,

source: his due date will become 2006-01-13.
es: su fecha de vencimiento será el 13-01-2006.
it: la sua data di scadenza diventerà 2006-01-13.

source: He is not an up to date member from 2006-01-01 to 2006-01-13... On paper at least :)
es: No será un miembro al corriente desde el 01-01-2006 al 13-01-2006... Al menos sobre el papel :)
it: Non è un membro aggiornato dal 2006-01-01 al 2006-01-13... Almeno sulla carta :)

source: Those rules are flexible because you can freely change membership dates on contributions, if you have rights to add or update them. We can imagine an association who stores all contributions on the first day of the next month (offering its members a longer membership time).
es: Estas normas son flexibles porque se pueden cambiar libremente las fechas de afiliación de las cotizaciones, si se tienen derechos para añadirlas o actualizarlas. Podemos imaginar una asociación que almacena todas las cotizaciones el primer día del mes siguiente (ofreciendo a sus miembros un plazo de afiliación más largo).
it: Tali regole sono flessibili perché si può modificare liberamente le date di iscrizione sui contributi, se si ha i diritti per aggiungerli o aggiornarli. Si può per esempio immaginare un'associazione che archivia tutti i contributi il primo giorno del mese successivo (offrendo ai suoi membri un periodo di iscrizione più lungo).

source: Interface
es: Interfaz
it: Interfaccia

source: We do our best for the Galette interface to be:
es: Hacemos lo mejor que sabemos para que la interfaz de Galette sea:
it: Facciamo del nostro meglio affinché l'interfaccia di Galette sia:

source: logical and consistent (you will always find icons at familiar places),
es: lógica y consistente (siempre encontrarás iconos en lugares conocidos),
it: logica e coerente (si troveranno sempre le icone in posti familiari),

source: web standards compliant (HTML and CSS valid),
es: compatible con los estándares web (HTML y CSS válidos),
it: conforme agli standard web (HTML e CSS validi),

source: HTML semantic respectful,
es: respetuosos con la semántica HTML,
it: Rispettoso della semantica HTML,

source: working even if Javascript is disabled (as possible, but really you should enable Javascript to really take advantage of Galette),
it: funzionante anche se Javascript è disabilitato (possibile, ma è meglio abilitare Javascript per poter sfruttare al meglio Galette),

source: accessible (without any WCAG, WAI or equivalent tests run).
es: accesible (sin ningún WCAG, WAI o pruebas equivalentes realizadas).
it: accessibile (senza eseguire alcun test WCAG, WAI o equivalenti).

source: If you find places where one of those points is incorrect, do not hesitate to tell us on the tracker or on the mailing list!
es: Si encuentras algún lugar donde uno de esos puntos no sea correcto, ¡no dudes en contárnoslo en el rastreador de incidencias o en la lista de correo!
it: Se trovate punti in cui uno di questi punti non è corretto, non esitate a segnalarcelo sul bug tracker o sulla mailing list!

source: Galette provide a "mobile compatible" UI, but it has not been designed for that. Therefore, it may be difficult or worst to use; in this case we do our best, but all devices cannot be tested!
it: Galette fornisce un'interfaccia utente "compatibile con i dispositivi mobili", ma non è stata progettato per questo. Pertanto, potrebbe essere difficile o più scomodo da usare; facciamo del nostro meglio, ma non possiamo garantire per tutti i tipi di dispositivi!

source: Mobile display is currently a plus and not a fundation of the UI. Improvements can be done, this will just not be a priority. Note that we have in mind to rework the whole UI, with a better support.
it: La visualizzazione mobile è attualmente un plus e non una base dell'interfaccia utente. Si possono fare dei miglioramenti, ma questa non sarà una priorità. Si noti che abbiamo in mente di rielaborare l'intera interfaccia utente, per fornire un supporto migliore.

source: Telemetry
es: Telemetría
it: Telemetria

source: Galette propose to send some telemetry information:
es: Galette propone enviar cierta información de telemetría:
it: Galette propone di inviare alcune informazioni di telemetria:

source: **entirely anonymous**: no information about your association or your members is sent,
es: **totalmente anónima**: no se enviará nada de información sobre tu organización o tus miembros,
it: **in modo completamente anonimo**: non vengono inviate informazioni sull'associazione o sui suoi membri,

source: **deliberately blurred**: we retrieve an estimation of members count, never a real count,
es: **deliberadamente borrosa**: recuperamos una estimación del recuento de miembros, nunca un recuento real,
it: **in modo volutamente offuscato**: recuperiamo una stima del numero dei membri, mai un conteggio reale,

source: sent by a **secured** way (`HTTPS`) on https://telemetry.galette.eu.
es: enviado de manera **segura** (`HTTPS`) en https://telemetry.galette.eu.
it: inviando in modalità **protetta** (`HTTPS`) su https://telemetry.galette.eu.

source: Sending telemetry data is a manual process, nothing will be send until you **explicitely** ask it. With those information, we can have a better knwownledge of different usages of Galette, their number of member or contributions, plugins used, ...
es: Enviar los datos de telemetría es un proceso manual, nada se enviará hasta que lo pidas **explícitamente**. Con esa información, podemos tener una mejor idea de los distintos usos de Galette, sus números de miembros o contribuciones, que complementos se usan, ...
it: L'invio di dati di telemetria è un processo manuale, non verrà inviato nulla finché non lo si richiederà **esplicitamente**. Con queste informazioni, possiamo avere una migliore conoscenza dei diversi utilizzi di Galette, del loro numero di membri o contributi, dei plugin utilizzati, ...

source: Those information are useful for the project development and promotion. When you send those information, you can review data that would be sent.
es: Esa información es útil para el desarrollo y promoción del proyecto. Cuando envías esa información, puedes revisar los datos que mandarías.
it: Tali informazioni sono utili per lo sviluppo e la promozione del progetto. Quando si inviano tali informazioni, si può rivedere i dati che verrebbero inviati (prima di inviarli).

source: Preview Telemetry data
es: Vista previa de datos de telemetría
it: Anteprima dati di telemetria

source: After data has been sent once, Galette will propose to send an update from time to time. You can also send them from Galette preferences.
es: Una vez que los datos se han enviado, Galette te propone enviar una actualización de vez en cuando. También lo puedes enviar desde los ajustes de Galette.
it: Dopo aver inviato i dati la prima volta, Galette proporrà di inviare un aggiornamento di tanto in tanto. Questo può essere inviato anche dalle preferenze di Galette.

source: Telemetry update reminder
es: Recordatorio de actualización de telemetría
it: Promemoria aggiornamento telemetria

source: It is also possible to register your association on the website, of course, not anonymously, but it is not possible to link telemetry and registration. New references are moderated.
es: También es posible registrar su asociación en el sitio web, por supuesto, no de forma anónima, pero no es posible vincular la telemetría y el registro. Las nuevas referencias son moderadas.
it: È anche possibile registrare la propria associazione sul sito web, ovviamente non in forma anonima, ma non è possibile collegare telemetria e registrazione. I nuovi riferimenti sono moderati.

source: You can update your registration information from Galette preferences. The form will be blank (because it is not possible to retrieve data you've sent) but all data will be updated because your instance has a unique registration identifier designed for that.
es: Puede actualizar su información de registro desde las preferencias de Galette. El formulario estará en blanco (porque no es posible recuperar los datos que has enviado) pero todos los datos se actualizarán porque tu instancia tiene un identificador de registro único diseñado para ello.
it: Puoi aggiornare le informazioni di registrazione dalle preferenze di Galette. Il modulo sarà vuoto (perché non è possibile recuperare i dati inviati) ma tutti i dati saranno aggiornati perché la propria istanza ha un identificatore di registrazione univoco progettato per questo.

source: Telemetry from preferences
es: Ajustes de la telemetría
it: Telemetria dalle preferenze

source: A new panel has been added on Galette dashboard to send telemetry information and/or register your instance. Once those steps has been completed, the panel will dissapear. You also can choose to just disable it.
es: Se ha añadido un nuevo panel en el panel de control de Galette para enviar información de telemetría y/o registrar su instancia. Una vez completados estos pasos, el panel desaparecerá. También puede optar por desactivarlo.
it: Un nuovo pannello è stato aggiunto al cruscotto di Galette per inviare informazioni di telemetria e/o registrare la propria istanza. Una volta completati questi passaggi, il pannello scomparirà. Si può anche scegliere di disattivarlo del tutto.

source: Telemetry on dashboard
es: Telemetría en el panel de control
it: Telemetria sul cruscotto
