Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/pdf_models.po
Languages: ta

source: PDF models
ta: PDF மாதிரிகள்

source: PDF models are provided for several outputs : an invoice model, a receipt model and a membership from model are currently available. All of them inherits from a `Global` model.
ta: பல வெளியீடுகளுக்கு PDF மாதிரிகள் வழங்கப்படுகின்றன: ஒரு விலைப்பட்டியல் மாதிரி, ரசீது மாதிரி மற்றும் மாதிரியிலிருந்து உறுப்பினர் தற்போது கிடைக்கிறது. அவை அனைத்தும் `உலகளாவிய` மாதிரியிலிருந்து பெறுகின்றன.

source: PDF models management
ta: PDF மாதிரிகள் மேலாண்மை

source: Models inheritance
ta: மாதிரிகள் பரம்பரை

source: The global model defines three distincts parts:
ta: உலகளாவிய மாதிரி மூன்று தனித்துவமான பகுதிகளை வரையறுக்கிறது:

source: header,
ta: தலைப்பு,

source: footer,
ta: அடிக்குறிப்பு,

source: CSS styles.
ta: சிஎச்எச் ச்டைல்கள்.

source: Each model which inherits from `Global` will automatically obtain same header and footer except if the new model redefines them, in which case only specific values will be applied.
ta: புதிய மாதிரி அவற்றை மறுவரையறை செய்தால் தவிர, `குளோபல்` இலிருந்து பெறும் ஒவ்வொரு மாதிரியும் தானாகவே ஒரே தலைப்பு மற்றும் அடிக்குறிப்பைப் பெறும், இந்த விசயத்தில் குறிப்பிட்ட மதிப்புகள் மட்டுமே பயன்படுத்தப்படும்.

source: For CSS properties it is a bit different: `Global` model properties will always be applied, and specific model properties will be appended (just like real CSS stylesheets).
ta: சிஎச்எச் பண்புகளுக்கு இது சற்று வித்தியாசமானது: `உலகளாவிய` மாதிரி பண்புகள் எப்போதும் பயன்படுத்தப்படும், மேலும் குறிப்பிட்ட மாதிரி பண்புகள் சேர்க்கப்படும் (உண்மையான சிஎச்எச் ச்டைல்சீட்களைப் போலவே).

source: Generalities
ta: பொதுவானவை

source: In addition of header, footer and CSS styles, a model defines a title, a sub title and a body.
ta: தலைப்பு, அடிக்குறிப்பு மற்றும் சிஎச்எச் ச்டைல்கள் கூடுதலாக, ஒரு மாதிரி ஒரு தலைப்பு, துணை தலைப்பு மற்றும் உடலை வரையறுக்கிறது.

source: Each of those fields can take some replacement values, refer to the inline help from the user interface to get details. They also can contains internationalized texts like `_T("My text")` that relies on Galette standard translation capacities.
ta: அந்த புலங்கள் ஒவ்வொன்றும் சில மாற்று மதிப்புகளை எடுக்கலாம், விவரங்களைப் பெற பயனர் இடைமுகத்திலிருந்து இன்லைன் உதவியைப் பார்க்கவும். கேலட் நிலையான மொழிபெயர்ப்பு திறன்களை நம்பியிருக்கும் `_T (" எனது உரை ")` போன்ற சர்வதேசமயமாக்கப்பட்ட நூல்களையும் அவை கொண்டிருக்கலாம்.

source: Models rely on HTML and CSS styles, but keep in mind we are building a PDF file, and not displaying a page in a recent browser; there are many limitations.
ta: மாதிரிகள் உஉகுமொ மற்றும் சிஎச்எச் ச்டைல்களை நம்பியுள்ளன, ஆனால் நாங்கள் ஒரு PDF கோப்பை உருவாக்குகிறோம் என்பதை நினைவில் கொள்ளுங்கள், அண்மைக் கால உலாவியில் ஒரு பக்கத்தைக் காட்டவில்லை; பல வரம்புகள் உள்ளன.

source: Invoice and receipt models are the same, excepting their titles.
ta: விலைப்பட்டியல் மற்றும் ரசீது மாதிரிகள் அவற்றின் தலைப்புகளைத் தவிர்த்து ஒன்றே.

source: Invoice PDF model
ta: விலைப்பட்டியல் PDF மாதிரி

source: As you can see in the above screenshot, invoice model does not define any header, footer or CSS styles, the ones form the `Global` model are used.
ta: மேலே உள்ள ச்கிரீன்சாட்டில் நீங்கள் காணக்கூடியது போல, விலைப்பட்டியல் மாதிரி எந்த தலைப்பு, அடிக்குறிப்பு அல்லது சிஎச்எச் பாணிகளை வரையறுக்காது, அவை `உலகளாவிய` மாதிரியை உருவாக்குகின்றன.

source: Membership form
ta: உறுப்பினர் படிவம்

source: It is a model that can be used to print a membership form. It can be empty (to print some of them for any event for example) or filled with one member information.
ta: உறுப்பினர் படிவத்தை அச்சிட இது பயன்படுத்தக்கூடிய ஒரு மாதிரி. இது காலியாக இருக்கலாம் (அவற்றில் சிலவற்றை எந்தவொரு நிகழ்விற்கும் அச்சிட) அல்லது ஒரு உறுப்பினர் தகவல்களால் நிரப்பப்படலாம்.

source: Since there are many limitation, you may use the :doc:`FullCard plugin </plugins/fullcard>` that will replace this model. It is more complex to change, but you can do many more with it. You can also create your own plugin based on FullCard.
ta: பல வரம்புகள் இருப்பதால், நீங்கள் பயன்படுத்தலாம்: டாக்: `ஃபுல் அட்டை சொருகி </செருகுநிரல்கள்/ஃபுல் கார்டு>` இது இந்த மாதிரியை மாற்றும். மாற்றுவது மிகவும் சிக்கலானது, ஆனால் நீங்கள் இன்னும் பலவற்றைச் செய்யலாம். ஃபுல் கார்டின் அடிப்படையில் உங்கள் சொந்த சொருகி உருவாக்கலாம்.
