Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/preferences.po
Languages: es, fr_fr

source: **Using a SMTP server**: uses an external SMTP server to configure (will be slower than PHP ``mail()`` function),
es: **Utilizar un servidor SMTP**: utiliza un servidor SMTP externo para configurar (será más lento que utilizar la función ``mail()`` de PHP),
fr_fr: **Utiliser un serveur SMTP** : utilise un serveur SMTP externe à configurer (sera plus lent que la fonction PHP ``mail()``),

source: **Using GMail as SMTP**: same as SMTP server, but GMail specific (will also be slower than PHP ``mail()`` function),
es: **Utilizar GMail como SMTP**: igual que el servidor SMTP, pero específico de GMail (también será más lento que la función ``mail()`` de PHP),
fr_fr: **Utiliser GMail comme serveur SMTP** : similaire au serveur smTp, mais spécifique à GMail (sera plus lent que la fonction PHP ``mail()``),

source: **Using sendmail server**: uses local server sendmail,
es: **Utilizar servidor Sendmail**: utiliza un servidor local de Sendmail,
fr_fr: **Utiliser un serveur sendmail** : utilisation du serveur sendmail local,

source: **Using qmail server**: uses local server qmail,
es: **Utilizar servidor qmail**: utiliza un servidor local de qmail,
fr_fr: **Utiliser un serveur qmail** : utilisation du serveur qmail local,

source: **Mail signature**: signature added to all sent emails. Available variables are displayed in the inline help from the application.
es: **Firma de correo electrónico**: se añade la firma a todos los correos electrónicos enviados. Se muestran variables disponibles en la ayuda en línea de la aplicación.
fr_fr: **Signature courriels** : signature à ajouter à tous les courriels envoyés. Les variables sont affichées depuis l'aide en ligne depuis l'interface de l'application.

source: When using GMail as SMTP, you will have to configure user name and password to use.
es: Cuando utilizas GMail como SMTP, tendrás que configurar el nombre del usuario y la contraseña para utilizarlo.
fr_fr: Lorsque vous utilisez GMail comme SMTP, vous devrez configurer le nom d'utilisateur et le mot de passe à utiliser.

source: SMTP configuration is a bit more complexe :
es: La configuración de SMTP es un poco más compleja :
fr_fr: La configuration SMTP est un peu plus complexe :

source: **SMTP server**: server address, required,
es: **Servidor SMTP**: dirección del servidor, obligatoria,
fr_fr: **Serveur SMTP** : adresse du serveur , requise,

source: **SMTP port**: server port, required,
es: **Puerto SMTP**: puerto del servidor, obligatorio,
fr_fr: **Port SMTP** : port du serveur, requis,

source: **Use SMTP authentication**: if your server requires an authentication. In this case, you will also have to set username and password,
es: **Utilizar autenticación SMTP**: si tu servidor requiere una autenticación. En este caso, también tendrás que establecer el nombre de usuario y la contraseña,
fr_fr: **Utiliser l'authentification SMTP** : si votre serveur requiert une authentification. Dans ce cas, vous devrez également renseigner les nom d'utilisateur et mot de passe,

source: **Use TLS for SMTP**: enable SSL support (always on for GMail),
es: **Utiliza TLS para SMTP**: activar soporte SSL (siempre activo para GMail),
fr_fr: **Utiliser TLS pour SMTP** : active le support SSL (toujours actif pour GMail),

source: **Allow unsecure TLS**: on some cases, SSL certificate may be invalid (self signed for example).
es: **Permitir TLS no segura**: En algunos casos, el certificado SSL podría ser no válido (autofirmado, por ejemplo).
fr_fr: **Autoriser TLS non sécurisé** : dans certains cas, le certificat SSL peut-être invalide (auto signé par exemple).

source: The `Test mail settings` button will send a test message to the email currently stored as members administrator.
es: El botón `Probar ajustes de correo` enviará un mensaje de prueba al correo electrónico actualmente guardado como administrador de miembros.
fr_fr: Le bouton `Test des paramètres courriels` enverra un message de test à l'adresse actuellement enregistrée de l'administrateur des adhérents.

source: Labels
es: Etiquetas
fr_fr: Étiquettes

source: Galette settings, labels tab
es: Ajustes de Galette, pestaña etiquetas
fr_fr: Préférences de Galette, onglet étiquettes

source: Cards
es: Tarjetas
fr_fr: Cartes

source: Galette settings, cards tab
es: Ajustes de Galette, pestaña tarjetas
fr_fr: Préférences de Galette, onglet cartes

source: Security
es: Seguridad
fr_fr: Sécurité

source: Complex password rules are not user friendly; but security is mainly never :)
es: Las reglas de contraseñas complejas no son amigables para los usuarios; pero la seguridad nunca lo es :)
fr_fr: Les règles de mots de passes complexes ne sont pas évidentes pour les utilisateurs, mais la sécurité ne l'est pour ainsi dire jamais :)

source: Of course, all passwords should be as secure as possible, but this is especially true for all accounts that have privileges (staff, admin, super-admin); you may explain your users why this is important.
es: Por supuesto, todas las contraseñas deberían ser tan seguras como sea posible, pero esto es especialmente cierto para todas las cuentas que tengan privilegios (personal, administrador, superadministrador); puedes explicar a sus usuarios por qué esto es importante.
fr_fr: Bien sûr, tous les mots de passe devraient être aussi sécurisés que possible, mais c'est particulièrement vrai pour les comptes qui ont des privilèges (membres du bureau, admin, super-admin) ; vous devriez expliquer à vos utilisateurs pourquoi c'est important.

source: You can enforce some rules for members (and super-admin) passwords:
es: Puedes reforzar algunas reglas para contraseñas de miembros (y super-administrador):
fr_fr: Vous pouvez requérir certaines règles pour les mots de passe des utilisateurs (et su super-admin) :

source: minimum length (6 characters or more),
es: longitud mínima (6 caracteres o más),
fr_fr: longueur minimale (6 caractères ou plus),

source: minimum "strength",
es: "fortaleza" mínima,
fr_fr: "complexité" minimale,

source: blacklist,
es: lista negra,
fr_fr: liste noire,

source: no personal information.
es: sin información personal.
fr_fr: pas d'informations personnelles.

source: Galette settings, security tab
es: Ajustes de Galette, pestaña de seguridad
fr_fr: Préférences de Galette, onglet sécurité

source: Length is still the only rule that is active per default, just configure the number of characters required. On passwords fields, failures will be displayed on the fly; as well as a "strength meter" displayed for information.
es: La longitud sigue siendo la única regla que está activa por defecto, solo configura el número de caracteres requeridos. En los campos de contraseñas, los fallos se mostrarán al vuelo; así como un "medidor de fuerza" se mostrará para información.
fr_fr: La longueur est toujours la seule règle active par défaut, configurez juste le nombre de caractères requis. Sur les champs mot de passe, les erreurs seront affichées à la volée ; ainsi qu'une "barre de complexité" affichée pour information.

source: If you enable password checks, it is not possible to know if some of existing ones does not respect them. Galette will display a warning at login if checks are not respected, but login will still be possible!
es: Si activa las comprobaciones de contraseña, no es posible saber si alguna de las existentes no las respeta. Galette mostrará una advertencia en el inicio de sesión si no se respetan las comprobaciones, ¡pero el inicio de sesión seguirá siendo posible!
fr_fr: Si vous activez la vérification des mots de passe, il n'est pas possible de savoir ceux qui existent et qui ne les respecteraient pas. Galette affichera un avertissement au login si les vérifications ne sont pas respectées, mais il sera toujours possible de se connecter !

source: But wait... Password security is important, but Galette does not enforce nothing! Isn't that dumb? Well, not really. For tests or entirely private instances, security may be less important; and in some cases, being too restrictive may be an issue for your users; that's why this is up to you to secure as needed; just like using SSL or not :)
es: Pero espere... La seguridad de las contraseñas es importante, ¡pero Galette no impone nada! ¿No es una tontería? Pues la verdad es que no. Para pruebas o instancias completamente privadas, la seguridad puede ser menos importante; y en algunos casos, ser demasiado restrictivo puede ser un problema para sus usuarios; es por eso que esto depende de usted para asegurar según sea necesario; al igual que el uso de SSL o no :)
fr_fr: Mais... La sécurité des mots de passe est importante, mais Galette ne force rien ! N'est-ce pas idiot ? Hé bien... Pas vraiment. Pour les instances de tests ou entièrement privées, la sécurité peut être de moindre importance ; et dans certains cas, être trop restrictif peut être un problème pour vos utilisateurs ; c'est pourquoi il vous revient de configurer la sécurité, tout comme utiliser ou pas SSL :)

source: Password strength
es: Seguridad de la contraseña
fr_fr: Complexité du mot de passe

source: Password strength calculation is quite simple. It is based on 4 rules:
es: El cálculo de la seguridad de una contraseña es bastante sencillo y se basa en cuatro reglas:
fr_fr: Le calcul de la complexité du mot de passe est assez simple. Elle est basée sur 4 règles :

source: contains lower case characters,
es: contiene caracteres en minúsculas,
fr_fr: contient des lettres minuscules,

source: contains upper case characters,
es: contiene caracteres en mayúsculas,
fr_fr: contient des lettres majuscules,

source: contains number,
es: contiene números,
fr_fr: contient des chiffres,

source: contains special characters.
es: contiene caracteres especiales.
fr_fr: contient des caractères spéciaux.

source: You can choose between 5 values for strength configuration:
es: Puede elegir entre cinco valores para configuración de la seguridad:
fr_fr: Vous pouvez choisir parmi 5 valeurs dans la configuration de la complexité :

source: **none**: (default): disables strength checks and check for personal information,
es: **ninguna**: (por defecto): deshabilita las comprobaciones de la seguridad y la comprobación de datos personales,
fr_fr: **aucun** : (défaut) désactive la vérification de la complexité et des informations personnelles,

source: **weaker**: enables check for personal information, only one of the rule is mandatory,
es: **débil**: activa la comprobación de información personal, solo si una de las reglas es obligatoria,
fr_fr: **faible** : active la vérification des informations personnelles, seule une règle est obligatoire,

source: **medium**: two rules are mandatory,
es: **media**: son obligatorias dos reglas,
fr_fr: **moyen** : deux règles sont obligatoires,

source: **strong**: three rules are mandatory,
es: **fuerte**: son obligatorias tres reglas,
fr_fr: **fort** : trois règles sont obligatoires,

source: **very strong**: the four rules are mandatory.
es: **muy fuerte**: son obligatorias las cuatro reglas.
fr_fr: **très fort** : toutes les règles sont obligatoires.

source: Blacklisted passwords
es: Listado negro de contraseñas
fr_fr: Liste noire des mots de passe

source: A default list of 500 common passwords is provided as a blacklist you can enable, "galette" is also blacklisted.
es: Una lista por defecto de 500 contraseñas comunes se proporciona como una lista negra que puede habilitar, "galette" también está en la lista negra.
fr_fr: Une liste par défaut de 500 mots de passe communs est fournie en liste noire que vous pouvez activer, "galette" est également interdit.

source: The ``galette/data/blacklist.txt`` file is used to list blacklisted terms (one per line). You can provide your own file, we advice you to complete the existing one.
es: El archivo ``galette/data/blacklist.txt`` se utiliza para listar los términos incluidos en la lista negra (uno por línea). Puede presentar su propio expediente, le aconsejamos que complete el existente.
fr_fr: Le fichier ``galette/data/blacklist.txt`` est utilisé pour lister les termes interdits (un par ligne). Vous pouvez utiliser votre propre fichier, nous vous conseillons de compléter celui qui existe.

source: Personal information as password
es: Información personal como contraseña
fr_fr: Informations personnelles pour mot de passe

source: This check rely on strength activation (all but **none** level). For the super-admin account, this will just ensure you are not using login as password. For standard accounts, there are several information involved:
es: Esta comprobación refiere a activación de fortaleza (todo excepto **ningún** nivel). Para la cuenta super-administrador, esto tan solo asegurará que no esté utilizando el acceso como contraseña. Para las cuentas normales, hay alguna información relacionada:
fr_fr: Cette vérification s'appuie sur l'activation des règles de complexité (pour tous les niveaux sauf **aucun**). Pour le compte super administrateur, elle se contentera de vérifier que le mot de passe et l'identifiant ne sont pas les mêmes. Pour les comptes standards, plusieurs informations sont prises en compte :

source: name,
es: nombre,
fr_fr: nom,

source: surname,
es: apellido,
fr_fr: prénom,

source: nickname,
es: apodo,
fr_fr: pseudo,

source: login,
es: inicio de sesión,
fr_fr: identifiant,

source: email,
es: correo electrónico,
fr_fr: adresse de courriel,

source: birthdate,
es: fecha de nacimiento,
fr_fr: date de naissance,

source: town
es: ciudad
fr_fr: ville

source: Basically, user cannot use verbatim any of those information as password. Some possible combinations are also checked, like surname and name couple (or name and surname), first letter of surname with name, etc. Birthdate will be checked in different formats as well (localized, international, and some variants).
es: Básicamente, el usuario no puede usar literalmente ninguna de esas informaciones como contraseña. También se comprueban algunas combinaciones posibles, como apellido y nombre (o nombre y apellido), primera letra del apellido con el nombre, etc. La fecha de nacimiento se verificará en diferentes formatos (localizado, internacional y algunas variantes).
fr_fr: Les utilisateurs ne pourront utiliser aucune de ces informations comme mot de passe telles quelles. Certaines combinaisons possibles sont également vérifiées, comme le couple prénom et nom (ou nom et prénom), la première lettre du prénom avec le nom, etc. La date de naissance sera vérifiée avec plusieurs formats également (localisé, international, et quelques variantes).

source: Admin
es: Administrador
fr_fr: Administrateur

source: This tab wil be present only if you are logged in as super administrator.
es: Esta pestaña estará presente únicamente si ha accedido como super administrador.
fr_fr: Cet onglet ne sera présent que si vous êtes connecté en tant que super administrateur.

source: Galette settings, admin tab
es: Ajustes de Galette, pestaña administrador
fr_fr: Préférences de Galette, onglet admin
