Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/preferences.po
Languages: es, fr_fr

source: Galette preferences
es: Ajustes de Galette
fr_fr: Préférences de Galette

source: You can configure several aspects of Galette from the preferences.
es: Puedes configurar varios aspectos de Galette desde los ajustes.
fr_fr: Vous pouvez configurer différents aspects de Galette depuis les préférences.

source: General
fr_fr: Général

source: This tab defines some parameters related to your association:
es: Esta etiqueta define algunos parámetros relacionados a su organización:
fr_fr: Cet onglet définit quelques paramètres relatifs à votre association :

source: Galette settings, general tab
es: Ajustes de Galette, pestaña general
fr_fr: Paramètres de Galette, onglet général

source: **Name**: name of the association,
es: **Name**: nombre de la organización,
fr_fr: **Nom** : nom de l'association,

source: **Description**: a short description,
es: **Description**: una breve descripción,
fr_fr: **Description** : une courte description,

source: **Footer text**: a text (HTML is allowed) to display in the footer of each page (to add a link to particular legal notices as example),
es: **Footer text**: un texto (está permitido HTML) para representar dentro del pie de cada página (para añadir un enlace a determinados avisos legales como ejemplo),
fr_fr: **Texte de pied de page** : un texte (le HTML est autorisé) à afficher dans le pied de chaque page (un lien vers des conditions légales particulières par exemple),

source: **Logo**: set your own logo,
es: **Logo**: fija su propio logotipo,
fr_fr: **Logo** : ajouter votre propre logo,

source: **Address**,
es: **Dirección**,
fr_fr: **Adresse**,

source: **Zipcode**,
es: **Código postal**,
fr_fr: **Code postal**,

source: **Town**,
es: **Ciudad**,
fr_fr: **Ville**,

source: **Country**,
es: **País**,
fr_fr: **Pays**,

source: **Postal address**: choose which postal address will be used:
es: Dirección postal: elige que dirección postal será utilizada:
fr_fr: **Adresse postale** : choisissez l'adresse postale qui sera utilisée :

source: either **from the preferences** to use the one entered in the form,
es: o bien **desde los ajustes** para utilizar la introducida en el formulario,
fr_fr: soit **depuis les préférences** pour utilisée celle entrée dans le formulaire,

source: either **from a member** to use address from a staff member,
es: o bien **desde un miembro** para utilizar la dirección de un miembro del personal,
fr_fr: soit **depuis un adhérent** pour utiliser l'adresse d'un membre du bureau,

source: **Website**: website URL,
es: **Sitio web**: la dirección URL del sitio web,
fr_fr: **Site web** : URL du site web,

source: **Telemetry date**: date on which `telemetry infomations <https://telemetry.galette.eu>`_ was sent,
es: **Fecha telemétrica**; fecha en la cual se enviaron las `informaciones telemétricas <https://telemetry.galette.eu>`_,
fr_fr: **Date de télémétrie** : date à laquelle `les informations de télémétrie <https ://telemetry.galette.eu>`_ ont été envoyées,

source: **Registration date**: date of `registration of your Galette instance <https://telemetry.galette.eu/reference>`_
es: **Fecha de registro**: fecha de `registro de su instancia Galette <https://telemetry.galette.eu/reference>`_
fr_fr: **Date d'enregistrement** : la `date d’enregistrement de votre instance de Galette <https://telemetry.galette.eu/reference>`_

source: Social networks
es: Redes sociales
fr_fr: Réseaux sociaux

source: Manage social networks of your association. This may be used in PDF or emails as variables (see inline doc on related parts).
es: Gestiona las redes sociales de tu organización. Esto podría usarse en PDF o correos electrónicos como variables (ver documentación en línea de las secciones relacionadas).
fr_fr: Gérer les réseaux sociaux de votre association. Ils peuvent être utilisés dans les PDF ou les courirels en tant que variables (voir la documentation en ligne relative).

source: Galette settings, social networks tab
es: Ajustes de Galette, pestaña de redes sociales
fr_fr: Préférences de Galette, onglet réseaux sociaux

source: Parameters
es: Parámetros
fr_fr: Paramètres

source: Galette related parameters:
es: Parámetros relacionados de Galette:
fr_fr: Informations relatives à Galette :

source: Galette settings, parameters tab
es: Ajustes de Galette, pestaña de parámetros
fr_fr: Paramètres de Galette, onglet paramètres

source: **Default lang**: default instance lang (can be changed many ways by the user),
es: **Idioma predeterminado**: idioma de instancia predeterminado (el usuario puede modificarlo de muchas maneras),
fr_fr: **Langue par défaut** : langue par défaut de l'instance (peut être modifiée de plusieurs façons par l'utilisateur),

source: **Lines / page**: number of lines to display on lists for pagination,
es: **Líneas / página**: número de líneas para representar en listados para paginación,
fr_fr: **Lignes par page** : nombres de lignes à afficher dans les listes pour la pagination,

source: **After member creation**: defines action to execute after a member has been added:
es: **Después de crear el miembro**: define la acción que se ejecutará después de añadir un nuevo miembro:
fr_fr: **Après la création d'un adhérent** : détermine l'action à effectuer après qu'un adhérent ait été ajouté :

source: create a new contribution,
es: crear una nueva contribución,
fr_fr: créer une nouvelle contribution,

source: create a new transaction,
es: crear una nueva transacción,
fr_fr: créer une nouvelle transaction,

source: create another member,
es: crear otro miembro,
fr_fr: créer un autre adhérent,

source: show member,
es: mostrar al miembro,
fr_fr: afficher l'adhérent,

source: go to members list,
es: ir al listado de miembros,
fr_fr: aller à la liste des adhérents,

source: go to main page,
es: ir a la página principal,
fr_fr: aller à la page principale,

source: **Logging**: handles internal history:
es: **Registro**: controla el historial interno:
fr_fr: **Historique** : gère l'historique interne :

source: Enabled,
es: Activado,
fr_fr: Activé,

source: Disabled,
es: Desactivado,
fr_fr: Désactivé,

source: **Default membership status**: the status to affect to all new created users (can be changed on creation form if current user have rights),
es: **Estado de afiliación por defecto**: el estado que debe afectar a todos los nuevos usuarios creados (se puede cambiar en el formulario de creación si el usuario actual tiene permisos),
fr_fr: **Statut d'adhésion par défaut** : le statut à affecter à tous les adhérents créés (peut être modifié depuis le formulair de création si l'utilisateur en a le droit),

source: **Default account filter**: default account filter to apply on members list,
es: **Filtro de cuenta predeterminado**: filtro de cuenta predeterminado a aplicar en la lista de miembros,
fr_fr: **Filtre de compte par défaut** : filtre de compte à appliquer par défaut sur la liste des adhérents,

source: **Default membership extension**: membership extension in months,
es: **Prolongación de la afiliación por defecto**: prolongación de la afiliación en meses,
fr_fr: **Durée d'adhésion par défaut** : extension de la souscription en mois,

source: **Beginning of membership**: beginning date of the financial period,
es: **Inicio de la afiliación**: fecha de inicio del ejercicio financiero,
fr_fr: **Date de début d'exercice** : la date de début de l'exercice fiscal,

source: **Public pages enabled**: enable or disable public pages,
es: **Páginas públicas activadas**: activa o desactiva las páginas públicas,
fr_fr: **Pages publiques actives** : active ou désactive les pages publiques,

source: **Show public pages for**: defines who can see public pages:
es: **Mostrar páginas públicas para:**: define quién puede ver las páginas públicas:
fr_fr: **Afficher les pages publiques pour** : définit qui peut voir les pages publiques :

source: **Everyone**, including simple visitors,
es: **Todos**, incluidos los visitantes,
fr_fr: **Tout le monde**, y compris les simples visiteurs,

source: **Up to date members**,
es: **Miembros actuales**,
fr_fr: **Adhérents à jour**,

source: **Administrators and staff members**,
es: **Administradores y personal interno**,
fr_fr: **Administrateurs et membres du bureau**,

source: **Self subscription enabled**: enable or disable self subscription feature,
es: **Suscripción propia activada**: activa o desactiva la función de suscripción propia,
fr_fr: **Enregistrement actif** : active ou désactive l'auto-enregistrement,

source: **Post new contribution script URI**: URI of a script that will be called after a new contribution has been added. Several prefixes are handled:
es: **Publica código URI de nueva contribución**: se llamará a la URI de un código después de que se añada una nueva contribución. Se utilizan varios prefijos:
fr_fr: **URI du script post contribution** : URI d'un script qui sera appelé après qu'une nouvelle contribution ait été ajoutée. Plusieurs préfixes sont supportés :

source: **galette://**: call a script provided by Galette that will be called with the HTTP POST method. Path must be relative to your Galette installation. For example, the URI for the ``galette/post_contribution_test.php`` example script would be `galette://post_contribution_test.php`.
es: **galette://**: llama a un script proporcionado por Galette que se llamará con el método HTTP POST. La ruta debe ser relativa a tu instalación de Galette. Por ejemplo, la URI para el código de ejemplo ``galette/post_contribution_test.php`` sería `galette://post_contribution_test.php`.
fr_fr: **galette://** : appel d'un script fourni par Galette qui sera appelé avec une méthode HTTP POST. Le chemin doit être relatif à votre installation de Galette. Par exemple, l' URI pour le script d'exemple ``galette/post_contribution_test.php`` serait `galette://post_contribution_test.php`.

source: **get://** or **post://**: use HTTP GET or POST method to call a web address, prefix will be replaced with ``http://``,
es: **get://** o **post://**: utiliza el método HTTP GET oo POST para llamar a una dirección web, el prefijo se reemplazará por ``http://``,
fr_fr: **get://** ou **post://** : utilise la méthode HTTP GET ou POST pour appeler une adresse web, le préfixe sera remplacé par ``http://``,

source: **file://**: call a file on the web server, full path must be provided. Destination script must be executable, and should define a shellbang if necessary. An email that contains contribution information and script return (if any) will be sent to the administrator if an error occurs. The behavior is the same as cron : if the script outputs something, a mail is sent.
es: **file://**: llama a un archivo en el servidor web, debe proporcionarse la ruta completa. El código de destino debe ser ejecutable, y debería definirse un shebang si fuera necesario. Si se produce algún error, se enviará al administrador un correo electrónico que contenga la información de la contribución y el resultado del código (si lo hubiera). El comportamiento es el mismo que cron : si el código devuelve algo, se envía un correo electrónico.
fr_fr: **file://** : appel d'un fichier sur le serveur web, le chemin complet doit être fourni. Le script de destination doit être exécutable et devrait définir un shellbang si nécessaire. Un courriel qui contient les informations de distribution et le retour du script (s'il y en a un) sera envoyé à l’administrateur si une erreur survient. Le comportement est les même que pour cron : si le script produit une sortie, un courriel est envoyé.

source: Using ``file://`` method can be dangerous, Galette just call the provided script, usage and security of the script is **under your own responsability**.
es: Utilizar el método ``file://`` puede ser peligroso, Galette solo llama el código proporcionado, el uso y seguridad del código se realiza **bajo su propia responsabilidad**.
fr_fr: L'utilisation de la méthode ``file://`` peut être dangereuse, Galette appellera juste le script renseigné, l'utilisation et la sécurité de ce script **sont sous votre entière responsabilité**.

source: **Appearance** : these settings allow you to adapt the default appearance of Galette to your needs.
fr_fr: **Apparence** : ces paramètres vous permettent d'adapter l'apparence par défaut de Galette à vos besoins.

source: **Hide default background image** : hide the image used as a background on private pages, on modal windows headers, and on public page headers.
fr_fr: **Masquer l'image d'arrière-plan par défaut** : masquer l'image utilisée en arrière-plan sur les pages privées, sur les en-têtes des fenêtres modales et sur les en-têtes des pages publiques.

source: **Apply custom colors**: enable or disable usage of following color parameters:
fr_fr: **Appliquer les couleurs personnalisées** : active ou désactive l’utilisation des paramètres de couleur qui suivent :

source: **Primary color**: applied to primary buttons, checkboxes, labels, headers, borders, and menus.
fr_fr: **Couleur principale** : appliquée aux boutons principaux, cases à cocher, étiquettes, en-têtes, bordures et menus.

source: **Text on primary color**: applied to text displayed over the *Primary color*.
fr_fr: **Texte sur la couleur principale** : appliquée au texte affiché par dessus la *Couleur principale*.

source: **Secondary color**: applied to active items in menus, paginations, and accordions views.
fr_fr: **Couleur secondaire** : appliquée aux éléments actifs dans les menus, les paginations et les vues en accordéons.

source: **Text on secondary color**: applied to text displayed over the *Secondary color*.
fr_fr: **Texte sur la couleur secondaire** : appliquée au texte affiché par dessus la *Couleur secondaire*.

source: **RSS feed URL**: link to the RSS feed to display on dashboard,
es: **Dirección URL del feed RSS**: enlace al feed RSS para mostrar en el panel de control,
fr_fr: **URL du flux RSS** : lien vers le flux RSS à afficher sur le tableau de bord,

source: **Galette base URL**: Galette instance URL, if the one proposed is incorrect,
es: **La dirección URL base de Galette**: La dirección URL base de la instancia de Galette, si la que se propone es incorrecta,
fr_fr: **URL de Galette** : URL de votre instance de Galette, si celle qui est proposée est incorrecte,

source: This URL should be changed only if there are issues, this may cause instability.
es: Este URL debería cambiarse solamente si hay problemas, esto puede causar inestabilidad.
fr_fr: Cette URL ne devrait être changée que si vous constatez des problèmes, cela pourrait causer des instabilités.

source: A contextual help is provided, check it for more information.
es: Se proporciona una ayuda contextual, márcalo para más información.
fr_fr: Une aide contextuelle est fournie, veuillez vous-y référer pour davantage d'informations.

source: Rights
es: Permisos
fr_fr: Droits

source: Define few extra rights:
es: Define pocos permisos adicionales:
fr_fr: Définition de quelques droits supplémentaires :

source: **Can members create child?** if you enable this settings, any logged in member can create another members that will be attached to him as children.
es: ¿Pueden los miembros crear miembros secundarios? si quieres activar este ajuste, cualquier miembro que haya iniciado la sesión podrá crear otros miembros que serán adjuntados a él como hijos.
fr_fr: ** Les adhérents peuvent créer des enfants ? ** si vous activez ceci, n'importe quel adhérent connecté pourra créer d'autres adhérents qui lui seront attachés en tant qu'enfants.

source: **Can group managers edit their groups?** groups manager can edit their owned groups information (name, parent, order).
es: **¿Pueden los administradores de grupo editar sus grupos?** los administradores de grupo pueden editar la información de sus grupos en propiedad (nombre, padre, orden).
fr_fr: **Les responsables de groupes peuvent éditer leurs groupes ?** les responsables de groupe pourront modifier les informations des groups gérés (nom, parent, ordre).

source: **Can group managers create members?** groups managers can create members attached to their groups.
es: **¿Pueden los administradores de grupo crear miembros?** los administradores de grupo pueden crear miembros adjuntos a sus grupos.
fr_fr: **Les responsables de groupes peuvent créer des adhérents ?** les responsables de groupe pourront créer des adhérents attachés à leurs groupes.

source: **Can group managers edit members?** groups managers can edit member of their groups information.
es: **¿Pueden los administradores de grupo editar miembros?** los administradores de grupo pueden editar la información de los miembros de sus grupos.
fr_fr: **Les responsables de groupe peuvent éditer les adhérents ?** les responsables de groupe peuvent modifier les informations des adhérents de leurs groupes.

source: **Can group managers send mailings?** groups manager can send mailings.
es: **¿Pueden los administradores de grupo enviar correos?** los administradores de grupo pueden enviar correos.
fr_fr: **Les responsables de groupe peuvent effectuer des envois ?** les responsables de groupe peuvent effectuer des envois.

source: **Can group managers do exports?** groups managers cen export groups as PDF, generate attendance sheets, cards, labels and CSV exports for members of their groups.
es: **¿Pueden los administradores de grupo hacer exportaciones?** los administradores de grupo pueden exportar grupos como PDF, generar hojas de asistencia, tarjetas, etiquetas y exportaciones para los miembros de sus grupos.
fr_fr: **Les responsables de groupe peuvent effectuer des exports ?** les responsables de groupe peuvent exporter leurs groupes en PDF, générer des listes d'émargement, et produire les cartes, étiquettes et exports CSV des adhérents de leurs groupes.

source: **Can group managers see contributions?** groups managers can see contributions of members of their groups.
es: **¿Pueden los administradores de grupo ver las contribuciones?** los administradores de grupo pueden ver las contribuciones de los miembros de sus grupos.
fr_fr: **Les responsables de groupes peuvent voir les contributions ?** les responsables de groupe pourront voir les contributions des adhérents attachés à leurs groupes.

source: **Can group managers create contributions?** groups managers can create contributions on behalf of members of their groups.
es: **¿Pueden los administradores de grupo crear contribuciones?** los administradores de grupo pueden crear contribuciones en nombre de los miembros de sus grupos.
fr_fr: **Les responsables de groupes peuvent créer des contributions ?** les responsables de groupe pourront créer des contributions pour les adhérents attachés à leurs groupes.

source: **Can group managers see transactions?** groups managers can see transactions of members of their groups.
es: **¿Pueden los administradores de grupo ver las transacciones?** los administradores de grupo pueden ver las transacciones de los miembros de sus grupos.
fr_fr: **Les responsables de groupes peuvent voir les transactions ?** les responsables de groupe pourront voir les transactions des adhérents attachés à leurs groupes.

source: **Can group managers create transactions?** groups managers can create transactions on behalf of members of their groups.
es: **¿Pueden los administradores de grupo crear transacciones?** los administradores de grupo pueden crear transacciones en nombre de los miembros de sus grupos.
fr_fr: **Les responsables de groupes peuvent créer des transactions ?** les responsables de groupe pourront créer des transactions pour les adhérents attachés à leurs groupes.

source: Galette settings, rights tab
es: Ajustes de Galette, pestaña permisos
fr_fr: Préférences de Galette, onglet droits

source: E-Mail
es: Correo electrónico
fr_fr: Courriel

source: Sending email parameters:
es: Enviar parámetros del correo electrónico:
fr_fr: Paramètres d'envoi de courriels :

source: Galette settings, e-mail tab
es: Ajustes de Galette, pestaña correo electrónico
fr_fr: Préférences de Galette, onglet courriel

source: **Sender name**: name of the sender,
es: **Nombre de emisor**: nombre del emisor,
fr_fr: **Nom de l'expéditeur** : nom de l'expéditeur,

source: **Sender email**: email address of the sender,
es: **Correo electrónico de emisor**: correo electrónico del emisor,
fr_fr: **Courriel expéditeur** : adresse de courriel de l'expéditeur,

source: **Reply-to email**: reply email address. If empty, sender email will be used,
es: **Correo electrónico de respuesta**: correo electrónico de respuesta. Si está vacío, se utilizará el correo electrónico del emisor,
fr_fr: **Courriel de réponse** : l'adresse de courriel de réponse. Si elle est vide, l'adresse de l'expéditeur sera utilisée,

source: **Members administrator email**: email address on which inscription notifications will be send, you can set several addresses separated with comas,
es: **Correo electrónico del administrador de miembros**: dirección de correo electrónico a la que se enviarán las notificaciones de inscripción, puedes establecer varias direcciones separadas por comas,
fr_fr: **Courriel de l'administrateur** : l'adresse de courriel sur laquelle les notifications d'inscription seront envoyées, vous pouvez déclarer plusieurs adresses séparées par des virgules,

source: **Send emails to administrators**: whether to send emails to administrators on subscription,
es: **Enviar correo electrónico al administrador**: si enviar correos electrónicos a los administradores en la suscripción,
fr_fr: **Envoyer des courriels aux administrateurs** : s'il faut envoyer des courriels aux administrateurs lors de nouvelles inscriptions,

source: **Wrap text emails**: automatically wraps long lines in emails. If you disable this options, make sure to wrap yourself,
es: **Ajustar texto en correos electrónicos**: ajustar automáticamente la longitud de las líneas en los correos electrónicos. Si desactivas esta opción, asegúrate de ajustarlas por ti mismo,
fr_fr: **Scinder les courriels texte** : scinde automatiquement les longues lignes dans les courriels. Si vous désactivez cette option, vous devrez le faire vous même,

source: **Send emails to members**: whether to send emails to members when their information are updated or a contribution is created on their behalf,
es: **Enviar correos electrónicos a miembros**: si enviar correos electrónicos a los miembros cuando se actualice su información o se cree una contribución en su nombre,
fr_fr: **Envoyer un courriel aux adhérents ?** : indique s'il faut envoyer un courriel à l'adhérent lorsque sa fiche ou une contribution a été ajoutée ou modifiée,

source: **Activate HTML editor**: activate HTML format when sending emails (discouraged),
es: **Activar editor HTML**: activar el formato HTML cuando se envíen correos electrónicos (desaconsejado),
fr_fr: **Activer l'éditeur HTML** : active l'éditeur HTML lors de l'envoi de courriels (déconseillé),

source: **Emailing method**: method used to send emails:
es: **Método de envío de correo electrónico**: método utilizado para enviar correos electrónicos:
fr_fr: **Méthode d'envoi des courriels** : méthode utilisée pour envoyer les courriels :

source: **Emailing disabled**: no email will be send from Galette,
es: **Desactivar envío de correo electrónico**: no se enviarán correos electrónicos desde Galette,
fr_fr: **Envoi de courriel désactivé** : aucun courriel ne sera envoyé depuis Galette,

source: **PHP mail function**: uses the PHP ``mail()`` fonctions and related parameters (recommended when possible),
es: **Función mail de PHP**: utiliza la función ``mail()`` de PHP y sus parámetros relacionados (recomendado cuando sea posible),
fr_fr: **Fonction PHP mail** : utilise la fonction php ``mail()`` et les paramètres relatifs (recommandé si possible),
