Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/usermanual/recherche.po
Languages: ca, it

source: Search
ca: Cerca
it: Cerca

source: Every executed search will be conserved during your session. You can change a parameter or else, and come back to the list, you will find all your previous search parameters.
ca: Cada recerca executada es conservarà durant la teva sessió. Pots canviar un paràmetre o bé tornar a la llista on trobaràs tots els teus paràmetres de les cerques anteriors.
it: Ogni ricerca eseguita verrà conservata durante la sessione. Si può cambiare un parametro o altro, e tornare all'elenco, si troveranno tutti i propri parametri di ricerca precedenti.

source: Filtering members list
ca: Filtrar la llista de membres
it: Filtro dell'elenco dei membri

source: The form at the top of the members list allow you to make some search among members. The :ref:`advanced search <advsearch>` provides more criteria and possibilities.
ca: El formulari que apareix a la part superior de la llista de membres permet realitzar algunes recerques entre els membres. La :ref:`cerca avançada <advsearch>` proporciona més informació i possibilitats.
it: Il modulo in cima all'elenco dei membri consente di effettuare delle ricerche tra i membri. La :ref:`ricerca avanzata <advsearch>` fornisce più criteri e possibilità.

source: Filter members list
ca: Filtrar la llista de membres
it: Filtra elenco membri

source: You can filter on:
ca: Pots filtrar a:
it: Si può filtrare per:

source: a full text search on one of the following information:
ca: una recerca de text complet en una de les següents informacions:
it: una ricerca su tutto il testo su una delle seguenti informazioni:

source: name (first name, last name and nickname),
ca: nom (primer nom, cognom i sobrenom),
it: nome (nome, cognome e soprannome),

source: company name,
ca: nom de l'empresa,
it: nome azienda,

source: address (address, address continuation, zipcode, town and country),
ca: direcció (direcció, continuació de la direcció, codi postal, ciutat i país),
it: indirizzo (indirizzo, continuazione dell'indirizzo, codice postale, città e paese),

source: email and instant messaging addresses (email address, website URL, and all direct messenging addresses),
ca: adreces de correu electrònic i de missatgeria instantània (adreça de correu electrònic, URL del lloc web i totes les adreces de missatgeria directa),
it: indirizzi e-mail e di messaggistica istantanea (indirizzo e-mail, URL del sito Web e tutti gli indirizzi di messaggistica diretta),

source: job position,
ca: lloc de treball,
it: posizione lavorativa,

source: information (public information and - for administrators only - private information).
ca: informació (informació pública i -només per administradors- informació pivotant).
it: informazioni (pubbliche e - solo per gli amministratori - informazioni private).

source: a member status:
ca: un estatus de membre:
it: lo stato di un membro:

source: all members,
ca: tots els membres,
it: tutti i membri,

source: up to date members,
ca: membres al dia,
it: membri aggiornati,

source: closes expiries (members whose membership expires in 30 days)
ca: tanca els venciments (membres als quals la seva membresía expira en 30 dies)
it: scadenze prossime (membri la cui iscrizione scade tra 30 giorni)

source: latecomers,
ca: els que arriben tard,
it: ritardatari,

source: members whose never had a membership,
ca: membres que no tenen membresia,
it: membri che non hanno mai avuto un'iscrizione,

source: staff members,
ca: membres del personal,
it: membri dello staff,

source: administrators.
ca: administradors.
it: amministratori.

source: a status of the account:
ca: l'estat del compte:
it: uno stato dell'account:

source: all accounts,
ca: tots els comptes,
it: tutti gli account,

source: active accounts,
ca: comptes actius,
it: account attivi,

source: inactive accounts.
ca: comptes inactius.
it: account inattivi.

source: group affiliation,
ca: afiliació al grup,
it: affiliazione gruppi,

source: presence or absence of an email address.
ca: presència o absència d'una adreça de correu electrònic.
it: presenza o assenza di un indirizzo email.

source: All filters can be combined, giving you the ability to search among your active members whose have an email address and whose name contains a "a" ;)
ca: Tots els filtres poden combinar-se, això et permet buscar entre els teus membres actius que tinguin una adreça de correu electrònic i el nom contingui una "a";)
it: Tutti i filtri possono essere combinati, dando la possibilità di cercare tra i membri attivi che hanno un indirizzo email e il cui nome contiene la "a" ;)

source: Advanced search
ca: Cerca avançada
it: Ricerca Avanzata

source: Advanced search can be found in the main menu and propose an certain amount of fields types, related to members or their membership. The screen is separated into four parts (you can reduce individually):
ca: La cerca avançada es troba al menú principal i proposa una certa quantitat de tipus de camps, relacionats amb els membres o la seva membresia. La pantalla està separada en quatre parts (es pot reduir individualment):
it: La ricerca avanzata si trova nel menu principale e propone una certa quantità di tipi di campi, relativi ai membri o alla loro appartenenza. La schermata è divisa in quattro parti (che è possibile ridurre):

source: **simple search** which recall all filters present in the members list,
ca: ** Cerca simple ** recorda tots els filtres presents en la llista de membres,
it: **ricerca semplice** che richiama tutti i filtri presenti nell'elenco dei membri,

source: **advanced search** which proposes extra fields on members that can be of use,
ca: ** Cerca avançada ** proposa camps addicionals sobre els membres que poden ser d'utilitat,
it: **ricerca avanzata** che propone campi aggiuntivi che possono tornare utili sui membri,

source: **search in contributions** allowing search on members contributions,
ca: ** Cerca en les contribucions ** permet buscar a les contribucions dels membres,
it: **ricerca nei contributi** che consente la ricerca nei contributi dei membri,

source: **free search** which allow to select any member field possible, including dynamic fields, and which will automatically adapt to selected field. You can add and remove lines to refine search.
ca: ** Cerca lliure ** permet seleccionar qualsevol camp de membre possible, inclosos els camps dinàmics, i que s'adaptarà automàticament al camp seleccionat. Pots afegir i eliminar línies per afinar la cerca.
it: **ricerca libera** che consente di selezionare qualsiasi campo membro possibile, compresi i campi dinamici, e che si adatterà automaticamente al campo selezionato. È possibile aggiungere e rimuovere righe per affinare la ricerca.

source: Saved searches
ca: Recerques guardades
it: Ricerche salvate

source: Every search on members can be stored (with a name) in order to be executed again later. They are accessible only for their author.
ca: Cada recerca en els membres pot ser emmagatzemada (amb un nom) per ser executada de nou més tard. Només són accessibles per al seu autor.
it: Ogni ricerca sui membri può essere memorizzata (con un nome) per essere eseguita di nuovo in seguito. Sono accessibili solo al loro autore.

source: After you proceed a search ("simple" or "advanced"), just click on the "Save" button, and pick up a name.
ca: Després de procedir a una recerca ( "simple" o "avançada"), només cal fer clic al botó "Desa" i triar un nom.
it: Dopo aver effettuato una ricerca ("semplice" o "avanzata"), basta cliccare sul pulsante "Salva" e scegliere un nome.

source: Save a search
it: Salva una ricerca

source: You can find saved searches in the list:
ca: A la llista pots trobar les cerques guardades:
it: È possibile trovare le ricerche salvate nell'elenco:

source: Searches list
it: Elenco ricerche

source: From this list, you will be able to remove or execute again searches, and also see a detail of used criteria.
ca: Des d'aquesta llista, podràs eliminar o executar de nou les recerques, així com veure un detall dels criteris utilitzats.
it: Da questo elenco sarà possibile rimuovere o rieseguire le ricerche e visualizzare inoltre il dettaglio dei criteri utilizzati.
