Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/faq/index.po
Languages: es, fr_fr, it, ru, ta, uk

source: Frequently Asked Question (FAQ)
es: Preguntas frecuentes (FAQ)
fr_fr: Questions fréquentes (FAQ)
it: Domande ricorrenti (FAQ)
ru: Часто задаваемые вопросы (FAQ)
ta: அடிக்கடி கேட்கப்படும் கேள்வி (கேள்விகள்)
uk: Часто запитуване

source: What if Galette does not work?
es: ¿Qué pasa si Galette no funciona?
fr_fr: Que faire si Galette ne fonctionne pas ?
it: E se Galette non funziona?
ru: Что, если Galette не будет работать?
ta: கேலட் வேலை செய்யவில்லை என்றால் என்ன செய்வது?
uk: Що, якщо Galette не працюватиме?

source: Sometimes, after an update, a change on hosting, or a simple bug - even minor ones - may cause a fail in Galette. You may observe:
es: A veces, después de una actualización, un cambio en el alojamiento, o un simple error - incluso los menores - puede causar un fallo en Galette. Puede que observes:
fr_fr: Parfois, une mise à jour, une modification sur l'hébergement, ou un simple bogue - même mineurs - peuvent causer une erreur dans Galette. Vous pourriez observer :
it: A volte, un aggiornamento, un cambiamento sull'hosting o un semplice bug - anche di quelli minori - può causare il blocco di Galette. Potreste vedere che:
ru: Иногда после обновления, смены хостинга или простой ошибки - даже незначительной - в Galette может произойти сбой. Вы можете наблюдать:
ta: சில நேரங்களில், புதுப்பித்தலுக்குப் பிறகு, ஓச்டிங்கில் மாற்றம் அல்லது ஒரு எளிய பிழை - சிறியவை கூட - கேலட்டில் தோல்வியடையக்கூடும். நீங்கள் கவனிக்கலாம்:
uk: Іноді, після оновлення, зміни на хостингові або просто помилки - навіть незначної - може відбутися збій в роботі Galette. Ви можете спостерігати:

source: an error message is displayed,
es: se muestra un mensaje de error,
fr_fr: un message d'erreur est affiché,
it: viene visualizzato un messaggio di errore,
ru: появится сообщение об ошибке,
ta: பிழை செய்தி காட்டப்படும்,
uk: відображається повідомлення про помилку,

source: a blank page,
es: una página en blanco,
fr_fr: une page blanche,
it: una pagina bianca,
ru: чистый лист,
ta: ஒரு வெற்று பக்கம்,
uk: порожню сторінку,

source: In all cases, you **must check the logs**. Most of errors are stored in those files, it is a very good start point to understand the problem and potentially solve it.
es: En todos los casos, **debes revisar los registros**. La mayoría de los errores se almacenan en esos archivos, es un muy buen punto de partida para entender el problema y potencialmente resolverlo.
fr_fr: Dans tous les cas, vous **devez consulter les logs**. La plupart des erreurs sont stockées dans ces fichiers, c'est un très bon point de départ pour comprendre le problème, et éventuellement le résoudre.
it: In tutti i casi, **bisogna controllare i registri (log)**. La maggior parte degli errori vengono scritti in quei file; è un ottimo punto di partenza per capire il problema e per risolverlo.
ru: В любом случае вы **должны проверить журналы**. Большинство ошибок хранится в этих файлах, это очень хорошая отправная точка для понимания проблемы и ее потенциального решения.
ta: எல்லா சந்தர்ப்பங்களிலும், நீங்கள் ** பதிவுகளை சரிபார்க்க வேண்டும் **. பெரும்பாலான பிழைகள் அந்தக் கோப்புகளில் சேமிக்கப்படுகின்றன, இது சிக்கலைப் புரிந்துகொள்வதற்கும் அதைத் தீர்ப்பதற்கும் ஒரு நல்ல தொடக்க புள்ளியாகும்.
uk: У всіх випадках ви **маєте перевірити журнали**. Більшість помилок зберігається в файлах журналу, це дуже хороша відправна точка для розуміння проблеми та її потенційного рішення.

source: Galette logs are stored in the ``galette/data/log`` per default.
es: Los registros de Galette se almacenan en ``galette/data/log`` por defecto.
fr_fr: Les logs de Galette sont stockés dans le dossier ``galette/data/log`` par défaut.
it: I log di Galette vengono memorizzati per impostazione predefinita in ``galette/data/log``.
ru: По умолчанию журналы Galette хранятся в папке ``galette/data/log``.
ta: கேலட் பதிவுகள் இயல்புநிலைக்கு `` கேலட்/டேட்டா/லாக்`` இல் சேமிக்கப்படுகின்றன.
uk: Журнали Galette типово зберігаються в каталозі ``galette/data/log``.

source: :ref:`Enabling development mode <galettemodes>` will give you more information, and deactivate cache, that may help resolving your issue.
es: :ref:`Habilitando el modo de desarrollo <galettemodes>` obtendrá más información, y desactivará la caché, lo que puede ayudar a resolver su problema.
fr_fr: :ref:`Activer le mode développement <galettemodes>` vous donnera davantage d'informations et désactivera le cache, ce qui pourrait vous aider à résoudre votre problème.
it: :ref:`Abilitare la modalità di sviluppo <galettemodes>` vi darà maggiori informazioni, e disattivare la cache, può aiutare a risolvere il problema.
ru: :ref:`Enabling development mode <galettemodes>` даст вам больше информации и деактивирует кэш, что может помочь решить вашу проблему.
ta: :ref:`Enabling வளர்ச்சி பயன்முறை <galettemodes>` will give you more information, and deactivate cache, that சி-வைகாசி உதவி resolving your issue.
uk: :ref:`Enabling development mode <galettemodes>` надасть вам більше інформації та деактивує кеш, що може допомогти вирішити вашу проблему.

source: How to report a bug or ask for a feature?
es: ¿Cómo reportar un error o solicitar una función?
fr_fr: Comment rapporter un bogue ou demander une fonctionnalité ?
it: Come segnalare un difetto o chiedere di aggiungere una funzionalità?
ru: Как сообщить об ошибке или попросить о возможности?
ta: ஒரு பிழையைப் புகாரளிப்பது அல்லது ஒரு அம்சத்தைக் கேட்பது எப்படி?
uk: Як повідомити про помилку або попросити про нову можливість?

source: Bugs reports as well as RFE (Request For Enhancement) must be done on the `Galette tracker <https://bugs.galette.eu/projects/galette>`_, for Galette itself, all official plugins and also documentation.
es: Los informes de errores, así como la RFE (Solicitud de mejora) deben realizarse en el `Galette tracker <https://bugs.galette.eu/projects/galette>`_, para la propia Galette, todos los complementos oficiales y también la documentación.
fr_fr: Les rapports de bogues et RFE (Request For Enhancement) doivent être effectués sur le `tracker de Galette <https://bugs.galette.eu/projects/galette>`_, pour Galette elle même, tous les plugins officiels et aussi pour la documentation.
it: Le segnalazioni di bug e RFE (Request For Enhancement) devono essere effettuate sul `tracker di Galette <https://bugs.galette.eu/projects/galette>`_, per Galette stessa, per tutti i plugin ufficiali e anche per la documentazione.
ru: Сообщения об ошибках, а также RFE (Запрос на улучшение) должны быть сделаны на `Galette трекере <https://bugs.galette.eu/projects/galette>`_, для самой Galette, всех официальных плагинов, а также документации.
ta: பிழைகள் அறிக்கைகள் மற்றும் RFE (மேம்பாட்டுக்கான கோரிக்கை) `கேலட் டிராக்கர் <https://bugs.galette.eu/projects/galette> _, கேலட்டிற்காக, அனைத்து அதிகாரப்பூர்வ செருகுநிரல்களும் ஆவணங்களும் செய்யப்பட வேண்டும்.
uk: Звіти про помилки, а також RFE (Запити на покращення) необхідно надсилати на `трекер Galette <https://bugs.galette.eu/projects/galette>`_, для самої Galette, усіх офіційних плагінів, а також документації.

source: Unless you are sure you know, please de not attribute the ticket and do not set target version. It will be done when it will be took into account.
es: A menos que esté seguro de saberlo, no atribuya el ticket y no establezca la versión de destino. Se hará cuando se tenga en cuenta.
fr_fr: À moins d'être certain de ce que vous faites, merci de ne pas attribuer le ticket et de ne pas définir la version cible. Cela sera fait lorsque le ticket sera pris en compte.
it: A meno che non siate veramente certi, è meglio non attribuire il ticket e non impostare la versione di destinazione. Verrà fatto quando la segnalazione verrà presa in carico.
ru: Если вы не уверены, что знаете, пожалуйста, не приписывайте билет и не устанавливайте целевую версию. Это будет сделано, когда это будет принято во внимание.
ta: உங்களுக்குத் தெரியும் என்று உங்களுக்குத் தெரியாவிட்டால், தயவுசெய்து டிக்கெட்டைக் கூறவில்லை மற்றும் இலக்கு பதிப்பை அமைக்க வேண்டாம். அது எப்போது கணக்கில் எடுத்துக்கொள்ளப்படும்.
uk: Якщо ви не впевнені, що знаєте, будь ласка, не створюйте пропозицію і не встановлюйте цільову версію. Це буде зроблено, коли це буде взято до уваги.

source: If you have doubts, feel free to ask your questions on mailing lists ;)
es: Si tienes dudas, no dudes en hacer tus preguntas en las listas de correo ;)
fr_fr: Si vous avez des doutes, n'hésitez pas à poser vos questions sur les listes de diffusion ;)
it: Nel dubbio, chiedete alla mailing list ;)
ru: Если у вас есть сомнения, не стесняйтесь задавать свои вопросы в списках рассылки ;)
ta: உங்களுக்கு ஐயம் இருந்தால், அஞ்சல் பட்டியல்களில் உங்கள் கேள்விகளைக் கேட்க தயங்க;)
uk: Якщо у вас є сумніви, не соромтеся поставити свої питання в списках розсилання ;)

source: Report a bug
es: Reportar un error
fr_fr: Rapporter un bogue
it: Segnalare un difetto
ru: Сообщить об ошибке
ta: ஒரு பிழையைப் புகாரளிக்கவும்
uk: Повідомити про помилку

source: Please, do not forget to:
es: Por favor, no lo olvides:
fr_fr: S'il vous plaît, n'oubliez pas de :
it: Non dimenticate di:
ru: Пожалуйста, не забывайте:
ta: தயவுசெய்து, மறக்க வேண்டாம்:
uk: Будь ласка, не забувайте:

source: tell us the Galette version you are using,
es: díganos la versión de Galette que está utilizando,
fr_fr: nous dire quelle version de Galette vous utilisez,
it: indicare la versione Galette in uso,
ru: расскажите нам, какую версию Galette вы используете,
ta: நீங்கள் பயன்படுத்தும் கேலட் பதிப்பை எங்களிடம் கூறுங்கள்,
uk: повідомляйте нам версію Galette, якою ви користуєтесь,

source: be clear and concise,
es: ser claro y conciso,
fr_fr: être clair et concis,
it: in modo chiaro e conciso,
ru: Будьте четкими и лаконичными,
ta: தெளிவாகவும் சுருக்கமாகவும் இருங்கள்,
uk: пишіть чітко та змістовно,

source: to provide all required information in order to reproduce the issue
es: proporcionar toda la información necesaria para reproducir el problema
fr_fr: fournir toutes les informations pour reproduire le problème
it: fornire tutte le informazioni necessarie per riprodurre il problema
ru: предоставить всю необходимую информацию для воспроизведения проблемы
ta: சிக்கலை இனப்பெருக்கம் செய்வதற்காக தேவையான அனைத்து தகவல்களையும் வழங்க
uk: надавайте всі необхідні відомості для відтворення проблеми

source: to provide related logs entries.
es: para proporcionar entradas de registro relacionadas.
fr_fr: de fournir les entrées de logs adéquates.
it: fornire le relative voci di log.
ru: чтобы предоставить соответствующие записи в журнале.
ta: தொடர்புடைய பதிவுகள் உள்ளீடுகளை வழங்க.
uk: надавайте відповідні записи журналів.

source: Request For Enhancement
es: Solicitud de mejora
fr_fr: Demande de fonctionnalités
it: Richieste di miglioramento
ru: Запрос на улучшение
ta: விரிவாக்கத்திற்கான கோரிக்கை
uk: Запит на поліпшення

source: Make sure to be precise as well on RFEs. Developers may not guess what you have in mind, you have to explain them, event if this seems obvious to you ;) Requested enhancements are tagged as "Souhaits" (whishes, in french), and moved by developers when work begins most of the time.
es: Asegúrese de ser preciso también en los RFE. Los desarrolladores no pueden adivinar lo que tienes en mente, tienes que explicárselo, aunque te parezca obvio ;) Las mejoras solicitadas se etiquetan como "Souhaits" (deseos, en francés), y son trasladadas por los desarrolladores cuando comienza el trabajo la mayoría de las veces.
fr_fr: Assurez vous d'être précis pour les demandes d'évolution également. Les développeurs peuvent ne pas deviner ce que vous avez à l'esprit, vous devez leur expliquer, même si ça vous semble évident ;) Les demandes dévolution sont marquées comme « Souhaits », et déplacées par les développeurs lorsque le travail commence.
it: Assicurarsi di essere precisi anche sulle RFE. Gli sviluppatori non possono indovinare cosa avete in mente, bisogna spiegarsi bene, anche se la funzione ci sembra ovvia ;) I miglioramenti richiesti sono contrassegnati come "Souhaits" (desideri, in francese), e spostati dagli sviluppatori, in genere quando cominciano a lavorare.
ru: Убедитесь, что в RFE вы также точны. Разработчики могут не догадаться, что вы имеете в виду, и вы должны объяснить им, если вам кажется, что это очевидно ;) Запрашиваемые улучшения помечаются как "Souhaits" (пожелания, по-французски), и чаще всего перемещаются разработчиками, когда начинается работа.
ta: RFE களில் துல்லியமாக இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். உருவாக்குபவர்கள் உங்கள் மனதில் இருப்பதை யூகிக்கக்கூடாது, நீங்கள் அவற்றை விளக்க வேண்டும், இது உங்களுக்கு தெளிவாகத் தெரிந்தால் நிகழ்வு;) கோரப்பட்ட மேம்பாடுகள் "ச ou ல்ச்" (வைச்கள், பிரெஞ்சு மொழியில்) எனக் குறிக்கப்படுகின்றன, மேலும் வேலை தொடங்கும் போது டெவலப்பர்களால் நகர்த்தப்படும் நேரம்.
uk: Переконайтеся, що в запиті на поліпшення ви також точні. Розробники можуть не здогадатися, що ви маєте на увазі, вам доведеться пояснити їм, навіть якщо це здається вам очевидним;) Запрошувані поліпшення позначаються як "Souhaits" (побажання, французькою мовою), і в більшості випадків переміщаються розробниками, коли починається робота.

source: Once you made your whishes, you can `submit it to a vote <https://vote.galette.eu/>`_, most wanted features may catch devs attention.
es: Una vez que hayas hecho tus deseos, puedes `someterlo a votación <https://vote.galette.eu/>`_, las características más deseadas pueden llamar la atención de los desarrolladores.
fr_fr: Une fois votre souhait exprimé, vous pouvez `le soumettre au vote <https://vote.galette.eu/>`_, les demandes les plus plébiscitées pourraient retenir l'attention des développeurs.
it: Una volta espressi i propri desideri, si può `sottoporli a votazione <https://vote.galette.eu/>`_, le caratteristiche più richieste possono catturare l'attenzione degli sviluppatori.
ru: После того, как вы высказали свои пожелания, вы можете `отправить их на голосование <https://vote.galette.eu/>`_, наиболее желаемые функции могут привлечь внимание разработчиков.
ta: உங்கள் விருப்பத்தை நீங்கள் செய்தவுடன், நீங்கள் அதை ஒரு வாக்குக்கு சமர்ப்பிக்கலாம் <https://vote.galette.eu/> `_, பெரும்பாலான விரும்பிய நற்பொருத்தங்கள் கவனத்தை ஈர்க்கக்கூடும்.
uk: Після того, як ви висловили свої побажання, ви можете `подати їх на голосування <https://vote.galette.eu/>`_, найбільш бажані можливості можуть привернути увагу розробників.

source: How to search in lists archives?
es: ¿Cómo buscar en los archivos de las listas?
fr_fr: Comment chercher dans les archives des listes ?
it: Come cercare negli archivi delle mailing list?
ru: Как искать в архивах списков?
ta: பட்டியல்கள் காப்பகங்களில் தேடுவது எப்படி?
uk: Як шукати в архівах списків?

source: Mailing lists are the main communication channel for Galette, from its beginnings.
es: Las listas de correo son el principal canal de comunicación de Galette, desde sus inicios.
fr_fr: Les listes de diffusion sont le canal principal de communication pour Galette, depuis ses débuts.
it: Le mailing list sono il principale canale di comunicazione per Galette, fin dai suoi inizi.
ru: Списки рассылки - основной канал коммуникации для Galette с самого начала ее существования.
ta: அஞ்சல் பட்டியல்கள் அதன் தொடக்கத்திலிருந்து கேலட்டின் முக்கிய தகவல்தொடர்பு சேனலாகும்.
uk: Списки розсилання є основним каналом комунікації для служби Galette з самого початку її існування.

source: See `contact page <https://galette.eu/site/contact#mailing-lists>`_ for more information.
es: Consulte `página de contacto <https://galette.eu/site/contact#mailing-lists>`_ para obtener más información.
fr_fr: Consultez `la page de contact <https://galette.eu/site/contact#mailing-lists>`_ pour plus d'informations .
it: Per ulteriori informazioni, consultare la pagina `contatti <https://galette.eu/site/contact#mailing-lists>`_.
ru: Дополнительную информацию см. `на странице <https://galette.eu/site/contact#mailing-lists>`_.
ta: மேலும் தகவலுக்கு `தொடர்பு பக்கம் <https://galette.eu/site/contact#mailing-lists> _ _ ஐப் பார்க்கவும்.
uk: Див. `сторінку контактів <https://galette.eu/site/contact#mailing-lists>`_ для отримання додаткової інформації.

source: The most simple and reliable way to `search on past Galette related discussion <https://www.mail-archive.com/search?l=all&q=galette&a=1>`_ is to make a query on mail archive services.
es: La forma más sencilla y fiable de `buscar en discusiones anteriores relacionadas con Galette <https://www.mail-archive.com/search?l=all&q=galette&a=1>`_ es hacer una consulta en los servicios de archivo de correo.
fr_fr: Le moyen le plus simple et le plus fiable de `chercher dans les discussions passées liées à Galette <https://www.mail-archive.com/search?l=all&q=galette&a=1>`_ est d'effectuer une requêtes via les services de mail archive.
it: Il modo più semplice e affidabile per `cercare una discussione relativa a Galette nel passato <https://www.mail-archive.com/search?l=all&q=galette&a=1>`_ è quello di interrogare il servizio di archiviazione della posta.
ru: Самый простой и надежный способ `поискать в прошлом обсуждения, связанные с Galette <https://www.mail-archive.com/search?l=all&q=galette&a=1>`_ - это сделать запрос к почтовым архивным службам.
ta: கடந்த கால கேலட் தொடர்பான விவாதத்தைத் தேடுவதற்கான மிக எளிய மற்றும் நம்பகமான வழி <https://www.mail-archive.com/search?l=all&q=galete&a=1> `_ அஞ்சல் காப்பக சேவைகளில் வினவலை உருவாக்குவது.
uk: Найпростіший і найнадійніший спосіб `пошуку в минулих обговореннях, пов'язаних з Galette <https://www.mail-archive.com/search?l=all&q=galette&a=1>`_ – це зробити запит у сервісах архівування пошти.

source: How to use same email address for several members?
es: ¿Cómo utilizar la misma dirección de correo electrónico para varios miembros?
fr_fr: Comment utiliser une même adresse de courriel pour plusieurs adhérents ?
it: Come utilizzare lo stesso indirizzo email per più membri?
ru: Как использовать один и тот же адрес электронной почты для нескольких пользователей?
ta: பல உறுப்பினர்களுக்கு ஒரே மின்னஞ்சல் முகவரியை எவ்வாறு பயன்படுத்துவது?
uk: Як використовувати одну е-пошту для кількох членів?

source: This is a very frequent question; many would love to do that...
es: Esta es una pregunta muy frecuente; a muchos les encantaría hacerlo...
fr_fr: C'est une question très fréquente, beaucoup souhaiteraient pouvoir faire ça...
it: Questa è una domanda molto frequente; molti vorrebbero farlo ma...
ru: Это очень частый вопрос; многие хотели бы сделать это...
ta: இது மிகவும் அடிக்கடி கேள்வி; பலர் அதைச் செய்ய விரும்புகிறார்கள் ...
uk: Це дуже часте питання; багато хто хотів би це зробити...

source: **This is not possible.**
es: **Esto no es posible.**
fr_fr: **Ce n'est pas possible.**
it: **Non è possibile.**
ru: **Это невозможно.**
ta: ** இது சாத்தியமில்லை. **
uk: **Це неможливо.**

source: Indeed, mail addresses must be unique in the database. It is a choice for the project on which several features are built:
es: En efecto, las direcciones de correo deben ser únicas en la base de datos. Es una opción para el proyecto sobre la que se construyen varias características:
fr_fr: En effet, les adresses de courriel doivent être uniques dans la base de données. C'est un choix du projet sur lequel plusieurs fonctionnalités reposent :
it: Gli indirizzi di posta devono essere unici nel database. È una scelta progettuale sulla quale si appoggiano diverse funzioni:
ru: Действительно, почтовые адреса должны быть уникальными в БД. Это выбор для проекта, на котором построено несколько функций:
ta: உண்மையில், அஞ்சல் முகவரிகள் தரவுத்தளத்தில் தனித்துவமாக இருக்க வேண்டும். பல நற்பொருத்தங்கள் கட்டப்பட்ட திட்டத்திற்கு இது ஒரு தேர்வாகும்:
uk: Дійсно, е-поштові адреси повинні бути неповторюваними в базі даних. Це вибір для проєкту, на якому побудовано кілька функцій:

source: lost password (since... always or almost),
es: contraseña perdida (desde... siempre o casi),
fr_fr: récupération du mot de passe (depuis... toujours ou presque),
it: password persa (dal momento che... succede spesso o quasi),
ru: забытый пароль (с тех пор как... всегда или почти),
ta: கடவுச்சொல் இழந்தது (முதல் ... எப்போதும் அல்லது கிட்டத்தட்ட),
uk: втрачений пароль (з тих пір як... завжди або майже),

source: login (since Galette 0.9),
es: inicio de sesión (desde Galette 0.9),
fr_fr: la connexion (depuis Galette 0.9),
it: login (da Galette 0.9),
ru: логин (начиная с версии Galette 0.9),
ta: உள்நுழைவு (கேலட் 0.9 முதல்),
uk: логін (починаючи з Galette 0.9),

source: Making them non uniques is not a solution we want to rely on. This would be complicated, and should be source of many bugs.
es: Hacerlos no únicos no es una solución en la que queramos confiar. Esto sería complicado, y sería fuente de muchos bugs.
fr_fr: Les rendre non uniques n'est pas une solution que nous souhaitons mettre en œuvre. Ce serait compliqué, et source de nombreux bogues.
it: Renderle non univoche non è una soluzione fattibile. Sarebbe complicato da gestire, e fonte di molti possibili malfunzionamenti.
ru: Сделать их не уникальными - не то решение, на которое мы хотим полагаться. Это будет сложно и повлечет за собой множество ошибок.
ta: அவற்றை தனித்துவமற்றதாக மாற்றுவது நாம் நம்ப விரும்பும் ஒரு தீர்வு அல்ல. இது சிக்கலானதாக இருக்கும், மேலும் பல பிழைகள் மூலமாக இருக்க வேண்டும்.
uk: Зробити їх повторюваними - це не те рішення, на яке ми хочемо покладатися. Це буде складно і спричинить за собою безліч помилок.

source: However, it is possible in Galette to :ref:`link several members <linkmembers>`. That way, some information such as email and postal addresses will be retrieved from the parent member if missing.
es: Sin embargo, en Galette es posible :ref:`vincular varios miembros <linkmembers>`. De este modo, algunos datos como el correo electrónico y las direcciones postales se recuperarán del miembro principal si faltan.
fr_fr: Néanmoins, il est possible dans Galette de :ref:`lier plusieurs adhérents <linkmembers>`. De cette manière, les informations telles que les adresse de courriel ou postale seront récupérées depuis la fiche parent si elles manquent.
it: Tuttavia, in Galette è possibile :ref:`collegare più membri assieme <linkmembers>`. In questo modo, alcune informazioni come gli indirizzi e-mail e postali saranno recuperabili dal membro genitore se mancanti.
ru: Однако в Galette можно :ref:`link several members <linkmembers>`. Таким образом, некоторые сведения, такие как адреса электронной почты и почтовые адреса, будут получены из родительского члена, если они отсутствуют.
ta: இருப்பினும், இது கேலட்டில் சாத்தியமாகும்: ref: `பல உறுப்பினர்களை இணைக்கவும் <இணைப்புமெம்பர்>`. அந்த வகையில், மின்னஞ்சல் மற்றும் அஞ்சல் முகவரிகள் போன்ற சில தகவல்கள் காணாமல் போனால் பெற்றோர் உறுப்பினரிடமிருந்து மீட்டெடுக்கப்படும்.
uk: Однак в Galette можна :ref:`зв'язати кілька членів <linkmembers>`. Таким чином, деякі відомості, такі як адреси е-пошти та звичайні поштові адреси, будуть отримані з батьківського члена, якщо вони відсутні.

source: This allows finally to use a unique email address for several members in database; but they are not duplicates in database.
es: Esto permite finalmente utilizar una única dirección de correo electrónico para varios miembros en la base de datos; pero no son duplicados en la base de datos.
fr_fr: Cela permet au final d'utiliser une même adresse de courriel pour plusieurs adhérents en base ; mais sans que ce soit dupliqué dans la base de données.
it: Questo permette infine di utilizzare un indirizzo email unico per diversi membri nel database; ma non vengono duplicati nel database.
ru: Это позволяет, наконец, использовать уникальный адрес электронной почты для нескольких пользователей в БД; при этом они не будут дублироваться в БД.
ta: தரவுத்தளத்தில் பல உறுப்பினர்களுக்கு தனித்துவமான மின்னஞ்சல் முகவரியைப் பயன்படுத்த இது இறுதியாக அனுமதிக்கிறது; ஆனால் அவை தரவுத்தளத்தில் நகல்கள் அல்ல.
uk: Це дозволяє, нарешті, використовувати неповторювану адресу е-пошти для декількох членів в базі даних; але вони не є подвійниками в базі даних.
