Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/installation/galette.po
Languages: es, it, uk

source: Installation
es: Instalación
it: Installazione
uk: Установлення

source: Galette installation is a web based process (once :doc:`preparation steps <preparation>` are done). Go to http://localhost/galette. :doc:`Update process <update>` is documented separately.
es: La instalación de Galette es un proceso basado en la web (una vez que los :doc:`pasos previos <preparation>` estén hechos). Dirígete a http://localhost/galette. :doc:`El proceso de actualización <update>` está documentado por separado.
it: L'installazione di Galette è un processo basato sul web (una volta che tutti i :doc:`passi preparativi <preparation>` siano stati effettuati). Consultare http://localhost/galette. :doc:`Il processo di aggiornamento <update>` è documentato separatamente.
uk: Установлення Galette - це вебпроцес (після виконання: doc:`підготовчих кроків <preparation>`). Перейдіть на http://localhost/galette. :doc:`Оновлення <update>` документоване окремо.

source: You should rely on latest stable release, but it is also possible (if your know what you are doing, this is more complex for non developers!) grab it from :doc:`source code <../source_code>`
es: Debe confiar en la última versión estable, pero también es posible (si sabes lo que estás haciendo, ¡esto es más complejo para los no desarrolladores!) obtenerlo desde :doc:`código fuente <../source_code>`
it: Sarebbe meglio utilizzare l'ultimo rilascio stabile, ma è anche possibile (se sapete che cosa state facendo, è molto più difficile per chi non è uno sviluppatore!) prelevare direttamente i :doc:`codici sorgenti <../source_code>`
uk: Ви повинні покладатися на останній сталий випуск, але також можливо (якщо ви знаєте, що робите, це складніше для НЕ розробників!) взяти його з :doc:`джерельного коду <../source_code>`

source: Checks
es: Comprobaciones
it: Controlli
uk: Чеки

source: Please check the following if you want Galette to install without problems:
es: Por favor, comprueba lo siguiente si quieres que Galette se instale sin problemas:
it: Controllare quanto segue se si desidera installare Galette senza problemi:
uk: Будь ласка, перевірте наступне, якщо ви хочете, щоб Galette встановлювався без ускладнень:

source: your PHP version is high enough,
es: tu versión de PHP es lo suficientemente alta,
it: che la versione PHP sia abbastanza aggiornata,
uk: ваша версія PHP достатньо висока,

source: PHP timezone is set (required since PHP 5.3),
es: se establece la zona horaria de PHP (obligatoria desde PHP 5.3),
it: che il fuso orario PHP sia impostato (richiesto da PHP 5.3 in poi),
uk: встановлено часовий пояс PHP (потрібно з PHP 5.3),

source: all required PHP extensions are installed and loaded,
es: todas las extensiones necesarias de PHP son instaladas y cargadas,
it: che tutte le estensioni PHP richieste siano installate e caricate,
uk: всі необхідні розширення PHP встановлені та завантажені,

source: some directories requires write access.
es: algunas carpetas necesitan permiso de escritura.
it: alcune cartelle necessitano dei permessi di scrittura.
uk: деякі каталоги вимагають доступу на запис.

source: If one of the mandatory extensions is missing or if the timezone is not set, please ask you system administrator. Galette does not require any "exotic" extension.
es: Si falta una de las extensiones necesarias o si no se ha establecido la zona horaria, por favor, contacta con tu administrador de sistema. Galette no necesita ninguna extensión "exótica".
it: Se una delle estensioni obbligatorie è mancante o se il fuso orario non è impostato, chiedere l'amministratore di sistema. Galette non richiede alcuna estensione "esotica".
uk: Якщо одне з обов'язкових розширень відсутнє або не встановлено часовий пояс, зверніться до системного адміністратора. Galette не вимагає ніяких "екзотичних" розширень.

source: The very first installation step will check those points, and will warn you if something gets wrong.
es: El primer paso de la instalación comprobará esos puntos, y te advertirá si algo sale mal.
it: Il primo passo di installazione controllerà questi punti, e avvertirà se troverà qualcosa di sbagliato.
uk: Найперший крок установлення перевірить ці пункти та попередить вас, якщо щось піде не так.

source: If all :ref:`the installation steps <preparation>` has been properly followed, directories ACLs should be correct, please refer to :ref:`files ACLs section <droitsfichiers>` and refresh page in your browser.
es: Si todos :ref:`los pasos de la instalación <preparation>` se han seguido adecuadamente, las carpetas ACLs deberían ser correctos, por favor consulta :ref:`la sección de archivos ACLs <droitsfichiers>` y recarga la página en tu navegador.
it: Se tutte :ref:`le fasi di installazione <preparation>` sono state seguite correttamente, e le ACL delle cartelle sono corrette, fare riferimento a :ref:`selezione ACL file <droitsfichiers>` e aggiornare la pagina nel browser.
uk: Якщо всі :ref: `кроки встановлення <preparation>` були виконані правильно, ACL (списки прав доступу) каталогів повинні бути правильними, будь ласка, зверніться до :ref:`розділу файлів ACL (списків контролю доступу)<droitsfichiers>` і оновіть сторінку в вашому мережевому оглядачі.

source: Installation type
es: Tipo de instalación
it: Tipo di installazione
uk: Тип установлення

source: Next screen ask you for installation type. You'll choose beetween "New installation" or "Update". Several of the steps that will follow will be specific to the type you will choose here.
uk: На наступному екрані вам буде запропоновано вибрати тип установлення. Вам належить вибрати між "Нове встановлення" й "Оновлення". Деякі з наступних кроків залежатимуть від типу, який ви виберете тут.

source: Database
es: Base de datos
it: Banca dati
uk: База даних

source: First of all, make sure the database exists, and prepare all required information:
es: Lo primero, asegúrate que la base de datos existe, y prepara toda la información necesaria:
it: Prima di tutto, assicurarsi che il database esista e preparare tutte le informazioni necessarie:
uk: Перш за все, переконайтесь, що база даних існує, і підготуйте всі необхідні дані:

source: host name
es: nombre del servidor
it: nome host
uk: назва хоста

source: database user name
es: nombre de usuario de la base de datos
it: nome utente database
uk: ім'я користувача бази даних

source: database user password
es: contraseña de usuario de la base de datos
it: password utente database
uk: пароль користувача бази даних

source: database name
es: nombre de la base de datos
it: nome database
uk: назва бази даних

source: database type (MariaDB/MySQL or PostgreSQL)
es: tipo de base de datos (MariaDB/MySQL o PostgreSQL)
it: tipo database (MariaDB/MySQL o PostgreSQL)
uk: тип бази даних (MariaDB/MySQL або PostgreSQL)

source: Create database
uk: Створити базу даних

source: **Never use database root user!**
uk: **Ніколи не використовуйте кореневого (root) користувача бази даних!**

source: For security reasons, it is stongly advised to rely on a specific user for Galette database, and give him only requested access on the single Galette database.
uk: Задля безпеки настійно пораджено покладатися на конкретного користувача для бази даних Galette і надавати йому тільки запитуваний доступ до єдиної бази даних Galette.

source: For the example, we will use a database named `mygalette` with a user `mygaletteuser` with `mypass` as password.
uk: Для прикладу ми використовуватимемо базу даних `mygalette` з користувачем `mygaletteuser` і `mypass` в якості пароля.

source: Those commands may vary, please refer to `MariaDB <https://mariadb.com/kb/en/library/documentation/>`_ or `PostgreSQL <https://docs.postgresqlfr.org>`_ documentations, or use a graphical tool:
uk: Ці команди можуть відрізнятися, будь ласка, зверніться до документації `MariaDB <https://mariadb.com/kb/en/library/documentation/>`_ чи `PostgreSQL <https://docs.postgresqlfr.org>`_ або використовуйте графічний засіб:

source: `phpMyAdmin <https://www.phpmyadmin.net>`_ for MariaDB ;
uk: `phpMyAdmin <https://www.phpmyadmin.net>`_ для MariaDB ;

source: `phpPgAdmin <http://phppgadmin.sourceforge.net>`_ or `PgAdmin <https://www.pgadmin.org/download/?lang=fr_FR>`_ for PostgreSQL.
uk: `phpPgAdmin <http://phppgadmin.sourceforge.net>`_ чи `PgAdmin <https://www.pgadmin.org/download/`_ для PostgreSQL.

source: Database parameters
es: Parámetros de base de datos
it: Parametri del database
uk: Параметри бази даних

source: On that screen, select your database type, and enter hostname, database name, user name and password. Tables prefix is usefull if you do not have a Galette dedicated database, default proposal should be ok but you can choose what you want :)
es: En esa pantalla, selecciona tu tipo de base de datos, e introduce un nombre de servidor, un nombre de base datos, un nombre de usuario y contraseña. El prefijo de las tablas es útil si no tienes una base de datos dedicada de Galette, la propuesta por defecto debería estar bien pero puedes elegir lo que quieras :)
it: Su quella schermata, selezionare il tipo di database e inserire il nome host, il nome del database, nome utente e password. Il prefisso delle tabelle è utile se non si dispone di un database dedicato a Galette, la proposta predefinita dovrebbe essere ok ma è possibile scegliere quello che si vuole :)
uk: На цьому екрані виберіть тип бази даних, введіть назву хоста, назву бази даних, ім'я користувача і пароль. Префікс таблиць корисний, якщо у вас немає виділеної бази даних Galette, типова пропозиція має бути в порядку, але ви можете вибрати те, що хочете :)

source: This step is the same for installation and update processes. If a configuration file already exists, Galette will grab the information to pre fill the form (not for the password). When upgrading, double check the prefix fit the existing one.
es: Este paso es el mismo para los procesos de instalación y actualización. Si ya existe un archivo de configuración, Galette tomará la información para rellenar previamente el formulario (no para la contraseña). Al actualizar, comprueba bien que el prefijo coincide con el existente.
it: Questo passaggio è lo stesso per i processi di installazione e di aggiornamento. Se esiste già un file di configurazione, Galette prenderà le informazioni per compilare il modulo (non per la password). Quando si aggiorna, ricontrollare che il prefisso corrisponda a quello esistente.
uk: Цей крок однаковий для процесів установлення та оновлення. Якщо файл конфігурації вже існує, Galette візьме відомості для попереднього заповнення форми (не для пароля). Під час оновлення двічі перевірте відповідність наявного префікса.

source: Next screen will try to connect to the database using provided elements, than it will check database rights are correct (user can add/remove/alter tables, and can add/remove/edit rows, ...).
es: La siguiente pantalla intentará conectar a la base de datos usando los elementos suministrados, después comprobará que los permisos de la base de datos son correctos (el usuario puede añadir/eliminar/modificar las tablas, y puede añadir/eliminar/editar filas, ...).
it: La schermata successiva cercherà di connettersi al database utilizzando gli elementi forniti, controllerà che i diritti del database siano corretti (che l'utente possa aggiungere/rimuovere/alterare tabelle, e possa aggiungere/rimuovere/modificare righe, ...).
uk: На наступному екрані буде зроблено спробу під'єднання до бази даних з використанням наданих елементів, після чого будуть перевірені права на базу даних (користувач може додавати/ вилучати/змінювати таблиці, може додавати/вилучати/редагувати рядки тощо).

source: If there is a connexion error, go back to previous step, fix your setup and try again. If you see rights issues, get them fixed on your server and use the "Refresh" button.
es: Si hay un error de conexión, vuelve al paso anterior, corrige tu configuración e inténtalo de nuevo. Si ves un problema de permisos, corrígelos en tu servidor y utiliza el botón "Recargar".
it: Se c'è un errore di connessione, tornare al passo precedente, correggere la configurazione e riprovare. Se ci sono problemi di permessi, sistemarli e premere il pulsante "Ricarica".
uk: Якщо виникла помилка підключення, поверніться до попереднього кроку, виправте налаштування і спробуйте ще раз. Якщо ви бачите проблеми з правами, виправте їх на своєму сервері та скористайтеся кнопкою "Оновити".

source: Create tables
es: Crear tablas
it: Crea tabelle
uk: Створити таблиці

source: Those instructions are only for installation. When updating, a database already exists.
es: Esas instrucciones son solo para la instalación. Al actualizar, la base de datos ya existe.
it: Queste istruzioni sono solo per l'installazione. Nell'aggiornamento, esiste già un database.
uk: Ці вказівки відносяться тільки до встановлення. Під час оновлення база даних уже наявна.

source: If a connection can be established to the database, and all is correct; installer will now create the tables, and insert default values. You can show created tables from any graphical tool or in command line:
es: Si se puede establecer una conexión con la base de datos y todo es correcto, el instalador creará las tablas e insertará los valores por defecto. Puedes mostrar las tablas creadas desde cualquier herramienta gráfica o en una línea de comandos:
it: Se una connessione può essere stabilita nel database, e tutto è corretto, l'installatore creerà le tabelle e inserirà i valori predefiniti. È possibile visualizzare le tabelle create, con qualsiasi strumento grafico o a riga di comando:
uk: Якщо з'єднання з базою даних установлене і все в порядку, установник створить таблиці та вставить в них типові значення. Ви можете показати створені таблиці з будь-якого графічного засобу або з командного рядка:

source: Admin parameters
es: Parámetros de administrador
it: Parametri amministratore
uk: Параметри адміністратора

source: This screen is displayed from installation only. When updating, super admin user is already existing.
es: Esta pantalla solo se muestra para la instalación. Al actualizar, el usuario super administrador ya existe.
it: Questa schermata viene visualizzata solo dall'installazione. Quando si aggiorna, l'utente super amministratore esiste già.
uk: Цей екран відображається лише з установлення. Під час оновлення користувач суперадміністратора вже наявний.

source: Next screen will ask you for information to create the Galette super admin user. Using Galette, you can set some members as administrators, but the one created at installation time is not a member, cannot be removed, and has some extra rights.
es: La siguiente pantalla te pedirá información para crear el usuario super administrador de Galette. Con Galette, puedes establecer algunos miembros como administradores, pero el que se crea en el momento de la instalación no es miembro, no se puede eliminar y tiene algunos permisos adicionales.
it: La schermata successiva chiederà informazioni per creare l'utente super amministratore di Galette. Usando Galette, è possibile impostare alcuni membri come amministratori, ma quello creato al momento dell'installazione non è un membro, non può essere rimosso, e ha alcuni diritti extra.
uk: На наступному екрані вам буде запропоновано ввести відомості для створення користувача-суперадміністратора Galette. Використовуючи Galette, ви можете призначити деяких користувачів адміністраторами, але користувач, створений під час установлення, не є користувачем, не може бути вилучений і має деякі додаткові права.

source: Initialize
es: Iniciar
it: Inizializza
uk: Ініціалізація

source: The last step will write the configuration file if needed, and initialyse some values in your fresh database, as exemple:
es: El último paso escribirá el archivo de configuración si es necesario, e iniciará algunos valores en tu nueva base de datos, como por ejemplo:
it: L'ultimo passo scriverà il file di configurazione e inizializzerà alcuni valori nel nuovo database, per esempio:
uk: На останньому кроці буде записаний файл конфігурації, якщо це необхідно, і ініціалізовані деякі значення у вашій свіжій базі даних, як приклад:

source: add Galette default preferences
es: añadir los ajustes predeterminados de Galette
it: Aggiungi le preferenze predefinite per Galette
uk: додавання типових налаштувань Galette

source: add default contributions and status types,
es: añadir los tipos de contribuciones y estados,
it: aggiungi i contributi e i tipi di stato predefiniti,
uk: додавання типових внесків і типів станів,

source: fields configuration and permissions,
es: configuración de campos y permisos,
it: configurazione dei campi e permessi,
uk: конфігурація полів та дозволи,

source: texts for administrative emails,
es: textos para correos electrónicos administrativos,
it: testi per e-mail amministrative,
uk: тексти для системних листів на е-пошту,

source: members default titles,
es: títulos predeterminados de miembros,
it: titoli predefiniti per i membri,
uk: типові підписи членів,

source: default PDF models
es: modelos PDF predeterminados
it: modelli PDF predefiniti
uk: типові моделі PDF

source: When updating, only the missing preferences and the new default data if any will be handled.
es: Al actualizar, solo se gestionarán los ajustes que falten y los nuevos datos predeterminados, si los hay.
it: Al momento dell'aggiornamento, verranno gestite solo le preferenze mancanti e i nuovi dati.
uk: Під час оновлення оброблятимуться лише відсутні налаштування та нові типові дані, якщо такі є.

source: Installation end
es: Fin de la instalación
it: Fine dell'installazione
uk: Кінець установлення

source: Installation is now finished, congratulations!
es: La instalación se ha completado, ¡enhorabuena!
it: Installazione completata, congratulazioni!
uk: Установлення завершено, вітаємо!

source: You can now login to Galette, using super admin information you used at installation time. You can now go to the :doc:`Galette user manual <../usermanual/index>`.
es: Ahora puedes iniciar sesión en Galette, usando la información de super administrador que utilizaste en el momento de instalación. Ahora puedes ir al :doc:`Manual del usuario de Galette <../usermanual/index>`.
it: È ora possibile effettuare il login a Galette, usando le credenziali del super amministratore fornite al momento dell'installazione. Ora si può consultare il :doc:`Manuale utente di Galette <../usermanual/index>`.
uk: Тепер ви можете увійти в Galette, використовуючи дані суперадміністратора, які ви використовували під час установлення. Тепер ви можете перейти до :doc:`Посібника користувача Galette <../usermanual/index>`.

source: Happy Galette!
es: ¡Galette feliz!
it: Buona Galette!
uk: Щасливого Galette!

source: Next screen ask you for installation type. You'll choose between "New installation" or "Update". Several of the steps that will follow will be specific to the type you will choose here.
es: La siguiente pantalla te pregunta por el tipo de instalación. Elegirás entre "Nueva instalación" o "Actualizar". Varios de los pasos que seguiste serán específicos del tipo de instalación que selecciones aquí.
it: La schermata successiva chiede il tipo di installazione. Si deve scegliere tra "Nuova installazione" o "Aggiornamento". Molti dei passaggi che seguiranno saranno specifici per il tipo che si sceglierà qui.

source: Telemetry
es: Telemetría
it: Telemetria

source: To know more about Galette installed instances, we try to collect anonymous telemetry data. You can also register as a Galette user :)
es: Para saber más sobre las instancias instaladas de Galette, intentamos recopilar datos de telemetría anónimos. También puedes registrar como un usuario Galette :)
it: Per saperne di più sulle istanze installate di Galette, raccogliamo dati di telemetria anonimi. Ci si può anche registrare come utente Galette :)
