Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/installation/postinstall.po
Languages: fr_fr, it, ru, uk

source: Post installation
it: Post installazione
ru: Постовая установка
uk: Після встановлення

source: Various tasks
fr_fr: Tâches diverses
it: Vari compiti
ru: Различные задания
uk: Різні завдання

source: One Galette properly installed, you still have one thing to do:
fr_fr: Une fois que Galette est installé, il reste une petite chose à faire :
it: Una volta installato correttamente Galette, c'è ancora una cosa da fare:
ru: Если вы правильно установили Galette, вам остается сделать еще одну вещь:

source: remove write access to the ``config`` directory.
fr_fr: supprimer l'accès en écriture au répertoire ``config``.
it: rimuovere l'accesso in scrittura alla cartella ``config```.
ru: удалите доступ на запись в каталог ``config``.
uk: вилучити доступ на запис до каталогу ``config``.

source: Configure paths
fr_fr: Configuration des chemins
it: Configura percorsi
ru: Настройка путей
uk: Налаштування шляхів

source: Some galette paths may be changed from a configuration parameter, such as exports, photos, etc
fr_fr: Certains chemins de Galette peuvent être modifiés avec un paramètre de configuration, comme les exports, les photos, etc
it: Alcuni percorsi di Galette possono essere modificati da un parametro di configurazione, come esportazioni, foto, ecc
ru: Некоторые пути Galette могут быть изменены с помощью параметров конфигурации (таких как экспорт, фотографии и т.д.)
uk: Деякі шляхи Galette можуть бути змінені з конфігураційного параметра, наприклад, експорт, світлини тощо

source: By default, Galette provides all those directories inside installation directory. That way, if installation is located at ``/var/www/galette``, exports will be in ``/var/www/galette/data/exports``, photos in ``/var/www/galette/data/photos/``, and so on. Default configuration is done in ``config/paths.inc.php`` file that should not be changed.
fr_fr: Par défault, Galette fournit ces dossiers au sein même de son installation. De cette manière, si Galette est installée dans ``/var/www/galette``, les exports seront dans ``/var/www/galette/data/exports``, les photos dans ``/var/www/galette/data/photos/``, et ainsi de suite. La configuration des chemins par défaut se trouve dans le fichier ``config/paths.inc.php`` qui ne doit pas être modifié.
it: Per impostazione predefinita, Galette fornisce tutte quelle cartelle all'interno della cartella di installazione. In questo modo, se l'installazione si trova in ``/var/www/galette``, le esportazioni saranno in ``/var/www/galette/data/exports``, le foto in ``/var/www/galette/data/photos/`` e così via. La configurazione predefinita viene fatta nel file ``config/paths.inc.php`` che non deve essere modificato.
ru: По умолчанию Galette предоставляет все эти каталоги внутри каталога установки. Таким образом, если установка расположена по адресу ``/var/www/galette``, экспорт будет находиться в ``/var/www/galette/data/exports``, фотографии - в ``/var/www/galette/data/photos/`` и так далее. Конфигурация по умолчанию выполняется в файле ``config/paths.inc.php``, который не должен быть изменен.
uk: Типово Galette надає всі ці каталоги в каталозі встановлення. Таким чином, якщо встановлення знаходиться в ``/var/www/galette``, то експорт буде здійснюватися в ``/var/www/galette/data/exports``, світлини в ``/var/ww/galette/data/photos/``, і так далі. Типові налаштування виконуються в файлі ``config/paths.inc.php``, який не має бути змінений.

source: Instead, you may override some or all of the values in a ``config/local_paths.inc.php``, with paths you want declared as PHP constants. For exemple, to define a different path for photos:
fr_fr: À la place, vous pouvez surcharger certaines de ces valeurs dans un fichier ``config/local_paths.inc.php``, avec les chemins que vous souhaitez déclarer sous forme de constantes PHP. Par exemple, pour définir un chemin différent pour les photos :
it: Invece, si può sovrascrivere alcuni o tutti i valori in un ``config/local_paths.inc.php``, con i percorsi che si vuole dichiarare come costanti PHP. Ad esempio, per definire un percorso diverso per le foto:
ru: Вместо этого вы можете переопределить некоторые или все значения в файле ``config/local_paths.inc.php``, указав пути, которые вы хотите объявить как константы PHP. Например, чтобы определить другой путь для фотографий:
uk: Замість цього ви можете перевизначити деякі або всі значення в ``config/local_paths.inc.php``, зі шляхами, які ви хочете оголосити PHP-сталими. Наприклад, визначити інший шлях для світлин:

source: All paths that originally resides in ``data`` directory must stay accessible read/write for the web server. All other directories should be set as read only, the web server should not have to write in them. Here is the complete list:
fr_fr: Tous les chemins se trouvent par défaut dans un dossier ``data`` qui doit être accessible en lecture/écriture par le serveur web. tous les autres dossiers devraient être en lecture seule, le serveur web ne devrait jamais avoir à y écrire. Voici la liste complète :
it: Tutti i percorsi che risiedono originariamente nella directory ``data`` devono rimanere accessibili in lettura/scrittura per il server web. Tutte le altre cartelle dovrebbero essere impostate come di sola lettura, il server web non dovrebbe scrivere in esse. Ecco l'elenco completo:
ru: Все пути, которые изначально находятся в директории ``data``, должны оставаться доступными для веб-сервера в режиме чтения/записи. Все остальные каталоги должны быть установлены как доступные только для чтения, веб-сервер не должен писать в них. Вот полный список:
uk: Усі шляхи, які початково прокладені у каталозі ``data`` повинні залишатися доступними для читання/запису для вебсервера. Всі інші каталоги повинні бути встановлені як "тільки для читання", вебсервер не повинен записувати в них нічого. Ось повний список:

source: `GALETTE_CONFIG_PATH` : path to Galette configuration files,
fr_fr: `GALETTE_CONFIG_PATH` : chemin vers les fichiers de configuration de Galette,
it: `GALETTE_CONFIG_PATH`: percorso dei file di configurazione Galette,
ru: `GALETTE_CONFIG_PATH` : путь к файлам конфигурации Galette,
uk: `GALETTE_CONFIG_PATH` : шлях до файлів конфігурації Galette,

source: `GALETTE_DATA_PATH` : path to Galette data directory (since 0.8),
fr_fr: `GALETTE_DATA_PATH` : chemin vers le dossier de données de Galette (depuis la 0.8),
it: `GALETTE_DATA_PATH`: percorso della cartella dei dati Galette (dalla versione 0.8),
ru: `GALETTE_DATA_PATH` : путь к каталогу данных Galette (с версии 0.8),
uk: `GALETTE_DATA_PATH` : шлях до каталогу даних Galette (починаючи з 0.8),

source: `GALETTE_LOGS_PATH` : Galette logs path, change it as you want,
fr_fr: `GALETTE_LOGS_PATH` : chemin vers les fichiers de logs de Galette, à modifier à souhaits,
it: `GALETTE_LOGS_PATH`: percorso dei log di Galette, modificarlo come si vuole,
ru: `GALETTE_LOGS_PATH` : путь к журналам Galette, измените его по своему усмотрению,
uk: `GALETTE_LOGS_PATH` : шлях журналів Galette, змініть його, як ви хочете,

source: `GALETTE_COMPILE_DIR` : path for Smarty templating system compilation,
fr_fr: `GALETTE_COMPILE_DIR` : chemin pour la compilation du système de template Smarty,
it: `GALETTE_COMPILE_DIR`: percorso per la compilazione del sistema di template Smarty,
ru: `GALETTE_COMPILE_DIR` : путь для компиляции системы шаблонов Smarty,
uk: `GALETTE_COMPILE_DIR` : шлях до компіляції системи шаблонів Smarty,

source: `GALETTE_CACHE_DIR` : caching directory for a few cases,
fr_fr: `GALETTE_CACHE_DIR` : dossier de cache pour quelques cas,
it: `GALETTE_CACHE_DIR`: directory di memorizzazione nella cache per alcuni casi,
ru: `GALETTE_CACHE_DIR` : каталог кэширования для нескольких случаев,
uk: `GALETTE_CACHE_DIR` : каталог кешування для деяких випадків,

source: `GALETTE_EXPORTS_PATH` : path to the directory to store CSV exports,
fr_fr: `GALETTE_EXPORTS_PATH` : chemin du dossier où stocker les exports CSV,
it: `GALETTE_EXPORTS_PATH`: percorso della cartella in cui archiviare le esportazioni CSV,
ru: `GALETTE_EXPORTS_PATH` : путь к директории для хранения экспортированных файлов CSV,
uk: `GALETTE_EXPORTS_PATH` : шлях до каталогу для зберігання CSV-експортів,

source: `GALETTE_IMPORTS_PATH` : path to the directory that contains CSV files to import,
fr_fr: `GALETTE_IMPORTS_PATH` : chemin vers le dossier qui contient les fichiers CSV à importer,
it: `GALETTE_IMPORTS_PATH`: percorso della cartella che contiene i file CSV da importare,
ru: `GALETTE_IMPORTS_PATH` : путь к директории, содержащей CSV-файлы для импорта,
uk: `GALETTE_IMPORTS_PATH` : шлях до каталогу, що містить файли CSV для імпорту,

source: `GALETTE_ATTACHMENTS_PATH` : path to attached documents in mailing,
fr_fr: `GALETTE_ATTACHMENTS_PATH` : chemin vers les documents attachés dans les mailing,
it: `GALETTE_ATTACHMENT_PATH`: percorso dei documenti allegati nell'invio postale,
ru: `GALETTE_ATTACHMENTS_PATH` : путь к вложенным документам в рассылке,
uk: `GALETTE_ATTACHMENTS_PATH` : шлях до прикріплених документів у розсиланні,

source: `GALETTE_FILES_PATH` : path to the dynamic files directory storage (from dynamic fields),
fr_fr: `GALETTE_FILES_PATH` : chemin vers le stockage des champs de type fichier (depuis les champs dynamiques),
it: `GALETTE_FILES_PATH`: percorso della cartella di archiviazione dei file dinamici (per i campi dinamici),
ru: `GALETTE_FILES_PATH` : путь к каталогу хранения динамических файлов (из динамических полей),
uk: `GALETTE_FILES_PATH` : шлях до каталогу сховища динамічних файлів (з динамічних полів),

source: `GALETTE_PHOTOS_PATH` : path to store members photos and logos.
fr_fr: `GALETTE_PHOTOS_PATH` : chemin du stockage des photos des adhérents et des logos.
it: `GALETTE_PHOTOS_PATH`: percorso per archiviare foto e loghi dei membri.
ru: `GALETTE_PHOTOS_PATH` : путь для хранения фотографий и логотипов участников.
uk: `GALETTE_PHOTOS_PATH` : шлях зберігання світлин членів та логотипів.

source: Data security
fr_fr: Sécurité des données
it: Sicurezza dei dati
ru: Безопасность данных
uk: Безпека даних

source: You and your members will login to Galette, using a login and a password. You must be aware that those information are transmitted as is to the server; and someone may intercept and read them sniffing your exchanges.
fr_fr: Vos adhérents et vous vous connecterez à Galette en utilisant un identifiant et un mot de passe. Vous devez être conscient que ces données sont transmises en clair au serveur ; et quelqu'un pourrait les intercepter et les lire en inspectant vos échanges.
it: Si accede a Galette utilizzando un login e una password. Bisogna essere consapevoli che tali informazioni vengono trasmesse così come sono al server; e qualcuno potrebbe intercettarli e leggerli attraverso questi scambi.
ru: Вы и ваши участники войдут в Galette, используя логин и пароль. Вы должны знать, что эти данные передаются на сервер в неизменном виде, и кто-то может перехватить и прочитать их, прослушивая ваш обмен.
uk: Ви та ваші члени ввійдете в Galette, використовуючи логін і пароль. Ви повинні знати, що ці дані передаються на сервер як є, і хтось може перехопити та прочитати їх, прослуховуючи Ваші пакети обміну.

source: This problem is recurrent hen you have to send data over the internet, and this is why you must check if you are on a HTTPS secured page (your browser will tell you), when you enter any sensitive information such as login, passwords, credit card number, ...
fr_fr: Ce problème est récurrent dès qu'il s'agit d'envoyer des données via internet, et c'est pourquoi il faut vérifier que la page de connexion passe par une connexion sécurisée par HTTPS (votre navigateur vous le dira) dès que vous entrez des informations sensibles telles qu'un identifiant, un mot de passe, un numéro de carte de crédit, ...
it: Questo problema è ricorrente quando si deve inviare dati su Internet, ed è per questo che bisogna verificare che ci si trovi su una pagina protetta HTTPS (il proprio browser ce lo dirà), quando si inseriscono informazioni sensibili come login, password, numero della carta di credito, ...
ru: Эта проблема часто возникает, когда вам приходится пересылать данные через Интернет, и именно поэтому вы должны проверять, находитесь ли вы на защищенной странице HTTPS (ваш браузер сообщит вам об этом), когда вы вводите любую конфиденциальную информацию, такую как логин, пароль, номер кредитной карты, ...
uk: Ця проблема полягає в тому, що при введенні будь-яких конфіденційних даних, таких як логін, паролі, номери кредитної картки тощо, ви повинні перевірити, чи перебуваєте ви на захищеній сторінці HTTPS (ваш браузер повідомить вас про це) ...

source: And this is the same for Galette, you can use it along with SSL, no problem. All data that will be transmitted to the server will be a bit more confident and secured :)
it: E questo è lo stesso per Galette, se si può usarlo insieme a SSL, nessun problema. Tutti i dati che verranno trasmessi al server saranno un po' più sicuri e protetti :)
ru: То же самое касается и Galette, вы можете использовать его вместе с SSL, без проблем. Все данные, которые будут передаваться на сервер, будут немного более уверенными и защищенными :)
uk: І це те ж саме для Galette, ви можете використовувати його Walong з SSL без проблем. Всі дані, які будуть передаватися на сервер, будуть трохи більш конфіденційними та безпечними :)

source: And this is the same for Galette, you can use it walong with SSL, no problem. All data that will be transmitted to the server will be a bit more confident and secured :)
fr_fr: Il en va de même pour Galette, vous pouvez l'utiliser avec SLL, aucun problème. Toutes les données transmises au serveur seront un peu plus sécurisées et confidentielles :)
