Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/installation/preparation.po
Languages: fr_fr, ta, uk

source: Preparation
fr_fr: Préparation
ta: தயாரிப்பு
uk: Підготування

source: You have to follow some preparation steps for Galette installation. The way to go differs on what you want to achieve.
fr_fr: Vous devrez suivre quelques étapes pour préparer l'installation de Galette. La manière de faire dépend de ce que vous souhaitez faire.
ta: கேலட் நிறுவலுக்கான சில தயாரிப்பு படிகளை நீங்கள் பின்பற்ற வேண்டும். செல்ல வழி நீங்கள் எதை அடைய விரும்புகிறீர்கள் என்பதில் வேறுபடுகிறது.
uk: Ви повинні виконати деякі кроки з підготування до встановлення Galette. Це залежить від того, чого ви хочете досягти.

source: File permissions
fr_fr: Permissions des fichiers
ta: கோப்பு அனுமதிகள்
uk: Дозволи на доступ до файлів

source: A commonly used hack is to give all rights to everyone recursively on the directory (``chmod 777``). This is a very very bad idea from a security point of view. Please do not use that hack, you've been warned ;)
fr_fr: Un contournement fréquemment utilisé est de donner tous les droits à tout le monde (``chmod 777``). C'est une très, très mauvaise manière de faire d'un point de vue sécurité. Merci de ne pas faire ça, vous êtes prévenus ;)
ta: பொதுவாகப் பயன்படுத்தப்படும் ஏக் என்பது அனைவருக்கும் கோப்பகத்தில் (`` Chmod 777``) அனைவருக்கும் மீண்டும் மீண்டும் வழங்குவதாகும். இது ஒரு பாதுகாப்புக் கண்ணோட்டத்தில் மிகவும் மோசமான சிந்தனை. தயவுசெய்து அந்த ஏக்கைப் பயன்படுத்த வேண்டாம், உங்களுக்கு எச்சரிக்கை விடுக்கப்பட்டுள்ளது;)
uk: Часто використовувана кмітлина полягає в наданні всіх прав всім рекурсивно на каталог (``chmod 777``). Це дуже погана ідея з точки зору безпеки. Будь ласка, не використовуйте цю кмітлину, вас попередили ;)

source: Some Galette directories need specific rights. The application will need to write in some of them, you have to ensure it will be possible. Here are directories that need a write access:
fr_fr: Certains répertoires de Galette demandent des droits particuliers. L'application peut avoir à écrire dans certains d'entre eux, vou devrez vous assurer que c'est possible. Voici les dossiers qui demandent les droits en écriture :
ta: சில கேலட் கோப்பகங்களுக்கு குறிப்பிட்ட உரிமைகள் தேவை. பயன்பாடு அவற்றில் சிலவற்றில் எழுத வேண்டும், அது சாத்தியமாகும் என்பதை நீங்கள் உறுதிப்படுத்த வேண்டும். எழுதும் அணுகல் தேவைப்படும் கோப்பகங்கள் இங்கே:
uk: Деякі каталоги Galette потребують певних прав. Застосункові потрібно буде записувати в деякі з них, ви повинні переконатися, що це буде можливо. Ось каталоги, які потребують доступу на запис:

source: |folder| `config` [#configdirperms]_,
ta: | கோப்புறை | `config` [#configdirperms] _,

source: |folder| `data/attachments`,
ta: | கோப்புறை | `தரவு/இணைப்புகள்`,

source: |folder| `data/cache`,
ta: | கோப்புறை | `தரவு/கேச்`,

source: |folder| `data/exports`,
ta: | கோப்புறை | `தரவு/ஏற்றுமதி`,

source: |folder| `data/files`,
ta: | கோப்புறை | `தரவு/கோப்புகள்`,

source: |folder| `data/imports`,
ta: | கோப்புறை | `தரவு/இறக்குமதி`,

source: |folder| `data/logs`,
ta: | கோப்புறை | `தரவு/பதிவுகள்`,

source: |folder| `data/photos`,
ta: | கோப்புறை | `தரவு/புகைப்படங்கள்`,

source: |folder| `data/tempimages`,
ta: | கோப்புறை | `தரவு/தற்காலிகங்கள்`,

source: |folder| `data/templates_c`
ta: | கோப்புறை | `தரவு/வார்ப்புருக்கள்_சி`

source: write access on ``config`` directory is only needed for Galette installation, we advice you to remove the write access once Galette has been installed :)
fr_fr: l'accès en écriture sur le dossier ``config`` est uniquement requis lors de l'installation de Galette. Il est fortement conseillé de les enlever une fois l'installation terminée :)
ta: `` config`` கோப்பகத்தில் அணுகல் எழுது கேலட் நிறுவலுக்கு மட்டுமே தேவைப்படுகிறது, கேலட் நிறுவப்பட்டவுடன் எழுதும் அணுகலை அகற்றுமாறு நாங்கள் உங்களுக்கு அறிவுறுத்துகிறோம் :)
uk: доступ на запис у каталог ``config`` потрібен лише для встановлення Galette, ми порадимо вам видалити доступ до запису, щойно Galette буде встановлено :)

source: Create database
fr_fr: Créer la base de données
ta: தரவுத்தளத்தை உருவாக்கவும்
uk: Створити базу даних

source: **Never use database root user!**
fr_fr: **N'utilisez jamais l'utilisateur root !**
ta: ** தரவுத்தள ரூட் பயனரை ஒருபோதும் பயன்படுத்த வேண்டாம்! **
uk: **Ніколи не використовуйте кореневого (root) користувача бази даних!**

source: For security reasons, it is strongly advised to rely on a specific user for Galette database, and give him only requested access on the single Galette database.
ta: பாதுகாப்பு காரணங்களுக்காக, கேலட் தரவுத்தளத்திற்காக ஒரு குறிப்பிட்ட பயனரை நம்பும்படி கடுமையாக அறிவுறுத்தப்படுகிறது, மேலும் அவருக்கு ஒற்றை கேலட் தரவுத்தளத்தில் மட்டுமே அணுகல் வழங்கப்படுகிறது.

source: For the example, we will use a database named `mygalette` with a user `mygaletteuser` with `mypass` as password.
fr_fr: Par exemple, nous utiliserons une base de données nommée `mygalette` avec un utilisateur `mygaletteuser` ayant pour mot de passe `mypass`.
ta: எடுத்துக்காட்டுக்கு, ஒரு பயனருடன் `MyGaletteuser` உடன்` MyGaletteUser` என்ற தரவுத்தளத்தைப் பயன்படுத்துவோம்.
uk: Для прикладу ми використовуватимемо базу даних `mygalette` з користувачем `mygaletteuser` і `mypass` в якості пароля.

source: MariaDB
ta: மரியாட்ப்

source: Those commands may vary, please refer to `MariaDB <https://mariadb.com/kb/en/library/documentation/>`_ or `PostgreSQL <https://docs.postgresqlfr.org>`_ documentations, or use a graphical tool:
fr_fr: Ces commandes peuvent varier, reportez-vous aux documentation `MariaDB <https://mariadb.com/kb/en/library/documentation/>`_ ou `PostgreSQL <https://docs.postgresqlfr.org>`_, ou utilisez un outil graphique :
ta: அந்த கட்டளைகள் மாறுபடலாம், தயவுசெய்து `மரியாடிபி <https://mariadb.com/kb/library/documentation/>` _ அல்லது `postgresql <https://docs.postgresqlfr.org>` _ ஆவணங்கள், அல்லது பயன்பாட்டைப் பார்க்கவும் ஒரு வரைகலை கருவி:
uk: Ці команди можуть відрізнятися, будь ласка, зверніться до документації `MariaDB <https://mariadb.com/kb/en/library/documentation/>`_ чи `PostgreSQL <https://docs.postgresqlfr.org>`_ або використовуйте графічний засіб:

source: `phpMyAdmin <https://www.phpmyadmin.net>`_ for MariaDB ;
fr_fr: `phpMyAdmin <https://www.phpmyadmin.net>`_ pour MariaDB ;
ta: `phpmyadmin <https://www.phpmyadmin.net>` _ மரியாட்பிற்கு;
uk: `phpMyAdmin <https://www.phpmyadmin.net>`_ для MariaDB ;

source: `phpPgAdmin <http://phppgadmin.sourceforge.net>`_ or `PgAdmin <https://www.pgadmin.org/download/?lang=fr_FR>`_ for PostgreSQL.
fr_fr: `phpPgAdmin <http://phppgadmin.sourceforge.net>`_ ou `PgAdmin <https://www.pgadmin.org/download/?lang=fr_FR>`_ pour PostgreSQL.
ta: `phpPgAdmin <http://phppgadmin.sourceforge.net>`_ or `PgAdmin <https://www.pgadmin.org/download/?lang=fr_FR>`_ க்கு PostgreSQL.
uk: `phpPgAdmin <http://phppgadmin.sourceforge.net>`_ чи `PgAdmin <https://www.pgadmin.org/download/`_ для PostgreSQL.

source: Web server directory exposition
fr_fr: Exposition des dossiers sur le serveur web
ta: வலை சேவையக அடைவு வெளிப்பாடு
uk: Експозиція каталогу вебсервера

source: Galette installation may consists in copying a complete directory to a location the web server can read. This method may work, but this exposes from the web files and directories that should not be available this way.
fr_fr: L'installation de Galette peut consister à copier un dossier complet à un endroit que le serveur web peut lire. Cette méthode peut fonctionner, mais elle expose des fichiers et dossiers sur les web alors qu'ils ne devraient pas forcément être accessibles de cette manière.
ta: வலை சேவையகம் படிக்கக்கூடிய இடத்திற்கு ஒரு முழுமையான கோப்பகத்தை நகலெடுப்பதில் கலெட் நிறுவல் இருக்கலாம். இந்த முறை செயல்படக்கூடும், ஆனால் இது வலை கோப்புகள் மற்றும் கோப்பகங்களிலிருந்து இந்த வழியில் கிடைக்கக்கூடாது.

source: It is possible to limit that by exposing only the ``webroot`` directory. All other directories are more safe: it is not possible to reach them from the web server!
fr_fr: Il est possible de limiter cela en n'exposant que le dossier ``webroot``. Tous les autres dossiers seront ainsi davantage en sécurité puisque non accessibles depuis le web !
ta: `` வெப்ரூட்`` கோப்பகத்தை மட்டுமே அம்பலப்படுத்துவதன் மூலம் அதைக் கட்டுப்படுத்த முடியும். மற்ற அனைத்து கோப்பகங்களும் மிகவும் பாதுகாப்பானவை: வலை சேவையகத்திலிருந்து அவற்றை அடைய முடியாது!
uk: Обмежити це можна, виставляючи лише каталог ``webroot``. Усі інші каталоги є безпечнішими: неможливо зв'язатися з ними з вебсервера!

source: Exposing only ``webroot`` directory is the recommended, and only secured way.
fr_fr: L'exposition du seul dossier ``webroot`` est la manière recommandée, et la seule qui soit sécurisée.
ta: `` வெப்ரூட்`` கோப்பகத்தை மட்டுமே அம்பலப்படுத்துவது பரிந்துரைக்கப்படுகிறது, மேலும் பாதுகாப்பான வழி.

source: Using a subdomain
fr_fr: Utiliser un sous-domaine
ta: ஒரு துணை டொமைனைப் பயன்படுத்துதல்

source: Here is a virtual host configuration example, including the hide of `index.php`:
fr_fr: Voici un exemple de configuration d'un hôte virtuel, y compris le masquage de `index.php` :
ta: `Index.php` இன் மறைவை உள்ளடக்கிய மெய்நிகர் புரவலன் உள்ளமைவு எடுத்துக்காட்டு இங்கே:
uk: Ось приклад конфігурації віртуального хосту, включно з приховуванням `index.php`:

source: Nginx would be:
fr_fr: Pour Nginx, ce serait :
ta: Nginx இருக்கும்:
uk: Nginx буде:

source: Using an alias
fr_fr: Utiliser un alias
ta: ஒரு மாற்றுப்பெயரைப் பயன்படுத்துதல்

source: An alternative secured configuration, if you do not have a specific subdomain for Galette is to use an ``alias`` in your existing virtual host:
fr_fr: Une solution sécurisée alternative, si vous n'avez pas de sous-domaine spécifique pour Galette est d'utiliser un ``alias`` dans votre hôte virtuel existant :
ta: ஒரு மாற்று பாதுகாப்பான உள்ளமைவு, உங்களிடம் ஒரு குறிப்பிட்ட துணை டொமைன் இல்லையென்றால், உங்கள் இருக்கும் மெய்நிகர் ஓச்டில் `` மாற்றுப்பெயர்`` பயன்படுத்த வேண்டும்:

source: Do not forget with that solution you have to setup correctly your ``RewriteBase`` directive.
fr_fr: N'oubliez pas avec cette solution que vous devez définir correctement votre directive ``RewriteBase``.
ta: அந்த தீர்வை மறந்துவிடாதீர்கள், உங்கள் `` மீண்டும் எழுதப்பட்ட பேச்`` உத்தரவை நீங்கள் சரியாக அமைக்க வேண்டும்.

source: Linux/Unix
ta: லினக்ச்/யுனிக்ச்

source: Installing Galette on Linux implies you have an access to the terminal on the server and required ACLs on directories.
fr_fr: Installer Galette sous Linux implique que vous ayez accès à une console sur le serveur, et les droits requis sur les répertoires.
ta: லினக்சில் கேலட் நிறுவுவது சேவையகத்தில் முனையத்திற்கு அணுகல் இருப்பதையும் கோப்பகங்களில் ACL கள் தேவை என்பதையும் குறிக்கிறது.
uk: Установлення Galette на Linux означає, що у вас є доступ до терміналу на сервері та необхідні списки контролю доступу в каталогах.

source: As an example, on `Fedora <https://fedora.org>`_, you will run (as root):
fr_fr: Par exemple, sur `Fedora <https ://fedora.org>`_, vous lancerez (en root) :
ta: உதாரணமாக, `ஃபெடோரா <https://fedora.org> _ _ இல், நீங்கள் (ரூட் என) ஓடுவீர்கள்:
uk: Як приклад, на `Fedora <https://fedora.org>`_, ви працюватимете (з кореневим доступом):

source: Under `Debian <https://debian.org/>`_, we'll replace ``apache:apache`` with ``www-data:www-data``.
fr_fr: Sous `Debian <https://debian.org/>`_, on remplacera ``apache:apache`` par ``www-data:www-data``.
ta: `டெபியன் <https://debian.org/>` _ இன் கீழ், `` அப்பாச்சி`` `` www-data: www-data`` உடன் மாற்றுவோம்.
uk: На `Debian <https://debian.org/>`_, ми замінимо ``apache:apache`` з ``www-data:www-data``.

source: On SELinux enabled systems, we'll also add:
fr_fr: Sur les systèmes avec SELinux activé, on ajoutera :
ta: செலினக்ச் இயக்கப்பட்ட அமைப்புகளில், நாங்கள் சேர்ப்போம்:
uk: У системах з підтримкою SELinux ми також додамо:

source: You will also have to authorize webserver to connect to the network, with a SELinux boolean:
fr_fr: Vous devrez aussi autoriser le serveur web à se connecter au réseau, avec un booléen SELinux :
ta: செலினக்ச் பூலியன் மூலம் நெட்வொர்க்குடன் இணைக்க வெப்சர்வரை அங்கீகரிக்க வேண்டும்:
uk: Вам також доведеться дозволити вебсерверу під'єднуватися до мережі за допомогою логічного значення SELinux:

source: Some archive or FTP softwares may corrupt files... It is strongly advised if you use windows that you use `7zip <https://www.7-zip.fr>`_ to uncompress and `FileZilla <https://filezilla-project.org/>`_ for TFP transferts.
ta: சில காப்பகம் அல்லது FTP மென்பொருள்கள் கோப்புகளை சிதைக்கக்கூடும் ... நீங்கள் `7zip <https://www.7-zip.fr> _ _ _ அவிழ்க்க மற்றும்` ஃபைல்சில்லா <https: // filezில்லா -project.org/>`_ TFP பரிமாற்றங்களுக்கு.

source: Once source code has been retrieved locally, use :samp:`tar xjvf {galette.tar.bz2}` command under Linux/Unix/MacOS or a graphical tool under Windows.
ta: மூலக் குறியீடு உள்நாட்டில் மீட்டெடுக்கப்பட்டவுடன், பயன்படுத்தவும்: SAMP: `TAR XJVF {galette.tar.bz2}` லினக்ச்/யுனிக்ச்/மேகோச் அல்லது விண்டோசின் கீழ் ஒரு வரைகலை கருவி கீழ் கட்டளை.

source: Just copy the uncompressed directory obtained, and all its sub directories and files, with your FTP client.
fr_fr: Copiez simplement le dossier obtenu après décompression, ainsi que tous les fichiers et dossiers qu'ils contient, à l'aide de votre client FTP.
ta: பெறப்பட்ட சுருக்கப்படாத கோப்பகத்தையும், அதன் அனைத்து துணை கோப்பகங்களையும் கோப்புகளையும் உங்கள் FTP கிளையண்டுடன் நகலெடுக்கவும்.
uk: Просто скопіюйте отриманий нестиснутий каталог та всі його підкаталоги та файли за допомогою вашого FTP-клієнта.

source: Specific cases
fr_fr: Cas particuliers
ta: குறிப்பிட்ட வழக்குகள்
uk: Конкретні випадки

source: Ionos
ta: அயன்
uk: Хостинг Ionos

source: If you're hosted on Ionos; and want to use a specific subdomain for Galette, you must create your subdomain from their UI, and make it points to the ``webroot`` directory. You also have to edit the ``.htaccess`` file it contains, and uncomment the ``RewriteBase /`` directive.
fr_fr: Si vous êtes hébergé chez Ionos ; et que vous voulez utiliser un sous domaine spécifique pour Galette, vous devez créer votre sous domaine depuis leur interface, et le faire pointer sur le dossier ``webroot``. Vous devrez également modifier le fichier ``.htaccess`` qu'il contient, et décommenter la directive ``RewriteBase /``.
ta: நீங்கள் அயோனோசில் புரவலன் செய்தால்; கேலட்டுக்கு ஒரு குறிப்பிட்ட துணை டொமைனைப் பயன்படுத்த விரும்புகிறீர்கள், நீங்கள் அவர்களின் இடைமுகம் இலிருந்து உங்கள் துணை டொமைனை உருவாக்க வேண்டும், மேலும் அதை `` வெப்ரூட்`` கோப்பகத்தை சுட்டிக்காட்ட வேண்டும். அதில் உள்ள `` .htaccess`` கோப்பையும் நீங்கள் திருத்த வேண்டும், மேலும் `` மீண்டும் எழுதப்பட்ட பேச் /`` கட்டளை.
uk: Якщо ви розміщуєтеся на Ionos; і хочете використовувати спеціальний піддомен для Galette, ви повинні створити свій піддомен в їх інтерфейсі, і зробити його вказівним на каталог ``webroot``. Ви також повинні редагувати файл ``.htaccess`` що це містить, та розкоментувати директиву ``RewriteBase /``.

source: This hosting company offers to `change PHP version you use from your customer account <https://docs.ovh.com/fr/hosting/configurer-le-php-sur-son-hebergement-web-mutu-2014/>`_.
ta: இந்த ஓச்டிங் நிறுவனம் உங்கள் வாடிக்கையாளர் கணக்கிலிருந்து நீங்கள் பயன்படுத்தும் பிஎச்பி பதிப்பை மாற்றுகிறது <https://docs.ovh.com/fr/hosting/configurer-l-php-sur-son-hebergent-web-mutu-2014/> ` _.

source: Additionnal information are available at: https://docs.ovh.com/fr/fr/web/hosting/configurer-le-php-sur-son-hebergement-web-mutu-2014/
fr_fr: Des informations complémentaires sont également disponibles : https://docs.ovh.com/fr/fr/web/hosting/configurer-le-php-sur-son-hebergement-web-mutu-2014/
ta: கூடுதல் தகவல்கள் இங்கு கிடைக்கின்றன: https://docs.ovh.com/fr/fr/web/hosting/configurer-le-php-sur-son-hebergent-web-mutu-2014/
uk: Додаткові відомості доступні тут: https://docs.ovh.com/fr/fr/web/hosting/configurer-le-php-sur-son-hebergement-web-mutu-2014/

source: Many users have display images or attendance sheet issues on OVH hosts. The solution to this issue is to create a ``.ovhconfig`` file at your hosting root with the following contents:
ta: பல பயனர்கள் OVH ஓச்ட்களில் காட்சி படங்கள் அல்லது வருகை தாள் சிக்கல்கள் உள்ளன. இந்த சிக்கலுக்கான தீர்வு பின்வரும் உள்ளடக்கங்களுடன் உங்கள் ஓச்டிங் ரூட்டில் `` .ovhconfig`` கோப்பை உருவாக்குவதாகும்:

source: `Nginx webserver <https://nginx.com>`_ configuration is different from Apache one (see `Nginx documentation for a more complete explanation <https://www.nginx.com/resources/wiki/start/topics/examples/likeapache-htaccess/>`_).
fr_fr: La configuration du `serveur web Nginx <https://nginx.com>`_ es différente de celle d'Apache (voir `la documentation de Nginx pour de plus amples informations <https://www.nginx.com/resources/wiki/start/topics/examples/likeapache-htaccess/>`_).
ta: . /lieapeachache-htaccess/> `_).
uk: `Конфігурація вебсервера Nginx <https://nginx.com>`_ відрізняється від Apache One (див. `Документацію Nginx для більш повного пояснення <https://www.nginx.com/resources/wiki/start/topics/examples/likeapache-htaccess/>`_).

source: So you have to convert restriction access files in Nginx configuration, as for example:
fr_fr: Donc vous devrez convertir les fichiers de restriction d'accès dans la configuration Nginx, comme par exemple :
ta: எனவே நீங்கள் கட்டுப்பாட்டு அணுகல் கோப்புகளை nginx உள்ளமைவில் மாற்ற வேண்டும், எடுத்துக்காட்டாக:
uk: Тому ви повинні перетворити файли обмеження доступу в конфігурації Nginx, як, наприклад:

source: Windows
ta: சாளரங்கள்

source: Installation described here rely on `XAMPP <https://www.apachefriends.org/xampp-windows.html>`_; other installation methods exist but are not listed here.
fr_fr: L'installation décrite ici repose sur `XAMPP <https://www.apachefriends.org/fr/xampp-windows.html>` ; d'autres méthodes existent mais ne sont pas listées ici.
ta: இங்கே விவரிக்கப்பட்டுள்ள நிறுவல் `xampp <https://www.apachefriends.org/xampp-windows.html>` _; பிற நிறுவல் முறைகள் உள்ளன, ஆனால் அவை இங்கே பட்டியலிடப்படவில்லை.
uk: Описане тут установлення міститься на `XAMPP <https://www.apachefriends.org/xampp-windows.html>`_; інші способи установлення існують, але не перелічені тут.

source: First of all, download XAMPP on your computer. Let's install it under ``C:\xampp``.
fr_fr: Tout d'abord, téléchargez XAMPP sur votre ordinateur. installons le dans ``C:\xampp``.
ta: முதலில், உங்கள் கணினியில் XAMPP ஐ பதிவிறக்கவும். அதை `` சி: \ xampp`` இன் கீழ் நிறுவுவோம்.
uk: Перш за все, завантажте XAMPP на своєму комп'ютері. Встановімо його в ``C:\xampp``.

source: Launch the ``xampp-control`` executable (you can find it in ``C:\xampp``), so you can start Apache and MySQL services.
fr_fr: Lancez le programme ``xampp-control`` (vous le trouverez dans `C:\xampp``), vous pourrez ainsi lancer les services Apache et MySQL.
ta: `` Xampp-control`` இயங்கக்கூடியதைத் தொடங்கவும் (நீங்கள் அதை `` c: \ xampp`` இல் காணலாம்), எனவே நீங்கள் அப்பாச்சி மற்றும் MySQL சேவைகளைத் தொடங்கலாம்.
uk: Запустіть виконуваний файл ``xampp-control`` (ви можете знайти його в ``C:\xampp``), таким чином, ви можете запустити служби Apache та MySQL.

source: Once those steps done, download galette and move it to ``C:\wampp\htdocs\galette``, web application will be available from http://127.0.0.1/galette/. Just visit this URL so the installation process begin.
fr_fr: Une fois ces étapes terminées, téléchargez Galette et déplacez le dans ``C:\wampp\htdocs\galette``, l'application sera accessible depuis http://127.0.0.1/galette/. Ouvrez simplement cette URL pour que le processus d'installation démarre.
ta: அந்த படிகள் முடிந்ததும், கேலட்டைப் பதிவிறக்கம் செய்து `சி: \ வாம்ப் \ htdocs \ கேலட்`` க்கு நகர்த்தவும், வலை பயன்பாடு http://127.0.0.1/galette/ இலிருந்து கிடைக்கும். இந்த முகவரி ஐப் பார்வையிடவும், எனவே நிறுவல் செயல்முறை தொடங்குகிறது.
uk: Після того, як виконано ці кроки, завантажте Galette і перемістіть його у ``C:\wampp\htdocs\galette``, вебзастосунок буде доступний за посиланням http://127.0.0.1/galette/. Просто відвідайте цю URL-адресу, щоб почати процес установлення.

source: Enabling PHP modules under XAMPP is done in ``xampp/php/php.ini``. Most of the required extensions are already present, but commented (line begins with a ";"), just uncomment them and restart XAMPP.
fr_fr: L'activation de modules PHP sous XAMPP se fait dans `xampp/php/php.ini``. La plupart des extensions requises sont déjà présentes, mais sont commentées (la ligne commence par un « ; »), dé-commentez les simplement et relancez XAMPP.
ta: XAMPP இன் கீழ் பிஎச்பி தொகுதிகளை இயக்குவது `` xampp/php/php.ini`` இல் செய்யப்படுகிறது. தேவையான பெரும்பாலான நீட்டிப்புகள் ஏற்கனவே உள்ளன, ஆனால் கருத்து தெரிவிக்கின்றன (வரி ஒரு ";" உடன் தொடங்குகிறது), அவற்றை அவிழ்த்து XAMPP ஐ மறுதொடக்கம் செய்யுங்கள்.
uk: Увімкнення модулів PHP під XAMPP виконується в ``xampp/php/php.ini``. Більшість необхідних розширень вже присутні, але закоментовані (рядок починається з ";"), просто розкоментуйте їх у коді та перезапустіть XAMPP.

source: `openssl` extension is missing in the file, to activate it just add the following to your `php.ini`: ``extension=php_openssl.dll``
fr_fr: L'extension `openssl` est absente du fichier, pour l'activer, ajoutez simplement ceci à votre `php.ini` : ``extension=php_openssl.dll``
ta: `OpenSsl` நீட்டிப்பு கோப்பில் இல்லை, அதை செயல்படுத்த, உங்கள்` php.ini` இல் பின்வருவனவற்றைச் சேர்க்கவும்: `` நீட்டிப்பு = php_openssl``
uk: Розширення `openssl` відсутнє у файлі, щоб задіяти його просто додайте до вашого `php.ini`: ``extension=php_openssl.dll``

source: For security reasons, it is stongly advised to rely on a specific user for Galette database, and give him only requested access on the single Galette database.
fr_fr: Pour des raisons de sécurité, il est fortement conseillé d'utiliser un utilisateur spécifique à la base de données de Galette, et de ne lui donner que les droits requis sur la base de données de Galette.
uk: Задля безпеки настійно пораджено покладатися на конкретного користувача для бази даних Galette і надавати йому тільки запитуваний доступ до єдиної бази даних Galette.

source: Some archive or FTP softwares may corrupt files... It is strongly adviced if you use windows that you use `7zip <https://www.7-zip.fr>`_ to uncompress and `FileZilla <https://filezilla-project.org/>`_ for TFP transferts.
fr_fr: Certains logiciels d'archives ou de transfert FTP peuvent corrompre les fichiers... Il est fortement conseillé si vous êtes sous Windows d'utiliser `7zip <https://www.7-zip.fr>`_ pour décompresser les archives et `FileZilla <https://filezilla-project.org/>`_ pour les transferts FTP.
uk: Деякі програми архівування або FTP можуть пошкоджувати файли ... Радимо, якщо ви використовуєте Windows, використовувати `7zip <https://www.7-zip.fr>`_ для витягнення та`FileZilla <https://filezilla-project.org/>`_ для FTP передавань.

source: Once source code has been retrived locally, use :samp:`tar xjvf {galette.tar.bz2}` command under Linux/Unix/MacOS or a graphical tool under Windows.
fr_fr: Une fois que le code source est récupéré en local ; utilisez :samp:`tar xjvf {galette.tar.bz2}` sous Linux/Unix/MacOS ou un outil de gestion graphique sous Windows.
uk: Після того, як джерельний код було відновлено локально, використовуйте команду :samp:`tar xjvf {galette.tar.bz2}`під Linux / Unix / MacOS або графічний засіб під Windows.

source: This hosting compay offers to `change PHP version you use from your customer account <https://docs.ovh.com/fr/hosting/configurer-le-php-sur-son-hebergement-web-mutu-2014/>`_.
fr_fr: Cette société d'hébergement offre de `changer la version de PHP utilisée depuis l'interface client <https://docs.ovh.com/fr/hosting/configurer-le-php-sur-son-hebergement-web-mutu-2014/>`_.
uk: Цей хостинг пропонує `змінити версію PHP, яку ви використовуєте з вашого облікового запису клієнта <https://docs.ovh.com/fr/hosting/configurer-le-php-sur-son-hebergement-web-mutu-2014/>`_.
