Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/installation/preparation.po
Languages: fr_fr, ta, uk

source: Many users have display images or emargement list issues on OVH hosts. The solution to this issue is to create a ``.ovhconfig`` file at your hosting root with the following contents:
fr_fr: Beaucoup d'utilisateurs ont rencontré des problèmes de chargement d'images, ou de la liste d'émargement chez OVH. La solution à ce problème est de créer un fichier ``.ovhconfig`` à la racine de votre hébergement avec le contenu suivant :
uk: Багато користувачів стикаються з проблемами відображення зображень або списку розширень на хостах OVH. Розв'язанням цієї проблеми є створення файлу ``.ovhconfig`` на вашому маршруті з наступним вмістом:

source: OVH
uk: Хостинг OVH
