Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/installation/prerequis.po
Languages: de, fr_fr, uk

source: Prerequisites and hosting
de: Voraussetzungen und Hosting
fr_fr: Pré-requis et hébergement
uk: Передумови та хостинг

source: To install Galette, you will need to meet the following requirements :
de: Um Galette zu installieren, musst du die folgenden Bedingungen erf체llen:
fr_fr: Pour installer Galette, vous aurez besoin que ces prérequis soient respectés :
uk: Для установлення Galette вам необхідно відповідати наступним вимогам:

source: a web server (like Apache),
de: ein Webserver (z.B. Apache),
fr_fr: un serveur web (comme Apache),
uk: вебсервер (наприклад, Apache),

source: PHP 8.1 or more recent,
fr_fr: PHP 8.1 ou plus récent,
uk: PHP 8.1 або новішої версії,

source: `gd` PHP module,
fr_fr: le module PHP `gd`,
uk: PHP-модуль `gd`,

source: `PDO` module and `mysql` ou `postgresql` for PDO,
de: `PDO` Module und `mysql` oder `postgresql` f체r PDO,
fr_fr: le module PHP PDO et `mysql` ou `postrgesql` pour PDO,
uk: модуль `PDO` і `mysql` на `postgresql` для PDO,

source: `curl` PHP module,
fr_fr: le module PHP `curl`,
uk: PHP-модуль `curl`,

source: `intl` PHP module,
fr_fr: le module PHP `intl`,
uk: PHP-модуль `intl`,

source: SSL support,
de: SSL-Unterst체tzung,
fr_fr: le support SSL,
uk: підтримка SSL,

source: `gettext` PHP module (optional).
fr_fr: le module PHP `gettext` (optionnel).
uk: PHP-модуль `gettext` (необов'язково).

source: A database server, `MariaDB <https://mariadb.org>`_ 10.4 minimum (or MySQL 5.7 minimum), or `PostgreSQL <https://postgresql.org>`_ 11 minimum.
de: Ein Datenbankserver, `MariaDB <https://mariadb.org>`_ 10.4 minimum (oder MySQL 5.7 minimum), oder `PostgreSQL <https://postgresql.org>`_ 11 minimum.
fr_fr: Un serveur de base de données, `MariaDB <https://mariadb.org>`_ 10.4 minimum (ou MySQL 5.7 minimum), ou `PostgreSQL <https://postgresql.org>`_ 11 minimum.
uk: Сервер бази даних, `MariaDB <https://mariadb.org>`_ мінімум 10.4 (або MySQL 5.7 мінімум), або `PostgreSQL <https://postgresql.org>`_ мінімум 11.

source: Galette is tested continuously with recent versions of these components. If you encounter issues with a recent version, please let us know ;)
de: Galette wird st채ndig mit den neuesten Versionen dieser Komponenten getestet. Wenn Sie Probleme mit einer neueren Version haben, lassen Sie es uns bitte wissen ;)
fr_fr: Galette est régulièrement testé avec des versions récentes de ces composants. Si vous rencontrez des problèmes avec une version récente, n'hésitez pas à nous le faire savoir ;)
uk: Galette постійно тестується з останніми версіями цих складників. Якщо у вас виникли проблеми з останньою версією, повідомте нас про це;)

source: Galette does not work on the following hostings:
de: Galette funktioniert nicht auf den folgenden Hosts:
fr_fr: Galette est incompatible avec les hébergements suivants :
uk: Galette не працює в наступних хостингах:

source: Free,
de: Kostenlos,
uk: Безплатно,

source: PHP 7.2 or more recent,
de: PHP 7.2 oder neuer,
