Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/installation/update.po
Languages: de, es, fr_fr, it, ta

source: Updating
de: Aktualisieren
es: Actualizar
fr_fr: Mettre à jour
it: In aggiornamento
ta: புதுப்பித்தல்

source: If you are using an old Galette release, it's time to update.
de: Wenn du einen alten Release von Galette benutzt, ist es Zeit zu updaten.
es: Si estás usando una versión antigua de Galette, es hora de actualizarla.
fr_fr: Si vous utilisez une ancienne version de Galette, il est temps de mettre à jour.
it: Se si sta usando una vecchia versione di Galette, è tempo di aggiornare.
ta: நீங்கள் பழைய கேலட் வெளியீட்டைப் பயன்படுத்துகிறீர்கள் என்றால், புதுப்பிக்க வேண்டிய நேரம் இது.

source: An update is often not something lite, your data may be modified. So, please make sure you made **a backup of your current database**, or you may lost all or a part of your data.
de: Ein Update ist oft keine Kleinigkeit, Ihre Daten können verändert werden. Stellen Sie daher sicher, dass Sie eine **Sicherung Ihrer aktuellen Datenbank** gemacht haben, sonst könnten Sie alle oder einen Teil Ihrer Daten verlieren.
es: Una actualización no suele ser algo liviano, tus datos pueden ser modificados. Así que, por favor asegúrate de haber hecho **una copia de seguridad de tu base de datos actual**, o puedes perder todos o parte de sus datos.
fr_fr: Une mise à jour est généralement quelque chose d'assez conséquent, vos données pourraient être modifiées. Donc, assurez-vous d'effectuer **une sauvegarde de votre base de données**, ou vous pourriez perdre une partie de vos données.
it: Un aggiornamento non è qualcosa da prendere alla leggera, i dati possono venire modificati. Quindi, assicurarsi di fare un **salvataggio dei dati correnti del database** o si rischia di perdere, tutti o in parte, i propri dati.
ta: புதுப்பிப்பு பெரும்பாலும் லைட் அல்ல, உங்கள் தரவு மாற்றியமைக்கப்படலாம். எனவே, தயவுசெய்து உங்கள் தற்போதைய தரவுத்தளத்தின் காப்புப்பிரதியை ** செய்துள்ளீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் **, அல்லது உங்கள் தரவின் அனைத்தையும் அல்லது ஒரு பகுதியை நீங்கள் இழக்க நேரிடும்.

source: A backup of all Galette files is also recommended it would be helpful if you find a bug that prevent you to migrate and have to restore an old version;
de: Ein Backup aller Galette-Dateien ist ebenfalls empfehlenswert. Es wäre hilfreich, wenn Sie einen Fehler finden, der Sie an der Migration hindert und Sie eine alte Version wiederherstellen müssen;
es: También se recomienda una copia de seguridad de todos los archivos de Galette, sería útil si encuentras un error que te impida hacer una migración y tener que restaurar una versión antigua;
it: Un backup di tutti i file Galette sarebbe utile anche nel caso in cui si trovi un difetto che impedisce di migrare ed è necessario ripristinare una vecchia versione;
ta: அனைத்து கேலட் கோப்புகளின் காப்புப்பிரதியும் பரிந்துரைக்கப்படுகிறது, நீங்கள் இடம்பெயரத் தடுக்கும் ஒரு பிழையைக் கண்டால் அது உதவியாக இருக்கும், மேலும் பழைய பதிப்பை மீட்டெடுக்க வேண்டும்;

source: Migrating a pre 0.7 release is theoretically supported, but this is not tested (those releases are more than 10 years old!), and it is possible your attempt fail.
de: Die Migration einer Version vor 0.7 wird theoretisch unterstützt, ist aber nicht getestet (diese Versionen sind mehr als 10 Jahre alt!), und es ist möglich, dass Ihr Versuch fehlschlägt.
es: La migración a una versión anterior a la 0.7 es compatible teóricamente, pero no está probado (¡esas versiones tienen más de 10 años!), y es posible que tu intento falle.
it: La migrazione da una versione pre 0.7 è teoricamente supportata, ma non testata (quelle versioni hanno più di 10 anni!), ed è possibile che il tentativo fallisca.
ta: 0.7 க்கு முந்தைய வெளியீட்டை மாற்றுவது கோட்பாட்டளவில் ஆதரிக்கப்படுகிறது, ஆனால் இது சோதிக்கப்படவில்லை (அந்த வெளியீடுகள் 10 வயதுக்கு மேற்பட்டவை!), மேலும் உங்கள் முயற்சி தோல்வியடையும்.

source: Nothing is really made to make such a time travel ;) If this is your case, you should first `migrate to Galette 0.7.8 <https://galette.eu/download/archives/galette-0.7.8.tar.bz2>`_; and do another migration to the latest version.
de: Nichts ist wirklich dafür gemacht, eine solche Zeitreise zu machen ;) Wenn dies Ihr Fall ist, sollten Sie zuerst auf `Galette 0.7.8 migrieren <https://galette.eu/download/archives/galette-0.7.8.tar.bz2>`_ und dann eine weitere Migration auf die neueste Version durchführen.
es: En realidad, nada está diseñado para viajar en el tiempo de esa manera ;) Si este es tu caso, primero debes `migrar a Galette 0.7.8 <https://galette.eu/download/archives/galette-0.7.8.tar.bz2>`_ y luego realizar otra migración a la última versión.
it: Nulla è stato predisposto per un tale viaggio nel tempo ;) se questo è il proprio caso, sarebbe meglio prima `migrare a Galette 0.7.8 <https://galette.eu/download/archives/galette-0.7.8.tar.bz2>`_; e poi fare un'altra migrazione verso l'ultima versione.
ta: அத்தகைய நேர பயணத்தை மேற்கொள்ள உண்மையில் எதுவும் செய்யப்படவில்லை;) இது உங்கள் விசயமாக இருந்தால், நீங்கள் முதலில் `கேலட்டுக்கு இடம்பெயர வேண்டும் 0.7.8 <https://galette.eu/download/archives/galette-0.7.8.tar.bz2 > `_; அண்மைக் கால பதிப்பிற்கு மற்றொரு இடம்பெயர்வு செய்யுங்கள்.

source: Updating files
de: Datei wird aktualisiert
es: Actualizando archivos
fr_fr: Mise à jour des fichiers
it: Aggiornamento file
ta: கோப்புகளைப் புதுப்பித்தல்

source: First, logout from your instance, and make sure to use a maintenance mode to prevent other users to reach the instance.
de: Erstens, melde dich von deiner Instance ab und stelle sicher dass du den Wartungsmodus benutzt, damit keine anderen Benutzer die Instance erreichen.
es: Primero, cierra sesión en tu instancia y asegúrate de utilizar el modo de mantenimiento para evitar que otros usuarios puedan acceder a ella.
fr_fr: D'abord, déconnectez vous de votre instance, et assurez-vous d'activer le mode maintenance pour que d'autres utilisateurs ne puissent y accéder.
it: Innanzitutto, sconnettersi dalla propria istanza e usare la modalità manutenzione per impedire ad altri utenti di raggiungere l'istanza.
ta: முதலில், உங்கள் நிகழ்விலிருந்து வெளியேறவும், மற்ற பயனர்கள் நிகழ்வை அடையத் தடுக்க பராமரிப்பு பயன்முறையைப் பயன்படுத்துவதை உறுதிசெய்க.

source: Then, download latest Galette version and replace the files. For more information on files installation, refer to the :ref:`prepare installation <preparation>` section.
de: Dann, lade die aktuellste Version von Galette herrunter und ersetzte die Dateien. Weitere Informationen zur Installation der Dateien finden Sie im Abschnitt :ref:`Vorbereitung der Installation <preparation>`.
es: Después descarga la versión más reciente de Galette y reemplaza los archivos. Para obtener más información sobre la instalación de archivos, consulta la sección :ref:`preparar la instalación <preparation>`.
fr_fr: Ensuite, téléchargez la dernière version de Galette et remplacez les fichiers. Pour plus d'informations sur l'installation des fichiers, référez-vous à la section :ref:`préparation de l'installation <preparation>`.
it: Poi, scaricare l'ultima versione di Galette e sostituire i file. Per ulteriori informazioni sull'installazione file, fare riferimento alla sezione :ref:`preparare l'installazione <preparation>`.
ta: பின்னர், அண்மைக் கால கேலட் பதிப்பைப் பதிவிறக்கி கோப்புகளை மாற்றவும். கோப்புகள் நிறுவல் பற்றிய கூடுதல் தகவலுக்கு, இதைப் பார்க்கவும்: குறிப்பு: `நிறுவலைத் தயாரிக்கவும் <தயாரிப்பு>` பிரிவு.

source: Some directories keep data and/or configurations and should be copied back to the new instance:
de: Einige Verzeichnisse enthalten Daten und/oder Konfigurationen und sollten in die neue Instanz zurückkopiert werden:
es: Algunos directorios guardan datos y/o configuraciones y deben ser copiados de vuelta a la nueva instancia:
fr_fr: Quelques répertoires conservent des données et/ou des informations de configuration et devraient être recopiés sur la nouvelle instance :
it: Alcune cartelle contengono dati e/o configurazioni e dovrebbero essere copiate nuovamente nella nuova istanza:
ta: சில கோப்பகங்கள் தரவு மற்றும்/அல்லது உள்ளமைவுகளை வைத்திருக்கின்றன, மேலும் அவை புதிய நிகழ்வுக்கு நகலெடுக்கப்பட வேண்டும்:

source: ``config/config.inc.php``. If this file is missing, Galette update process will ask you the information and create a new one. If the file is present, it will be used to fill information excepted database password. It is the only file that can be edited during update process,
de: ``config/config.inc.php``. Wenn diese Datei fehlt, wird der Aktualisierungsprozess von Galette Sie nach den Informationen fragen und eine neue Datei erstellen. Wenn die Datei vorhanden ist, wird sie zum Ausfüllen der Informationen verwendet, mit Ausnahme des Datenbankpassworts. Es ist die einzige Datei, die während des Aktualisierungsvorgangs bearbeitet werden kann,
es: ``config/config.inc.php``. Si falta este archivo, el proceso de actualización de Galette te pedirá la información y creará uno nuevo. Si el archivo está presente, se utilizará para rellenar la información excepto la contraseña de la base de datos. Es el único archivo que puede editarse durante el proceso de actualización,
fr_fr: ``config/config.inc.php``. si ce fichier est manquant, le processus de mise à jour de Galette vous demandera toutes les informations et en créera un nouveau. Si le fichier est présent, il sera utilisé pour pré-remplir les informations à l'exception du mot de passe de la base. C'est le seul fichier qui sera modifié durant le processus de mise à jour,
it: ``config/config.inc.php``. Se questo file manca, il processo di aggiornamento di Galette chiederà le informazioni e ne creerà uno nuovo. Se il file è presente, verrà utilizzato per riempire le informazioni tranne la password del database. È l'unico file che può essere modificato durante il processo di aggiornamento,
ta: `` config/config.inc.php``. இந்த கோப்பு காணவில்லை என்றால், கேலட் புதுப்பிப்பு செயல்முறை உங்களிடம் தகவலைக் கேட்டு புதிய ஒன்றை உருவாக்கும். கோப்பு இருந்தால், தகவல்களைத் தவிர தரவுத்தள கடவுச்சொல்லை நிரப்ப இது பயன்படுத்தப்படும். புதுப்பிப்பு செயல்முறையின் போது திருத்தக்கூடிய ஒரே கோப்பு இது,

source: ``data/photos`` your members photos and logos,
de: ``Daten/Fotos`` Ihre Mitgliederfotos und Logos,
es: ``data/photos`` fotos y logotipos de sus miembros,
fr_fr: ``data/photos`` les photos de vos adhérents et vos logos,
it: ``dati/foto`` le foto e i loghi dei soci,
ta: `` தரவு/புகைப்படங்கள்`` உங்கள் உறுப்பினர்கள் புகைப்படங்கள் மற்றும் சின்னங்கள்,

source: ``data/exports`` contains CSv exports,
de: ``data/exports`` enthält CSv-Exporte,
es: ``data/exports`` contiene exportaciones CSV,
fr_fr: ``data/exports`` contient les exports CSV,
it: ``data/exports`` contiene le esportazioni CSV,
ta: `` தரவு/ஏற்றுமதி`` சி.எச்.வி ஏற்றுமதி உள்ளது,

source: ``data/files`` contains files from dynamic fields of type file,
de: ``data/files`` enthält Dateien aus dynamischen Feldern der Typ Datei,
es: ``data/files`` contiene archivos de campos dinámicos de tipo archivo,
fr_fr: ``data/files`` contient les fichiers des champs dynamiques de type fichier,
it: ``data/files`` contiene file da campi dinamici di tipo file,
ta: `` தரவு/கோப்புகள்` `வகை கோப்பின் மாறும் புலங்களிலிருந்து கோப்புகளைக் கொண்டுள்ளது,

source: ``data/attachments`` contains mailing attached documents.
de: ``data/attachments`` enthält Mailing-Anhänge.
es: ``data/attachments`` contiene documentos adjuntos de correos electrónicos.
fr_fr: ``data/attachments`` contient les pièces jointes aux mailings.
it: ``data/attachments`` contiene i documenti allegati degli invii postali.
ta: `` தரவு/இணைப்புகள்`` அஞ்சல் இணைக்கப்பட்ட ஆவணங்களைக் கொண்டுள்ளது.

source: ``plugins`` your current plugins. It is a good idea to check if new plugins versions are available ;)
de: ``plugins`` Ihre aktuellen Plugins. Es ist eine gute Idee zu prüfen, ob neue Plugin-Versionen verfügbar sind ;)
es: ``plugins`` tus complementos actuales. Es una buena idea comprobar si hay nuevas versiones disponibles de los complementos ;)
fr_fr: ``plugins`` vos actuels plugins. C'est une bonne idée d'en profiter pour vérifier si de nouvelles versions de vos plugins sont disponibles ;)
it: ``plugins`` i plugin correnti. È sempre una buona idea controllare periodicamente se sono disponibili nuove versioni dei plugin ;)
ta: `` செருகுநிரல்கள்`` உங்கள் தற்போதைய செருகுநிரல்கள். புதிய செருகுநிரல்கள் பதிப்புகள் கிடைக்குமா என்பதை சரிபார்க்க நல்லது;)

source: Once files are updated, go to your Galette instance. It will ask you if needed to proceed to the update of your database.
de: Sobald die Dateien aktualisiert sind, rufen Sie Ihre Galette-Instanz auf. Dort werden Sie gefragt, ob Sie mit der Aktualisierung Ihrer Datenbank fortfahren möchten.
es: Una vez se actualizan los archivos, ve a tu instancia de Galette. Te preguntará si es necesario proceder a la actualización de la base de datos.
fr_fr: Une fois les fichiers mis à jour, allez sur votre instance de Galette. Elle vous demandera si besoin de procéder à la mise à jour de la base de données.
it: Una volta che i file vengono aggiornati, andare alla propria istanza di Galette. Chiederà, se necessario, di procedere all'aggiornamento del database.
ta: கோப்புகள் புதுப்பிக்கப்பட்டதும், உங்கள் கேலட் நிகழ்வுக்குச் செல்லவும். உங்கள் தரவுத்தளத்தின் புதுப்பிப்புக்குச் செல்ல தேவைப்பட்டால் அது உங்களிடம் கேட்கும்.

source: If so, visit the install URL ``/installer.php`` (ex: https://your.domain.name/installer.php) and choose *Update* when your are asked for the type of installation.
de: Wenn ja, besuchen Sie die Installations-URL ``/installer.php`` (z.B.: https://your.domain.name/installer.php) und wählen Sie *Update*, wenn Sie nach der Art der Installation gefragt werden.
es: En tal caso, visita la dirección URL ``/installer.php`` (p. ej.: https://your.domain.name/installer.php) y elige *Actualizar* cuando te pregunte por el tipo de instalación.
fr_fr: Dans ce cas, visitez l'URL d'installation "/installer.php" (ex : https://votre.domaine/installer.php) et choisissez "Mise à jour" lorsque vous sera demandé le type d'installation.
it: Se è così, visitare l'URL di installazione ``/installer.php`` (es: https://nome.tuo.dominio/installer.php) e scegliere *Aggiornare* quando viene richiesto per il tipo di installazione.
ta: அப்படியானால், நிறுவல் வகை ``/installer.php`` (எ.கா: https://your.domain.name/installer.php) ஐப் பார்வையிடவும், நிறுவல் வகையைக் கேட்கும்போது * புதுப்பிப்பு * ஐத் தேர்ந்தெடுக்கவும்.

source: If it asks you nothing you're just done already ;)
de: Wenn es dich nichts fragt, bist du schon fertig ;)
es: Si no te pregunta nada es que ya has acabado ;)
fr_fr: Si rien ne vous est demandé, c'est que c'est déjà bon ;)
it: Se non chiede nulla, è già tutto fatto ;)
ta: அது உங்களிடம் எதுவும் கேட்கவில்லை என்றால் நீங்கள் ஏற்கனவே முடித்துவிட்டீர்கள்;)

source: Updating database
de: Aktualisierung der Datenbank
es: Actualizando la base de datos
fr_fr: Mise à jour de la base de données
it: Aggiornamento del database
ta: தரவுத்தளத்தைப் புதுப்பித்தல்

source: Installing a new Galette release does not strictly means a database update will be required! Sometimes, only updating the files will be enough; even for a major release.
de: Die Installation einer neuen Galette-Version bedeutet nicht zwangsläufig, dass eine Aktualisierung der Datenbank erforderlich ist! Manchmal reicht es aus, nur die Dateien zu aktualisieren, selbst bei einer Hauptversion.
es: ¡Instalar una nueva versión de Galette no necesariamente implica una actualización de la base de datos! A veces, es suficiente con actualizar los archivos; incluso para una versión importante.
fr_fr: Installer une nouvelle version de Galette n'implique pas systématiquement une mise à jour de la base de données. Quelquefois, la seule mise à jour des fichiers sera suffisante ; même pour une version majeure.
it: Installare una nuova versione Galette non significa automaticamente che sarà richiesto un aggiornamento del database! A volte, solo l'aggiornamento dei file sarà sufficiente; anche per un rilascio importante.
ta: புதிய கேலட் வெளியீட்டை நிறுவுவது கண்டிப்பாக ஒரு தரவுத்தள புதுப்பிப்பு தேவைப்படும் என்று பொருள்! சில நேரங்களில், கோப்புகளைப் புதுப்பிப்பது மட்டுமே போதுமானதாக இருக்கும்; ஒரு பெரிய வெளியீட்டிற்கு கூட.

source: Galette will tell you if an update is needed, no need to "force" an update.
de: Galette sagt Ihnen, ob eine Aktualisierung erforderlich ist, Sie müssen keine Aktualisierung "erzwingen".
es: Galette te dirá si es necesaria una actualización, no hay necesidad de "forzar" una actualización.
fr_fr: Galette vous dira qu'une mise à jour est nécessaire, pas la peine d'essayer de « forcer » une mise à jour.
it: Galette dirà se è necessario un aggiornamento, non c'è bisogno di "forzare" un aggiornamento.
ta: புதுப்பிப்பு தேவைப்பட்டால், புதுப்பிப்பை "கட்டாயப்படுத்த" தேவையில்லை என்று கலெட் உங்களுக்குச் சொல்லும்.

source: Update process is very similar to :doc:`Galette installation process <galette>`, with some steps that change. All is mostly transparent, information are provided on each step.
de: Der Aktualisierungsprozess ist dem :doc:`Galette installation process <galette>` sehr ähnlich, mit einigen Schritten, die sich ändern. Alles ist ziemlich transparent, Informationen werden zu jedem Schritt bereitgestellt.
es: El proceso de actualización es muy similar al :doc:`proceso de instalación de Galette <galette>`, con algún paso que cambia. Todo es muy transparente, se facilita la información sobre cada paso.
it: Il processo di aggiornamento è molto simile al :doc:`Processo di installazione di Galette <galette>`, con alcuni passaggi diversi. Tutto è per lo più trasparente, le informazioni vengono fornite ad ogni passo.
ta: புதுப்பிப்பு செயல்முறை மிகவும் ஒத்ததாக இருக்கிறது: DOC: `கேலட் நிறுவல் செயல்முறை <கேலட்>`, மாறும் சில படிகளுடன். அனைத்தும் பெரும்பாலும் வெளிப்படையானவை, ஒவ்வொரு அடியிலும் தகவல்கள் வழங்கப்படுகின்றன.

source: Database information
de: Datenbankinformationen
es: Información de la base de datos
fr_fr: Informations de la base de données
it: Informazioni sul database
ta: தரவுத்தள செய்தி

source: At "Installation type" step, you'll have to choose "update". Database information page will be pre filled with existing information, excepting password. Other information should not be changed.
de: Im Schritt "Installationstyp" müssen Sie "Update" wählen. Die Seite mit den Datenbankinformationen wird mit den vorhandenen Informationen ausgefüllt, mit Ausnahme des Passworts. Andere Informationen sollten nicht geändert werden.
es: En el paso "Tipo de instalación", tendrás que elegir "actualizar". Se rellenará previamente la información de la base de datos con la información existente excepto la contraseña. El resto de información no debería cambiar.
fr_fr: Lors du choix du type d'installation, vous devrez choisir « Mise à jour ». Les informations relatives à la base de données seront pré-remplies avec les informations existantes, à l'exception du mot de passe. Les autres informations ne devraient pas changer.
it: Al passo "tipo di Installazione", bisognerà selezionare "update". La pagina delle informazioni del database verrà pre compilata con le informazioni esistenti, a eccezione della password. Altre informazioni non devono essere modificate.
ta: "நிறுவல் வகை" படி, நீங்கள் "புதுப்பிப்பு" என்பதை தேர்வு செய்ய வேண்டும். கடவுச்சொல்லைத் தவிர, தரவுத்தள செய்தி பக்கம் ஏற்கனவே உள்ள தகவல்களால் நிரப்பப்படும். பிற தகவல்களை மாற்றக்கூடாது.

source: Note it is important that database name and prefixed used in previous database correspond to configuration.
de: Es ist wichtig, dass der Name der Datenbank und das Präfix, der in der vorherigen Datenbank verwendet wurde, mit der in der Konfiguration übereinstimmen.
es: Ten en cuenta que es importante que el nombre de la base de datos y el prefijo usado en la base de datos anterior corresponda con la configuración.
fr_fr: Notez qu'il est important que les noms et préfixe de la base utilisés dans la version précédente correspondent aux informations.
it: Si noti che è importante che il nome del database e il prefisso utilizzato nel database precedente corrispondano alla configurazione.
ta: முந்தைய தரவுத்தளத்தில் பயன்படுத்தப்படும் தரவுத்தள பெயர் மற்றும் முன்னொட்டு உள்ளமைவுக்கு ஒத்திருப்பது முதன்மை என்பதை நினைவில் கொள்க.

source: Previous version selection
de: Vorherige Version ausgewählt
es: Selección de la versión anterior
fr_fr: Sélection de la version précédente
it: Seleziona versione precedente
ta: முந்தைய பதிப்பு தேர்வு

source: Next step is the choice of the previous Galette version. Installation process will try to "guess" what version it as, and will select this one per default (the one that will be displayed as bold text).
de: Der nächste Schritt ist die Auswahl der vorherigen Galette-Version. Der Installationsprozess versucht zu "erraten", um welche Version es sich handelt, und wählt diese standardmäßig aus (diejenige, die als fetter Text angezeigt wird).
es: El siguiente paso es la elección de la versión anterior de Galette. El proceso de instalación intentará "adivinar" que versión es, y seleccionará esta por defecto (la única que se mostrará en negrita).
fr_fr: La prochaine étape est de choisir la version de Galette précédemment installée. L'installation essaiera de « deviner » de quelle version il s'agissait, et sélectionnera cette dernière par défaut (celle qui sera affichée en caractères gras).
it: Il passo successivo è la scelta della precedente versione Galette. Il processo di installazione cercherà di "indovinare" quale versione sia, e selezionerà il risultato di questa valutazione come valore predefinito (ciò che verrà visualizzato come testo in grassetto).
ta: அடுத்த கட்டம் முந்தைய கேலட் பதிப்பின் தேர்வு. நிறுவல் செயல்முறை எந்த பதிப்பை "யூகிக்க" முயற்சிக்கும், மேலும் இதை இயல்புநிலையாகத் தேர்ந்தெடுக்கும் (தைரியமான உரையாக காண்பிக்கப்படும்).

source: If you try to update but your database version seems already correct, you will be warned. No entry will be displayed as bold text, please make sure to choose the right one:
de: Wenn Sie versuchen zu aktualisieren, aber Ihre Datenbankversion bereits korrekt zu sein scheint, werden Sie gewarnt. Kein Eintrag wird fett dargestellt, bitte stellen Sie sicher, dass Sie den richtigen Eintrag auswählen:
es: Si intentas actualizar pero la versión de tu base de datos ya parece correcta, recibirá un aviso. Ninguna entrada se mostrará en negrita, por favor asegúrate de elegir la correcta:
fr_fr: Si vous essayez de mettre à jour et que votre version de base de données semble être déjà à jour, vous en serez informé. Aucune entrée ne sera pré-sélectionnée, assurez-vous de choisir la bonne :
it: Se si tenta di aggiornare, ma la versione del database sembra già corretta, si sarà avvertititi. Nessuna voce verrà visualizzata come testo in grassetto, assicurarsi di fare la scelta giusta:
ta: நீங்கள் புதுப்பிக்க முயற்சிக்கிறீர்கள், ஆனால் உங்கள் தரவுத்தள பதிப்பு ஏற்கனவே சரியானதாகத் தோன்றினால், உங்களுக்கு எச்சரிக்கை செய்யப்படும். தைரியமான உரையாக எந்த நுழைவும் காட்டப்படாது, தயவுசெய்து சரியானதைத் தேர்வுசெய்யவும்:

source: Once update scripts have run, a summary will be displayed.
de: Sobald die Aktualisierungsskripte ausgeführt wurden, wird eine Zusammenfassung angezeigt.
es: Una vez que se haya ejecutado el código de la actualización, se mostrará un resumen.
fr_fr: Une fois que les scripts de mise à jour auront été exécutés, un récapitulatif sera affiché.
it: Una volta eseguiti gli script di aggiornamento, verrà visualizzato un resoconto delle operazioni.
ta: புதுப்பிப்பு ச்கிரிப்ட்கள் இயங்கியதும், ஒரு சுருக்கம் காண்பிக்கப்படும்.

source: A backup of all Galette files is also recommended it would be helpfull if you find a bug that prevent you to migrate and have to restore an old version;
fr_fr: Une sauvegarde des fichiers de Galette est aussi recommandée qui pourrait être utile si vous rencontriez un problème de mise à jour et devriez restaurer l'ancienne version ;
