Repository: galette/galettedoc
Catalog: source/locale/*/LC_MESSAGES/installation/update.po
Languages: de, es, fr_fr, it, ta

source: Migrating a pre 0.7 release is theorically supported, but this is not tested (those releases are more than 10 years old!), and it is possible your attempt fail.
fr_fr: La migration d'une version antérieure à 0.7 est supportée en théorie, mais ça n'a jamais été testé (ces versions datent de plus de 10 ans), et il est possible que votre tentative échoue.

source: Nothing is really made to make such a time travel ;) If this is your case, you should first `migrate to Galette 0.7.8 <https://download.tuxfamily.org/galette/archives/galette-0.7.8.tar.bz2>`_; and do another migration to the latest version.
fr_fr: Rien n'est vraiment pour un tel voyage dans le temps ;) Dans ce cas, vous devriez dans un premier temps `migrer vers Galette 0.7.8 <https://download.tuxfamily.org/galette/archives/galette-0.7.8.tar.bz2>`_ ; puis d'effectuer une nouvelle migration vers la dernière version.

source: Update process is very similar to :doc:`Galette installation process <galette>`, with some steps that change. All is motly transparent, information are provided on each step.
fr_fr: Le processus de mise à jour est très similaire au :doc:`processus d'installation de Galette <galette>`, avec quelques étapes qui changent. Tout est assez transparent, des informations sont fournies à chaque étape.
